[{"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/42208908", "review_id": "42208908", "date": "Jan 07, 2009", "rating": "", "user_name": "Books Ring Mah Bell", "user_url": "/user/show/372363-books-ring-mah-bell", "text": "Browsing at the bookstore, I was bombarded with posters and an entire table of Paul's \"Revolutionary\" book. Really, Paul? Let me tell you something. If Dr. Atkins can't help the people, how can you? If The Lemon Juice Diet, You: On A Diet, South Beach Diet, The Best Life Diet, The Raw Food Detox Diet, Eat Right 4 Your Type: The Individualized Diet, The Maker's Diet, The Abs Diet, The Great American Detox Diet, The Ultimate Tea Diet, Prevention Flat Belly Diet, The Sonoma Diet, The Thyroid Diet, The 3-Season Diet, The Fat Smash Diet, The Fiber35 Diet, 5-Factor Diet, The Mars and Venus Diet, The No-Grain Diet, The Zone Diet,  AND  The Macrobiotic Diet  have not done the trick what new scam, er, information are you bringing to the table? I see your little \"workbook\", Paul. Everyone has those too. And workout guides. And cookbooks.Revolutionary my ass.Eat less.Cut out the crap foods. (do you really need a book to tell you deep fried shit is bad?)Exercise.There's your revolution, Paul.", "num_likes": 24, "sort_order": "default", "shelves": ["would-rather-eat-my-own-poop-than-r"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/150129715", "review_id": "150129715", "date": "Feb 23, 2011", "rating": 5, "user_name": "Astrid", "user_url": "/user/show/4803841-astrid", "text": "I didn't want to rate this book so highly, as the title offends me! I think it sounds arrogant, and \"thin\" wasn't necessarily what I was looking for - just a healthy relationship with food! But the copy I have fell into my hands by accident - it got left over at a charity car boot sale I helped at, so I kept it out of curiosity, as I am interested in \"Intuitive Eating\" as an approach to improving ones relationship with food. I was pleasantly surprised by the content of this book - it promotes a great attitude with food, and speaks out against the diet industry, which I passionately despise! The accompanying CD is great too, and I really do find it relaxing, and promoting of good eating habits!So here I am, reluctantly giving this book 5 stars!", "num_likes": 20, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1155634246", "review_id": "1155634246", "date": "Jan 04, 2015", "rating": 3, "user_name": "F", "user_url": "/user/show/8161922-f", "text": "As with all Paul McKenna books i feel somethings i could relate to and others not so much.", "num_likes": 15, "sort_order": "default", "shelves": ["2016", "uk", "self-help"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/91746823", "review_id": "91746823", "date": "Feb 27, 2010", "rating": 5, "user_name": "Shelby | Double Up Books", "user_url": "/user/show/1628947-shelby-double-up-books", "text": "The premise of the book is simple... eat when you're hungry and don't eat when you're not hungry. It was almost too simple to be true. When I started doing this I realized the countless amount of times throughout the day that I ate just for eating sake... not because I was hungry. I would also eat way past the point of being hungry - not good. I've noticed a difference in my weight now and am much more calmer about food because of this book.So, if I've told you all this why read the book? We've eaten the way we've eaten for so long that we've forgotten the skill of listening to our body's hunger cues and fullness cues. Paul McKenna will teach you the tips of how to re-learn these skills. A CD accompanies the book as well.  This is one of only 3 self-help books that I've read that actually made a difference in my life (what are the other two? The Secret and Forget Perfect)", "num_likes": 14, "sort_order": "default", "shelves": ["2010-best-books-read"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/49426352", "review_id": "49426352", "date": "Mar 16, 2009", "rating": 5, "user_name": "Liza", "user_url": "/user/show/650623-liza", "text": "Wow, this is amazing! McKenna has four simple rules for weight loss (things like stop eating when you're full). Very easy to follow, and the quick book reinforces the rules. The book includes a hypnosis CD that is 25 minutes long. Listen to it for 2 weeks (I listened at night before bed), and his concepts are reinforced. Now I eat what I want (I can have birthday cake at a party), and just focus on stopping when I'm full. I'm amazed at how much less food I eat and am still full! I'm also in a lot better mood than I have been with other diets. McKenna does talk a lot about a positive self image, and I feel more confident (I know, that sounds cheesy!). I'm using it to lose the last of the baby weight, and so far it's working!", "num_likes": 14, "sort_order": "default", "shelves": ["nonfiction-self-help"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/72227724", "review_id": "72227724", "date": "Sep 23, 2009", "rating": 5, "user_name": "Sarah", "user_url": "/user/show/925957-sarah", "text": "what a fabulous system, yet utterly common sense and \"duh\".why didn't I think of this?IT REALLY WORKS, thats the kicker.there are no diets. No gimmicks.No shakes, no pills, no forbidden foods.follow 4 SIMPLE rules when you eat and you will automatically eat less, lose weight. eat what you want, when you want. Paul McKenna basically teaches you how to reprogram your brain and your eating habits.Eat when you are hungry and stop when you are full.DUH!I highly rcommend this book to anyone who has struggled and failed with every diet known to man. this is as simple as it gets, yet gets results. If you listen to the signals your body is sending, and stop when your body signals you to stop, you WILL lose weight.HIGHLY recommend.", "num_likes": 12, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/263519982", "review_id": "263519982", "date": "Jan 17, 2012", "rating": 3, "user_name": "Christine", "user_url": "/user/show/1531508-christine", "text": "2/14/2012 UPDATE: I have noticed that I do a lot less snacking and eat a lot slower if I remember to follow the rules. I have lost 7 lbs in about 3 weeks. I shared this book with a friend and she has noticed she also snacks less and she has lost 4 lbs in about 2 weeks. Maybe it really can work. You really have to make a conscious effort to think about food differently and not just eat without thinking.Can it really be this simple? This was a quick read with some pretty simple solutions to those of us trying to make the best of our New Years resolutions to lose weight and be healthy. I am excited to put it to the test and will update this review if there are any results (or lack thereof). Read this out loud to my husband while on a road trip and he is up for the challenge also. While traveling we did put some of the suggestions to use. We ate our snacks slowly, savoring the flavor instead of just mindlessly shoving them into our mouths. We did eat less.", "num_likes": 10, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/358489732", "review_id": "358489732", "date": "Jun 30, 2012", "rating": 4, "user_name": "Hil", "user_url": "/user/show/4066488-hil", "text": "At time of writing I am on day 6 of 90 on this weight-loss journey. I will update this review following that to tell you how well it worked. Bear with me if that's what you want to know!For me, this is a brilliant weight-loss system. The criticisms I've seen so far seem to be from people who didn't follow all the steps correctly or give themselves enough time to work with it. This is not a quick fix diet, something you can do for a week then go back to \"eating normally\", it's for people who need to change how they eat for good. Possibly they didn't have 'the right kind' of weight problem (I will explain what I mean about that in a bit!) I don't see how anyone can fail to lose weight if they genuinely follow all the steps - there are only 4! Other criticisms I've seen are about the book being expensive, nothing new and 'just like any other diet book'. I agree that it could be cheaper (which is why I bought mine on ebay!) The version I have is the colour one from 2010 with the CD and DVD. As many of said, the CD and DVD are only the first part of fuller sets which is deemed \"a rip off\" and \"a con\" by some, but you don't need to buy the others - it's not essential, and you can also buy them on ebay - I got the CD set for £3! You can easily get along just with the first CD. The DVD is just a summary of the main points of the book for people who can't be bothered to read it - not essential. You should listen to the CD every day as part of the plan. Some people have struggled with this as his voice sounds quite funny and it can be distracting, but personally I use hypnosis CDs quite a bit when going to sleep so it was fine (although I missed Glenn Harrold!) This version of the book does have a lot of padding - large pretty pictures, large typefaces, pages with no text at all, and there is some repetition in the text as well. In that way, it could be smaller and less glossy and therefore cheaper. The second half of the book is a diet journal you are meant to fill in daily for 90 days. Some people find this \"a con\" as well. It's a very basic journal that involves minimal writing (you just tick things off a list), but it has little exercises each day designed to help you think about things and love yourself and all sorts of things. I like that part because it feels like I'm getting some therapy for my money. I believe in therapeutic journaling, so I think this is a good part of the book, and I'd say keep another journal where you can actually write more! It is like other diet books in that they all tend to state that they aren't diet books and diets don't work. I haven't really read a lot of diet books because I do believe that they are generally a bad thing, but it seems to me that I do agree with everything PM says in here - low-fat, sugar-free 'diet' foods are the devil's work (my words, not Paul's!) and diets make people fatter. They haven't made me fatter, because I don't tend to diet, but nevertheless, I am fat because I eat too much. Or rather, I have been eating too much - I'm not now! This is where I come to being \"the wrong kind of weight problem\" for this book...I think there are two kinds of fat people - people who have always been fat and people who have got fat in later life. They may look the same but they behave differently. If you have got fat because you gave birth a few times, or went out drinking a lot in your twenties, developed bad habits at university, didn't have tme to eat well looking after kids etc. you will feel differently about your fatness than someone who grew up chubby and got teased, overate for comfort after being bullied, learned how to they could best 'blend in' with the people of normal size growing up, used their fatness as armour, ate in secret, learning to move our bulk through an average-sized world without causing too much offence...that makes a different kind of fat person. Any kind of fat person can use this system, whether they have 1 stone or 400 stones to lose. Paul uses examples from many different situations. But I think the 'lifelong fatties' would probably benefit from it more because of all the work on self-esteem and body-image. If you do this properly, it is a life change and a long, slow & steady journey and that's how long it takes to make your brain adjust to being normal after a lifetime of thinking it's not. It works with the inner problems causing you to overeat, and not just on the rules of what to eat - there are no rules of what to eat!There are also NLP techniques to deal with food cravings - not sure what I think about those because I've not tried them and haven't needed to yet. I will if I have a strong craving. Maybe it's one of those things that work if you believe it will.I would say, buy it second-hand, follow all the steps including the CD (remember that Paul McKenna is a famous hypnotist and not a dietician, so that will be a key part of this!), give it some time and TRUST that it will work, DON'T keep weighing yourself, take or leave the DVD and NLP, keep a journal, move around more, drink water, play motivational music, eat slowly and listen to your body. The worst thing that will happen is you won't lose any weight at all, but I'd like to see you try.", "num_likes": 6, "sort_order": "default", "shelves": ["challenge2012"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/42510797", "review_id": "42510797", "date": "Jan 09, 2009", "rating": 5, "user_name": "Juline", "user_url": "/user/show/1614386-juline", "text": "Wow! I watched his television series and was very impressed. Picked up the book on an impulse at B&N. It comes with a CD that is a self-hypnosis CD. I LOVE IT!!! This guy has SOMETHING right!!!! I have found myself moving around more today and am much more aware of real hunger versus emotional hunger. Definatly worth the read. Hoping this really helps. So far I like what it is doing. ", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1661793321", "review_id": "1661793321", "date": "Jun 07, 2016", "rating": 4, "user_name": "SheAintGotNoShoes", "user_url": "/user/show/55625032-sheaintgotnoshoes", "text": "Very helpful book.Pretty much intuitive eating. Eat only when hungry, stop when you had enough, eat what you like not what you think you should eat, etc.He is engaging and has a pleasant speaking voice ( comes with cd )", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/389884293", "review_id": "389884293", "date": "Aug 12, 2012", "rating": 4, "user_name": "Jennifer", "user_url": "/user/show/2206412-jennifer", "text": "Well this is totally unexpected, but... this guy really knows what he's doing! The problem for some people might be that he doesn't get into explaining how all of this stuff works to change your brain into functioning like a thin person's brain. I think he purposely tried to keep this very simple. So for someone like me who's not convinced about such things until she understands how they work, this book could easily be blown off as self-help hogwash. But since he takes ideas from things I've been learning about for a bit, I can see the genius behind it. I'm just not sure your average reader is going to blindly trust this method enough to really keep up with it (even though there's really not that much to keep up with). When I picked up this book (for $1), I thought, \"Yeah well sure... hypnosis is great, but EFT will REALLY get your brain on the right track.\" Well guess what... he teaches EFT in the book! And a variation of the HAMR technique (see this blog about how one person recovered from MCS by using limbic retraining, EFT and HAMR), as well as NLP and some other brain-retraining techniques that I've been using from the Gupta Programme. So if any of the folks using Gupta or DNRS brain retraining would like to tackle some issues around eating, this is a good place to start. And I have to say, after a week of reading this and listening to the CD twice a day, I can't say that I'm really putting forth an effort to slim down, but I do find that I'm just less interested in eating things or amounts that I really \"shouldn't\" be eating. (Although he would say there's no food you \"shouldn't\" eat, I kinda think that's just a little bit of bait-and-switch on his part. You're not supposed to think that you're denying yourself your \"favorites,\" but I think you might wind up changing your mind about how appealing your favorites really are.) Of course the additional reading that I do about what different foods/chems do to your health, or how they're slaughtered/produced, also helps me to train my brain away from craving certain things.Of course, I obviously don't completely agree with someone who says, \"Eat whatever you want.\" But hey... if the simple nature of this program is what it takes for it to work for people, then so be it.ALL THAT SAID, I don't expect any magical results from this, mainly because I have trouble with two of the four rules: Eat when you're hungry, and stop eating when you think you're full. I'm one of those people he talks about who used to starve themselves and so has trained themselves to not know what hunger feels like. In addition, my MCS-related digestive pains are something I can't usually differentiate from hunger sensations. So what I'm saying is... I don't know how to tell when I'm hungry or when I'm full (until either is at an extreme, and then it becomes obvious; and then there are times when I feel both extremes simultaneously... so you can see this gets confusing for me). I've also learned, from years of having ulcers, a reflex of feeding myself to get rid of any \"sick\" feelings. So you can imagine that I really started putting on the pounds when I became chronically ill. This isn't directly addressed in the book, but I can extrapolate a plan for breaking that reflex with EFT and/or HAMR (we'll see if I ever actually put forth the effort, though... I've got bigger fish to fry for now). I just would get more out of this if he had a better method for teaching yourself how to learn what hungry feels like. ", "num_likes": 4, "sort_order": "default", "shelves": ["psychology-and-self-help", "mind-body", "diet-nutrition"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/163413783", "review_id": "163413783", "date": "Apr 25, 2011", "rating": 5, "user_name": "Will Jeffries", "user_url": "/user/show/5268364-will-jeffries", "text": "This book was truly inspiring to me. Before reading this book, I struggled with getting my weight under control. I was eating out all the time, and (yes, you guessed it) - gaining weight and puttin' on the pounds.Some helpful and encouraging notes I jotted down from this book include:1. It's a good idea to make your first response to hunger pangs a fresh glass of water. If you're not hungry afterward, it was thirst; if you still are, dig in!2. As soon as you've had enought to eat, you'll notice that each subsequent bit of food becomes a little less enjoyable than the one before. The more you pay attention to this phenomenon, the more obvious it becomes.3. Fully enjoy every single mouthful.4 Elements of the System:1). Eat when you're hungry.2). Eat only what you want, never what you think you \"should\".3). Eat consciously and enjoy every mouthful.4). Stop when you think you're full.Plus, this book comes with a helpful CD with Paul McKenna taking you into a short 20-minute hypnosis session. It is a fun, easy and short read. Enjoy!", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/48165565", "review_id": "48165565", "date": "Mar 03, 2009", "rating": 4, "user_name": "Ginger", "user_url": "/user/show/1855350-ginger", "text": "This is by a guy who takes behavioural cognative therapy and applies it to weight loss. Not new, not revolutionary, but why does it need to be? I think that's the problem most people have with weight loss: it's so simple, we overlook it. Let me summarize:His four golden rules are1. Eat when you're hungry.2. Eat only what you truly want, not what you think you should eat.3. Eat every bite consciously, tasting and enjoying it fully.4. Stop when you think you're full.He also adds moving every day and drinking water, and he talks about letting go of emotional attachments to food and removing the \"fixation\" with food by redirecting your brain. So, this all sounds too simple. And it is! But it is not easy to truly follow these guidelines.Ugh. And I thought there was some big mystery. I really trying to give it a shot, and so far I feel a bit better every day. Wow, can it be the simplest path winds up being the most effective? If so, I am totally behind that.", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/514591898", "review_id": "514591898", "date": "Jan 23, 2013", "rating": 5, "user_name": "Sarah", "user_url": "/user/show/207385-sarah", "text": "I was a little bit dubious about reading Paul McKennas books mainly because my only experience of him has been watching his stage shows. As a fellow Hypnotherapist (Clinical not Stage), I was intrigued to see what his approach was at dealing with issues that I see clients for on a regular basis. I had also been recommended it by another hypnotherapist. I was very impressed with the book. It only took me an hour to read it - has some great facts and information in there and is really easy to follow. A simple approach - Eat when your hungry, Consciously enjoy what your eating, Stop when you are full! It talks about how diets don't work and quotes some great little pieces of research. I do not need to lose weight at all so I didn't listen to the CD in the way the book suggests, although I did listen to it the once to get an idea of the content and techniques used to compare to my current approach and thought it was spot on.", "num_likes": 4, "sort_order": "default", "shelves": ["hypnotherapy-and-mental-health"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/517583516", "review_id": "517583516", "date": "Jan 26, 2013", "rating": 1, "user_name": "Phil Booth", "user_url": "/user/show/16826369-phil-booth", "text": "I read Paul Mckenna's book several times from cover to cover,listened to the cd,and even attended his \"weight-loss event\";(which mainly consisted consisted of him explaining the book-presumably for people who were unable to read!)After having tried everything he suggests and following the instructions to the letter I can truthfully say: IT DID NOT WORK AT ALL for me!In fact I gained weight whilst trying to apply the principles he promotes.I sincerely believe that the \"Paul Mckenna weight loss method\"is just a modern day example of \"The Emperor's New Clothes\";hopefully people will hear my small voice of sanity and stop getting sucked in and exploited by the power of commercially motivated advertising on this charlatan's products.I know there are a lot of people who struggle with issues of weight and I think it is most unethical that this man exploits his position of minor celebrity to cash in on vulnerable consumers.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/46089204", "review_id": "46089204", "date": "Feb 11, 2009", "rating": 5, "user_name": "Teresa", "user_url": "/user/show/1278254-teresa", "text": "I'ts a short book and an easy read. I think he's right on with ideas about changing our relationship with food and his very simple rules. It's very \"anti-diet\", (yea!) and more about reprogramming habits and thoughts so that healthier eating is normal life...by choice. My girls and I are going to give it a go...I'll let you know. I already feel a difference in how I'm eating...and he insists that you eat when your hungry, and what you want, and S-L-O-W-L-Y, etc. He also includes some methods to reduce cravings and ways to deal with sabotaging beliefs. I already know the methods he teaches...kind of cracked me up actually...and yes, they work.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/47133396", "review_id": "47133396", "date": "Feb 22, 2009", "rating": 4, "user_name": "Ali", "user_url": "/user/show/2059479-ali", "text": "This book doesn't contain any real new information. Many other people out there have said what McKenna is saying. But what I found different about this book was the simpleness and how concisely he has presented his four simple rules. I felt good reading it and I am stiving to fit his philosophies into my life. Even though I've read other books saying the same thing, this was the one book that spoke to me.As for the CD, it was quite weird to listen to at first. I didn't know what to make of it. But now, I listen often and really enjoy it.", "num_likes": 3, "sort_order": "default", "shelves": ["health-weight-loss"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/263842634", "review_id": "263842634", "date": "Jan 18, 2012", "rating": 3, "user_name": "Nikki Magennis", "user_url": "/user/show/2420137-nikki-magennis", "text": "Though I'm shriveling with shame, I am going to bravely list my latest rash of self-improvement books. This one is ludicrously thin itself, as if the slimness of the volume will subconsciously encourage your quest, and McKenna makes my skin crawl. But his central message I can dig - eat what you want, when you want. Learn to listen to your body. Relearn what it means to be hungry. (There really isn't very much more to the text than this. But it does have a shiny CD). Whether it works or not remains to be seen, she says, weeping into her cheesecake like a sad, fat bird. ", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/63038399", "review_id": "63038399", "date": "Jul 11, 2009", "rating": 4, "user_name": "Susan", "user_url": "/user/show/202004-susan", "text": "The author gives very sensible advice (though Geneen Roth gave it first - many, many years ago). However, I got the feeling he didn't REALLY mean that you could eat anything you wanted. Why else give instructions on how to get rid of a craving or stop eating a food forever?", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2453793271", "review_id": "2453793271", "date": "Jul 11, 2018", "rating": 3, "user_name": "Shirley Revill", "user_url": "/user/show/14433136-shirley-revill", "text": "A really good book but it didn't work for me. I am a lost cause. :)", "num_likes": 3, "sort_order": "default", "shelves": ["factual", "food"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/43264692", "review_id": "43264692", "date": "Jan 16, 2009", "rating": 4, "user_name": "Monica", "user_url": "/user/show/820099-monica", "text": "Ok, I read this book in one day... but he says you won't start seeing results for a couple of weeks. (You have to listen to the CD everyday for 2 weeks) So it's hard to rate if I really liked it or not. I guess it depends if it works... the rating will go up, if it doesn't, it'll go down.But I do agree with a lot of what was in the book and it made me feel better about myself - so at this point it gets 4 stars. ", "num_likes": 2, "sort_order": "default", "shelves": ["own"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/100243034", "review_id": "100243034", "date": "Apr 26, 2010", "rating": 3, "user_name": "Debbie", "user_url": "/user/show/852595-debbie", "text": "Interesting concept. I love the 4 rules. Eat when you're hungry, eat what you want, enjoy every bite, stop eating when you're full. And the biggest tip - slow down! Mike even noticed that I was eating very slow! But I like the idea of recognizing that we should eat out of hunger for the enjoyment of food and not for emotional reasons or boredom or just plain habit. All the reviews on this were good, it works for lots of people.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/43288934", "review_id": "43288934", "date": "Jan 16, 2009", "rating": 4, "user_name": "Marti", "user_url": "/user/show/1096785-marti", "text": "This is simple common sense approach to managing food in your life. It is not a diet book. It is a system with helps for taking charge of your eating habits. It comes with a hypnosis CD which I didn't listen to. I did get some helpful hints about resetting my metabolism. The rest of the system is pretty much what I already do only it never hurts to be reminded. Quick read.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/49336383", "review_id": "49336383", "date": "Mar 15, 2009", "rating": 4, "user_name": "Mindy", "user_url": "/user/show/308281-mindy", "text": "Well another diet book - but not a diet book! I'm giving it a try. This is the first time since I was 12 that I can actually say I am not on a diet. And it feels really, really good. I feel like I control food - it does not control me for the first time ever. Now lets see if I gain, loose or stay the same :)", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/59919933", "review_id": "59919933", "date": "Jun 16, 2009", "rating": 4, "user_name": "Randi", "user_url": "/user/show/2063914-randi", "text": "This book had a lot of good information and made a lot of sense. I guess I'll edit my review once I see if the system works or not.I will say this though - I listened to the hypnosis CD before bed last night, and it actually was funny to me. Maybe I'm one of these people who needs to be asleep for it to work...", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/90514316", "review_id": "90514316", "date": "Feb 20, 2010", "rating": 4, "user_name": "Josh", "user_url": "/user/show/1969317-josh", "text": "Embarrassing to admit to reading these things. It actually was a perfectly sound, easily implemented approach. It makes you question why we consume food without savoring it. He advocates a truly sensuous eating experience. I did it for two weeks, I think, but I decided calorie counting is easier for me. I like to pig out from time to time. But good book, easy read.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/38236785", "review_id": "38236785", "date": "Nov 20, 2008", "rating": 4, "user_name": "Meagan", "user_url": "/user/show/1464600-meagan", "text": "Really good. Just a common sense approach to weight loss. But it's all so common sense if you're not trying to lose weight. Makes eating more enjoyable and doesn't deny you any of your favourite foods.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/43805378", "review_id": "43805378", "date": "Jan 21, 2009", "rating": 5, "user_name": "Jonathan", "user_url": "/user/show/737794-jonathan", "text": "This book was fantastic. Don't let the title fool you because it is not a diet book at all. It helps those of us who have been on the diet coaster find a calm and centered way to stop hating food (or loving it too much).", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/57359288", "review_id": "57359288", "date": "May 26, 2009", "rating": 1, "user_name": "Michelle Piper", "user_url": "/user/show/2087561-michelle-piper", "text": "This whole book drags out four principles, eat when you are hungry, stop when you are full, eat what you want, and eat consciously over 100 pages. Save yourself the time and money! Nothing new in this book that we haven't heard before. Blah. ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/98032011", "review_id": "98032011", "date": "Apr 11, 2010", "rating": 5, "user_name": "Bryan Jacobson", "user_url": "/user/show/2845998-bryan-jacobson", "text": "I'm very glad I got this book. It has a host of useful, common sense techniques and ideas that have really worked for me. The listening CD is a great way to remember and re-enforce the ideas in the book.", "num_likes": 2, "sort_order": "default", "shelves": ["non-fiction"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/536576162", "review_id": "536576162", "date": "Feb 14, 2013", "rating": 5, "user_name": "Donna", "user_url": "/user/show/9724192-donna", "text": "This book has changed my relationship with food. I am down 11 pounds in 4 weeks and have not felt hungry or deprived myself of anything during this time. I will never see food the same way again. This is not hypnosis, but rather cognitive behavioral reframing and it is just powerful. ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/44528349", "review_id": "44528349", "date": "Jan 27, 2009", "rating": 5, "user_name": "Carol", "user_url": "/user/show/1343016-carol", "text": "I would recommend this book to loose weight in a healthy way. It changed my eating habits.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/4158970128", "review_id": "4158970128", "date": "Dec 06, 2021", "rating": 3, "user_name": "Cathal Kenneally", "user_url": "/user/show/31913163-cathal-kenneally", "text": "Not often would I review a self help book but I think it warrants one. While there are some interesting tips and helpful information for people who are serious on weight loss, me included. The sad thing is that the accompanying CD is not recommended for people who suffer from epilepsy, such as myself. I wanted to try hypnosis years ago to give up smoking but I’m glad I didn’t try it now and went cold turkey instead. It’s a shame I would have been interested in what the actual CD content actually does to enhance the process. Never mind. I’ll keep this on the shelf as a reference book as he does put across some very compelling arguments and useful information to take on board. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3200452402", "review_id": "3200452402", "date": "Feb 22, 2020", "rating": 3, "user_name": "Ephie", "user_url": "/user/show/30966195-ephie", "text": "I enjoyed reading this book as it reads like a magazine - great for the beach, quick and easy!I didn’t really learn anything new from this book, however, I liked that it covered some important topics like body dysmorphia, comfort eating, etc. Good to read to reinforce the importance of eating correctly and healthily, not just dieting to lose weight and look better.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3400255700", "review_id": "3400255700", "date": "Jul 09, 2020", "rating": 4, "user_name": "Alistair Miller", "user_url": "/user/show/9026522-alistair-miller", "text": "I bought this book years ago but didn't really implement the system. I feel like I am ready to do so now. This is basically about conscious eating. Not just shoving your food down, but taking your time to eat it and listening to the signals of your body. I'm quite excited by the ideas in this book because it feels that it will help you develop a healthy relationship with food, which you don't get on restrictive diets or through constantly giving in to cravings.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/325643757", "review_id": "325643757", "date": "May 07, 2012", "rating": 4, "user_name": "Ru", "user_url": "/user/show/8230069-ru", "text": "I am not one to sit around and read self-help books because quite frankly I don't think I need much help. Being thin has never really been a huge concern of mine but who doesn't want to be that little bit thinner.When my friend suggested to lend me this book, I thought- why not? It looks short and she insisted it helps. After reading this book- I think this was 2/3 years ago- I suddenley started becoming so concious of my bad eating habbits and tried to gear them to how he suggests they should be changed. I can't really say I had the most magical results (as shown by the extreme photographs of people he has helped)- but till now, after the few years that have gone by I still remember the snappy, memorable tips in the book he has given and with time I have actually learnt to eat less and have become self-disciplined with the way I eat.I haven't given this book the 5th star because I didn't get a weight change as big as the ladies in the dramatic pictures, unfortunatley. But yes, I have defintely lost a few kgs because of his little theories and I don't think I'll ever forget his tips.If you can't give up good, self-indulgent foods, will never go on a self restricting diet (like me) and you're up for a quick read then this is the perfect read!P.S. I never tried out the CD- hypnotism isn't really my thing.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1394389289", "review_id": "1394389289", "date": "Sep 17, 2015", "rating": 5, "user_name": "Pankaj", "user_url": "/user/show/22868021-pankaj", "text": "Good book. I haven't felt any change in my body during reading the book but expecting some good result. By doing slow speed eating makes me to have conscious eating which is also discussed in Rajiv dixit speech. Good book to read and thanks to mr Sandeep maheshwari ji. From there I got the information about this book. Again everyone should read at least once. Thanks for reading my review.I read this book second time because I was failed to follow the rules. That's why I read it again to follow the rules and to keep the rules in my mind always to follow the rules. I'll read it again if I again failed to follow the rules. A great book to know your body and to make it healthy. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/150241102", "review_id": "150241102", "date": "Feb 24, 2011", "rating": 4, "user_name": "Rebecca E.", "user_url": "/user/show/1498800-rebecca-e", "text": "This book is great to read, full of common sense and useful advice. Obviously it's hard to give a full review as its effectiveness will only be really seen long-term, but I can say that I've noticed a shift in my eating patterns already. I needed this because I'm a bad snacker so even the little change I've seen so far is a good sign. The CD takes a bit of getting used to but very quickly gets you very relaxed and again, we'll see how it works out long-term. Definitely worth a read if you want to change your eating habits!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/987433555", "review_id": "987433555", "date": "Jul 05, 2014", "rating": 1, "user_name": "Sophia Rose", "user_url": "/user/show/32832298-sophia-rose", "text": "The book comes with a CD that I was really interested in. Unless you have a portable CD player with headphones this really isn't effective. I have a normal radio that plays CD's but it isn't as effective if its played over open air verses directly via earbuds that you can listen to over and over. Also you're unable to listen to the CD while driving, and this is probably my fault. I thought he'd give helpful hints not put you through hypnosis. He seems like a very charismatic guy but I would not recommend to anyone trying to lose weight.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1861226162", "review_id": "1861226162", "date": "Jan 02, 2017", "rating": 3, "user_name": "Rosemary", "user_url": "/user/show/4723954-rosemary", "text": "Some good points here - particularly about eating slowly, and noticing when the food becomes less tasty because it means you've had enough. But I hate the title, and it's not just the title, there's a sense through the book and with the CD that you have to give McKenna power over yourself and your eating. Also, he doesn't address the question of how you can wait until you are hungry and then eat exactly what you want if you don't have exactly what you want in the house and the shops are closed, or if it will take two hours to cook.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/98397827", "review_id": "98397827", "date": "Apr 13, 2010", "rating": 2, "user_name": "Adrienna", "user_url": "/user/show/1743124-adrienna", "text": "I bought into a previous hypnosis MP3 program to see weight loss and did not work for me. He speaks on emotional eating, etc...and deals with more. I tried to listen to CD with book and monotone drove me crazy after 2-3 minutes of playing. The other man that I have still on MP3 is better voice to relax and listen to, dosed off to sleep though. Did not see weight loss--who knows, maybe it does not work for my psyche (mental).", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/332412279", "review_id": "332412279", "date": "May 18, 2012", "rating": 5, "user_name": "Debby", "user_url": "/user/show/9574977-debby", "text": "Read this book in under a day, it comes with a CD, which being partially deaf, I couldn't understand, someone transcribed it all for me and within a few times of listening and reading, I could understand what Paul was saying, I still use his princples now ... I'm no longer a member of the 'clean plate club' :)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1361303697", "review_id": "1361303697", "date": "Aug 11, 2015", "rating": 3, "user_name": "Rania", "user_url": "/user/show/26566978-rania", "text": "eat when you only feel hungryeat what you want ,not what you should eateat conscious and enjoy each piecestop eating when you feel gorgethese tips looks easy but actually they are nothowever,it really works ,but the most important one is about low-self esteem as you have to accept your self to make difference ..0", "num_likes": 0, "sort_order": "default", "shelves": ["health"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/41852227", "review_id": "41852227", "date": "Jan 04, 2009", "rating": 4, "user_name": "Cherry", "user_url": "/user/show/1541979-cherry", "text": "I lost 7 pounds following this and then I didn't have time for reading and listening to the CD and I've been so stressed with my job search that I gained back 4 of those pounds. I'll try this program again once I get back into a normal routine.", "num_likes": 0, "sort_order": "default", "shelves": ["books-to-finish-later"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/58860666", "review_id": "58860666", "date": "Jun 08, 2009", "rating": 4, "user_name": "Linda", "user_url": "/user/show/1552557-linda", "text": "This book simplifies weight loss and helps you to gain control over emotional eating. Also, it helped me to get to know my body better in terms of what it actually feels like to be hungry and to be full. It comes with a 30-minute hypnosis track which is really awesome as well.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/95730462", "review_id": "95730462", "date": "Mar 25, 2010", "rating": 4, "user_name": "Carol", "user_url": "/user/show/1209770-carol", "text": "I have heard these theories on weight loss before (only eat when you're hungry, stop when you're full), but it doesn't hurt to be reminded. A good guide for those trying to lose weight or on maintenance.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1144593788", "review_id": "1144593788", "date": "Dec 28, 2014", "rating": "", "user_name": "Becky Black", "user_url": "/user/show/2210353-becky-black", "text": "I'm not convinced. I don't belive the type of food you eat is irrelevant. Also who haa time to take 4 times as long over meals and not have mealtimes, only eat when hungry? Nice idea, but doesn't exactly fit in with real life, does ir?", "num_likes": 0, "sort_order": "default", "shelves": ["non-fiction"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1158615101", "review_id": "1158615101", "date": "Jan 06, 2015", "rating": 3, "user_name": "MeNna Salah", "user_url": "/user/show/13961465-menna-salah", "text": "You must trust your self and hear your body voice ;)", "num_likes": 0, "sort_order": "default", "shelves": ["diet"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3798693503", "review_id": "3798693503", "date": "Jan 26, 2021", "rating": 4, "user_name": "Cara", "user_url": "/user/show/2021933-cara", "text": "I'm a little embarrassed to have read this, but this guy sure helped me a lot with I Can Make You Confident, so I figured what the hell.The premise is simple. We overeat because we're trying to feel better with respect to our emotional hunger, and food can never solve that. If you just eat what your body wants, you won't be overweight. Therefore, he has four rules in his system:1. Eat when you're (physically) hungry—and only when you're (physically) hungry.2. Eat what you actually want (not what you think you should eat).3. Consciously savor every bite.4. Stop eating when you're not hungry any more.There are no forbidden foods or deprivations on this plan. You can eat whatever you want whenever you want, as long as you're actually hungry, you pay attention to every bite, and you stop when you're not hungry any more. (No more clean plate club!) According to the author, all the restrictions are actually what sets up the vicious cycle of slower metabolism, falling off the wagon, and weight gain in the first place. That does make sense to me.Most of what he says matches my experiences, so I think he's right. The way I lost 40 pounds before was by letting go of my desire to protect myself with fat and by consciously refusing to address feeling less than happy with food anymore. (Such a revelation when I realized that was what I was doing!) That totally worked until a few months ago, when I started a mad fiesta of celebratory eating. Hm, turns out eating because things are going well is no better than eating because things suck. Who knew? Haha.Anyway, I'm intrigued by the idea of eating anything you want. That seems like it could cause problems. (I tend to want peanut butter and linguine Alfredo. Not together. Just, those are two things I'd eat the shit out of if I wasn't trying to weigh less.) But it seems worth a try. Being able to eat everything sounds really good. I'm tired of going cold turkey on sugar and then falling off the wagon and regaining a bunch of fat. It would be nice to be able to eat treats sometimes and just have it not be a big deal. That seems like the healthiest approach.I haven't listened to the hypnosis CD yet, but I've found his other ones really helpful. I wish I could reprogram all the garbage in my brain, really.This could be a life-changer; we'll see. I expect the first week or two to be kind of rocky as a sudden free-for-all of eating anything, but hopefully after the \"forbidden fruit\" thing stops being a thing, this will work pretty smoothly. If it really does work like he says, that will be amazing. Who doesn't want to be the right weight and still get to eat everything you like? ", "num_likes": 0, "sort_order": "default", "shelves": ["inspiration", "health"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3968829846", "review_id": "3968829846", "date": "Apr 27, 2021", "rating": 3, "user_name": "Musings of a Middle-aged Mum", "user_url": "/user/show/107499718-musings-of-a-middle-aged-mum", "text": "Given not much else was working, at the start of the year, I purchased I Can Make You Thin.I remember Paul McKenna from his TV hypnotism where people would act like fools on stage. But, having used hypnotherapy when I was pregnant, I know that it can work. Mainly, I got this for the book, because, well, I like books.I read the book slowly, as I wanted to take in as much as possible, and I listened to the audio/hypnotherapy when I had a spare half hour. I found that by listening regularly, it helped me keep in mind the positive reasons why I'd like to lose weight and encouraged self belief that I could make it happen. Much of the book is common sense, and it dovetails nicely with other books I've been reading concurrently, but having the audio is worth the price of the book itself. I haven't lost much weight using it; it certainly isn't a cure-all - but the repetition of eating slowly and mindfully does help you develop good eating habits, and this book is much more about a lifestyle change, rather than weightloss (imo, despite the title of the book).So, would I recommend it? Actually, yes. Even though I didn't lose weight using it, it has helped give me the self belief that I am worth it, I deserve to be fit and healthy, and taking just 30min a day to rest and focus on myself, is good for me too. And as I have made other changes to my life recently, maybe this book and audio have had more, indirect, impact than I thought when I started this review.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3283927285", "review_id": "3283927285", "date": "Apr 16, 2020", "rating": 4, "user_name": "Sriram", "user_url": "/user/show/111870358-sriram", "text": "This was a great book . Paul has got one of the most practically applicable method(working too).. for people who are out there , who wants to reduce you weight . it really worked for me . I weighed around 85 kilograms and i have been following this method for past 5 months and really it works !!!!!(i am 71 now)All i did was i did what he asked to do nothing more than that and at the same time i didn't compromise with any practices. What makes this more special is that it is the real way of eating food (actually the only way we must be consuming )... so anyone who is interested please try it .. it will work but remember not to violate the rules . if you do so do not expect for staggering results . Blindly follow what he says and you will end up where you want .. it might be harder at first but it is worth it .when you keep on doing it it becomes a part of you and you'll automatically do it as how you brush your teeth every morning . it becomes a routine and you'll not be able to get out of this and stay fit till you're alive ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/4524253771", "review_id": "4524253771", "date": "Feb 02, 2022", "rating": 4, "user_name": "Helen", "user_url": "/user/show/137769336-helen", "text": "Brilliant book and audio Bought this book on a bit of a whim - was only 99p on kindle so thought why not. I am only a few days in to starting the program and I have to say I think this is the best 99p I have ever spent! I'm not weighing myself for a couple of weeks so I won't know if I have lost any weight for a little while but I am loving this new way of eating/thinking. I already feel more relaxed around food and with forbidden foods removed I have lost that obsessive destructive thought process around certain foods. Eating slowly and listening to the signals from my body is working really well and I am starting (already) to not hate what I see in the mirror anymore. Would recommend to anyone who has tried countless diets and is sick of the losing/gaining cycle they produce. Definitely worth a read!! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3065954868", "review_id": "3065954868", "date": "Nov 29, 2019", "rating": 4, "user_name": "Donna", "user_url": "/user/show/64042698-donna", "text": "I got this book when it was on offer, and thought it would be good for a flick through if nothing else. I actually read the whole book, and found there was a lot of sense in it, with many things that resonated with me too. And while I've never dieted (I just can't be bothered!), I have put into practice the tips from this book, as they are NOT a diet. I've not listened to the audio yet, but I'm going to as soon as I get the chance, as a friend told me it's well worth doing. So would I recommend this book? Yes. Is it a magic wand to miraculously lose weight? No! You still need to put some time, thought and effort in. But it's certainly not about starving yourself or denying everything yummy, so in that sense, it's the best idea ever!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/4530084675", "review_id": "4530084675", "date": "Feb 05, 2022", "rating": 5, "user_name": "Abhilasha Chander", "user_url": "/user/show/86792473-abhilasha-chander", "text": "I can make you think by Paul McCenna:1) Hunger meter from1 to 10: Stop between 6$7 and eat between3 and 4.2) Thin People keeps on eating, they don't starve themselves while fat people wait for meals until they get super hungry $then eat at light speed. 3) Decrease your eating speed. Really enjoy the food, the texture, the ingredients, the smell. This way you well feel more satisfied, cat less.4)Once you ase eating at light speed, that extra food gets stored as fats.5) eating I making love releases serotonin that makes you eat more/do more.6) eating a lot would always put you in guilt mode, and the sad thing is you will never be satisfied 7) Eat when you get hungry, cat consciously, enjoy every bit", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2852852489", "review_id": "2852852489", "date": "Jul 03, 2019", "rating": 5, "user_name": "Janette Collins", "user_url": "/user/show/88681960-janette-collins", "text": "Wow!Paul always has the answers, he helped me regain confidence with his instant confidence and now my life’s changing again with a new sense of eating. I hate weighing myself so thanks Paul for not making me do it. Not only has this change effected my eating habits it’s helped with many other area’s of my life.If you’re looking for a better relationship with food, I totally recommend.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2990022084", "review_id": "2990022084", "date": "Sep 25, 2019", "rating": 5, "user_name": "Stuart Beaney", "user_url": "/user/show/32798738-stuart-beaney", "text": "I read this to help me cultivate a better relationship with food. I’m a runner and my bad dietary habits are holding me back. Fad diets are rubbish and unsustainable. This book has a simple but effective message at the heart of it, eat what you want when you’re hungry, stop when you’re full. There’s lots of methods to help you achieve this healthier approach to eating. Let’s see how it goes! I’d recommend to anyone who struggles with emotional eating. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3171537654", "review_id": "3171537654", "date": "Feb 01, 2020", "rating": 3, "user_name": "Abigail", "user_url": "/user/show/21672825-abigail", "text": "This is essentially the ideas of intuitive eating with some brain training stuff. It's a quick read, took me maybe about an hour tops. If you've read anything else about this type of eating there's nothing new on that front. The cognitive stuff might be interesting for you, however. I found the tapping technique for cravings to be silly sounding yet effective at distracting my brain so I'll keep that one around.", "num_likes": 0, "sort_order": "default", "shelves": ["non-fiction", "food"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3837941151", "review_id": "3837941151", "date": "Jan 18, 2022", "rating": 3, "user_name": "Akshat Pandey", "user_url": "/user/show/63834508-akshat-pandey", "text": "This is a book on 'How to eat Right' and one should expect only that. The four rules on how to eat and concept of developing your own metabolism are pretty straightforward and easy, which is what I liked about this book.However, besides these, there is a load of mental exercises and what not, which makes even this 144 page book to be a bit long to read, which brings down the quality of the material as a whole.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1952020466", "review_id": "1952020466", "date": "Mar 25, 2017", "rating": 5, "user_name": "Susan", "user_url": "/user/show/51352214-susan", "text": "Fascinating book. I really liked the exercises to \"re-wire\" your brain. I've tried a couple of them, and they seem to work. Now, I just need to listen to the cds and put this into practice! I will come back in two weeks to update my review so that could include whether or not I actually follow this and lose weight!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2983276054", "review_id": "2983276054", "date": "Sep 19, 2019", "rating": "", "user_name": "Vignesh R", "user_url": "/user/show/44646476-vignesh-r", "text": "One phrase. Paul Mckenna will make you lean through his one mantra 'Chew the water and drink the food'. The book is pretty much all about that. I followed this sincerely and did loose my weight. Excellent one. The author also gives psychological solutions to tackle the initial difficulties in practicing this mantra.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/4039153742", "review_id": "4039153742", "date": "Jun 04, 2021", "rating": 5, "user_name": "Dorota Winch", "user_url": "/user/show/120145899-dorota-winch", "text": "I wasn't planning to get this book, but I saw it on daily deals tab, and as I always admired Paul's other books I decided to buy it and read just to see what's in it. That was a very good decision! His NLP techniques are super easy and brilliant at the same time! I think I will never need to diet again in my life, while enjoying mu favourite food at the same time! Love it!", "num_likes": 0, "sort_order": "default", "shelves": ["read-in-2021"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2379290380", "review_id": "2379290380", "date": "May 04, 2018", "rating": 4, "user_name": "Bruce Smith", "user_url": "/user/show/45543280-bruce-smith", "text": "Self ControlGood techniques to help you focus in your own self control. The underlying message is learning to eat in moderation and take control of your life. Common sense but well affirmed by McKenna. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1785861713", "review_id": "1785861713", "date": "Jul 22, 2018", "rating": 5, "user_name": "Amit Doshi", "user_url": "/user/show/51423671-amit-doshi", "text": "I think this book is really important. I am implementing the methods indicated and has started seeing results. I am hopeful, if I implement it fully and consistently I should get desired results. A must read for everyone who wants to get fit.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/4012729248", "review_id": "4012729248", "date": "May 20, 2021", "rating": 4, "user_name": "Linggar Juwita", "user_url": "/user/show/69867503-linggar-juwita", "text": "I saw it on sale on Kindle Store, so I tried the sample with zero expectations, and I end up buying it.He uses hypnotic therapy techniques in this book, but I skipped most of it. His interesting perspectives that make me finished it in one sit. Nice read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/4097628192", "review_id": "4097628192", "date": "Jul 05, 2021", "rating": 5, "user_name": "Jo-ann Albano", "user_url": "/user/show/19974424-jo-ann-albano", "text": "Super quick read. I think what’s more important is the cd. Unfortunately I did not get to use it since it was missing from the book I borrowed. Good concepts. My biggest take away is mindful eating.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/4372151275", "review_id": "4372151275", "date": "Dec 08, 2021", "rating": 3, "user_name": "Prachi Chaudhary", "user_url": "/user/show/54525243-prachi-chaudhary", "text": "It all starts with will power. If a person is willing to make efforts towards a healthy lifestyle , then this book works wonders. But just by reading this book, one cannot get fit, we will have to get control of our life and be consistent.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2071768652", "review_id": "2071768652", "date": "Jul 25, 2017", "rating": 2, "user_name": "Sally", "user_url": "/user/show/4511435-sally", "text": " It as good as the quit sugar one.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2391066421", "review_id": "2391066421", "date": "May 14, 2018", "rating": 5, "user_name": "Patrice Day", "user_url": "/user/show/81949029-patrice-day", "text": "It sucks", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2506649246", "review_id": "2506649246", "date": "Aug 25, 2018", "rating": 5, "user_name": "Duygu Gözde", "user_url": "/user/show/58656532-duygu-g-zde", "text": "I really think that it will work. The book is a real motivator. I will try the technique out.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2489876291", "review_id": "2489876291", "date": "Sep 01, 2018", "rating": 4, "user_name": "Kirsten Edwards", "user_url": "/user/show/18834394-kirsten-edwards", "text": "It seems to have had an effect by taking on his techniques even in a short period of time. Currently cannot give 5 star until I can be sure it's worked but we will see.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2523717684", "review_id": "2523717684", "date": "Sep 08, 2018", "rating": 5, "user_name": "MISS A E ATHERLEY", "user_url": "/user/show/75375559-miss-a-e-atherley", "text": "Great book", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2748785851", "review_id": "2748785851", "date": "Mar 13, 2019", "rating": 4, "user_name": "Summer", "user_url": "/user/show/94739539-summer", "text": "I will give my review after applying the exercises he mentioned.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2848156093", "review_id": "2848156093", "date": "Jun 06, 2019", "rating": "", "user_name": "Dheeraj Mahajan", "user_url": "/user/show/46906173-dheeraj-mahajan", "text": "Very practical and logical. I practiced the suggestions and found positive results... Great read.....", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2867316935", "review_id": "2867316935", "date": "Jun 22, 2019", "rating": 5, "user_name": "Raghav Dhanuka", "user_url": "/user/show/98854046-raghav-dhanuka", "text": "Super book. This is a Bible that could change your life. Mr. McKenna if you are reading this, want you thank you for changing my life. No one should miss this.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2889756182", "review_id": "2889756182", "date": "Jul 14, 2019", "rating": 5, "user_name": "Jen", "user_url": "/user/show/56487391-jen", "text": "Great book!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3008035002", "review_id": "3008035002", "date": "Dec 04, 2019", "rating": 1, "user_name": "Ms Teresa Redman", "user_url": "/user/show/47884676-ms-teresa-redman", "text": "Disappointed didn’t do anything to help", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3223373640", "review_id": "3223373640", "date": "Mar 08, 2020", "rating": 5, "user_name": "Tracy McMillan", "user_url": "/user/show/103899631-tracy-mcmillan", "text": "Helpful Really helpful with some good insight into why we eat the way we do really does help but need to be in right mindset ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3026489718", "review_id": "3026489718", "date": "May 22, 2020", "rating": 2, "user_name": "Shar", "user_url": "/user/show/9973894-shar", "text": "Nothing new here.", "num_likes": 0, "sort_order": "default", "shelves": ["non-fiction", "health_nutrition", "borrowed_givenaway", "selfhelp"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3460672165", "review_id": "3460672165", "date": "Jul 24, 2020", "rating": 5, "user_name": "Wendy Graham-Hugo", "user_url": "/user/show/99683781-wendy-graham-hugo", "text": "It works. Valuable information.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3573809089", "review_id": "3573809089", "date": "Sep 30, 2020", "rating": 5, "user_name": "The Soul  Trapped in The book", "user_url": "/user/show/122125064-the-soul-trapped-in-the-book", "text": "All I want to say is \"thankyou\" Paul McKenna 💯❤️", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3668671058", "review_id": "3668671058", "date": "Nov 29, 2020", "rating": 5, "user_name": "Rakeshbishnoi", "user_url": "/user/show/115846951-rakeshbishnoi", "text": "One should try this Paul's system for healthy and happy lifeToday is my second day when I am following this system and I happy and feeling positive changes in my body.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3678504540", "review_id": "3678504540", "date": "Dec 05, 2020", "rating": 5, "user_name": "Amira", "user_url": "/user/show/10594276-amira", "text": "Amazing book with very simple and nice writing style.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3850220420", "review_id": "3850220420", "date": "Feb 20, 2021", "rating": 5, "user_name": "Joe Emery", "user_url": "/user/show/33300290-joe-emery", "text": "Fab — as are all of his books.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3861632775", "review_id": "3861632775", "date": "Feb 26, 2021", "rating": 5, "user_name": "Ronald Ford", "user_url": "/user/show/114848208-ronald-ford", "text": "Enjoyed this bookI'm 70 years old and been a yoyo dieter all my life so I'm hoping Paul book can help me and I enjoyed reading this book ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2654138637", "review_id": "2654138637", "date": "Jan 02, 2019", "rating": 2, "user_name": "Kathryn", "user_url": "/user/show/90456996-kathryn", "text": "I read this book a number of years ago and felt it gave me a good mindset for the ‘January diet’, so duh it out again for a second boost.Sadly, I feel it had totally lost its inspirational quality and I actually found it more annoying if I’m honest.I was hoping to look at food in a different way and to get myself back to the figure I had when I first picked up this book but all it done was frustrate me into staring aimlessly into my kitchen cabinets like the answers are all in there!I think if you’re in shape and just need a reminder that Christmas indulgence was temporary, this may help you. But if you’ve had kids, got a mum tum and was hoping the new year and this book would help you focus on dieting, you may need to think again.On the hunt for FRESH inspiration now...", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3828762410", "review_id": "3828762410", "date": "Feb 09, 2021", "rating": 1, "user_name": "Dr asmaa Mohamed Ismael", "user_url": "/user/show/129769248-dr-asmaa-mohamed-ismael", "text": "Not good at all", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1934252149", "review_id": "1934252149", "date": "Mar 06, 2017", "rating": 5, "user_name": "Smart&Pretty", "user_url": "/user/show/35824042-smart-pretty", "text": "Simple but eye opening boom that i can summarize in one sentence: if you are hungry - eat and if you feel full - stop.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2441178227", "review_id": "2441178227", "date": "Jan 08, 2019", "rating": 4, "user_name": "Liliana", "user_url": "/user/show/4199142-liliana", "text": "Reviewed on Lili Lost in a BookI remember a while back I watched a TV show where Paul McKenna showed the viewers how to lose weight without dieting. I remember trying it for a bit and it actually worked! Fast forward to this past summer where I had had enough of my emotional eating and I decided it was time for me to lose weight. One thing about me: I’ve never been comfortable in my own body, and I SO want to be! It’s not just about being thin (title of the book could’ve been better, tbh), I want to feel better too! Anyway, I wanted to try out this system again but for the life of me I could not remember what it was! After many days and A LOT of googling I finally found this, the very thing I was looking for (except I didn’t realize it was a book too. Lol). So I read through the book (it was a very quick read!) and I even found the TV show on YouTube so watched those 4 segments too, and I put the system to use. After 6 months I lost 20 lbs just doing this!But here’s the thing, you have to commit to this fully and put the work in. And it’s hard work! It’s a very simple system, but you really have to stick with it. Paul McKenna actually mentions that at one point you will forget to follow his instructions and will probably break one or multiple of his golden rules. And yes, this happened to me. A lot. And I love that he doesn’t shame you for it. It’s just gonna happen. For me, over the summer at work we went to a preschool (I’m a home care nurse and I take care of a toddler with a tracheostomy and have to got to school with her to watch her airway) where they had set times for breakfast and lunch and all that, and this is NOT a thing you want when following this system. I did fall off of the wagon for the summer because of it, but I came back on when we were done going there. Here’s the takeaway: He said it was gonna happen, and it did. I felt bad, but I also didn’t dwell on it and give up on it. Just get back on and start over!And I don’t know if it’s just me, but I do feel better after starting this! I feel happier and I have more energy! I do wish I’d lost more weight than I actually have, but I don’t fixate on that because I’m just happy I’ve lost weight at all... without dieting, no less! Guess who just had chicken nuggets and caramel popcorn and enjoyed them? This girl! Lol.I also have started working out... but sticking to a set workout routine has proven to be difficult. I am currently trying the HIIT workouts and that seems to be working the best!So, would I recommend this book to someone trying to lose weight? Yes! The golden rules are very simple, but it is hard work. Trust me, though, it is worth it! And the golden rules sound hard to believe, but it really works!1. When you are hungry, EAT2. EAT WHAT YOU WANT, not what you think you should3. Eat CONSCIOUSLY and enjoy every mouthful4. When you think you are full, STOP eatingThat’s it. Really!", "num_likes": 0, "sort_order": "default", "shelves": ["nonfiction", "self-help"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/4257133086", "review_id": "4257133086", "date": "Sep 25, 2021", "rating": 5, "user_name": "Ana Caramete", "user_url": "/user/show/108048478-ana-caramete", "text": "It totally makes senseIt’s more than a book, it’s like a best, very wise friend that is always there for me whenever I need help.I keep it with me all the time and re-read the parts that I need when I need them.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/997426875", "review_id": "997426875", "date": "Jul 15, 2014", "rating": 4, "user_name": "Jenna", "user_url": "/user/show/10102856-jenna", "text": "This book has received some really awful reviews and I have to say that these put me off reading it. When I was in my local library I came across this book and decided to give it a go, it cost nothing to loan the book and all I have to lose is weight. I have to say that to some extent I agree with previous reviewers in that a lot of the information in the book is not new for example \"eat less and exercise more\" however what is new in this book compared to many others is that he gives you powerful visualisation techniques to help beat cravings, to increase self esteem and the real winner for me is the CD that comes with the book. He calls it a mind altering device, lets call it what it is, it's hypnosis and so far for me it's really helped. One of my biggest issues is that I have to clear the plate, no matter how full I feel I have to keep cramming food in until that plate is clear. Not any more :) I can honestly say that this book & CD have helped me to stop eating when I am full. If you have a powerful imagination, these visualisation techniques will work wonders for you :) I would definitely recommend giving it a shot :) But urge you to keep an open mind. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1002060434", "review_id": "1002060434", "date": "Jul 20, 2014", "rating": 4, "user_name": "Adrian Sherlock", "user_url": "/user/show/17741405-adrian-sherlock", "text": "I think Paul McKenna is onto something here, a way of shifting our minds out of the many, many distractions that have grown up around food in our culture and getting back to how we are meant to eat and live. The book seems to work. I find if I study up on this book, keep its ideas fresh in my mind, I do start to trim down. However, I think Paul still hasn't quite nailed it 100 percent. I'd like the CD to have been more a straight forward spoken reminder of the salient points. But it's a step in a direction which is far healthier and more sensible than dieting. His books are also very easy to read and very engaging, so as a piece of reading material, they are pleasant enough. Recommended to those with an open mind!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/818847011", "review_id": "818847011", "date": "Jan 09, 2014", "rating": 3, "user_name": "Laura", "user_url": "/user/show/8858381-laura", "text": "I really really hate diets, luckily this book teaches you about intuitive eating rather than dieting. This involves listening to your body's signals rather than depriving yourself of food and being miserable. Before I read the book (which really isn't that long at all as the principals are few and quite basic) I listened to the mind programming CD a lot which I think has worked as I now seem to always leave food on my plate. I don't have much weight to lose so this hasn't really had a dramatic effect on me but it was refreshing to read about how you could eat whatever you wanted, just don't make yourself uncomfortably full, slow your eating and drink some water!", "num_likes": 0, "sort_order": "default", "shelves": ["instructional", "food-eating"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1539686288", "review_id": "1539686288", "date": "Feb 06, 2016", "rating": 4, "user_name": "Joanne Pinder", "user_url": "/user/show/24966035-joanne-pinder", "text": "This was a re-read for me. I have used his CD for years, since reading this book the first time. I find it is a good tool to use as part of my overall healthy living endeavours. The first time I read the book, my initial reaction was, \"No way will this hypnosis thing work for me.\" Then I thought about how easily I am influenced by others, and I realized that maybe my mind was a little more open to suggestion than I believed. So I gave it a try. Now whenever I find my eating becoming less intentional, I listen to the CD several days in a row, and it seems to reset my intention. The re-read was just to remind me of the whole program. I am convinced it helps. It sure can't hurt.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/125381467", "review_id": "125381467", "date": "Oct 08, 2010", "rating": 2, "user_name": "James", "user_url": "/user/show/2509975-james", "text": "I think many of the basic ideas are good, but McKenna has a poor concept of how people live their lives in the working world and how that might allow for very few to eat when they're hungry. Also, as a Type I diabetic, I attribute much of my incessant hunger not to stress, but to dips in blood-sugar levels that trigger the same physiological response as hunger, although inescapable stress does play a part too.Basically, the book is nicely written, but the plan covers a small segment of society (idlers, CEOs, etc.), not regular people.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/334082560", "review_id": "334082560", "date": "May 21, 2012", "rating": 1, "user_name": "Angraecus Daniels", "user_url": "/user/show/9495351-angraecus-daniels", "text": "A lot of hype and a little common sense. Seriously, the first 20 pages are nothing but a sales pitch. The rest of the book is basic (and superficial) common sense. While the book does contain some good, basic advice, it does NOT contain anything new or revolutionary. In fact, I found the exact same dieting advice in a hypnosis tape from the 1970s. The only difference is that McKenna adds a little NLP to support the advice. I'm giving the book 1 star because most of the other reviews look like marketing hype and were probably paid for by Mckenna's publisher. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/475704733", "review_id": "475704733", "date": "Dec 11, 2012", "rating": 5, "user_name": "Holly", "user_url": "/user/show/1284151-holly", "text": "This book is a short, quick read and full of good advice. I haven't been very thorough with listening to the CD, so I can't say as to whether or not it will be effective. I imagine that it could be effective even without the CD, though. I love the advice on killing a craving. I am doing it with sugar and coffee, and so far, I've gone the entire month of December with neither.I'll update more if I end up having a revelation one way or another with regards to the CD.Worth the buy if you're serious about it.", "num_likes": 0, "sort_order": "default", "shelves": ["type-non-fiction", "type-self-improvement"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/521835874", "review_id": "521835874", "date": "Jan 30, 2013", "rating": 4, "user_name": "Jessica", "user_url": "/user/show/2162568-jessica", "text": "I actually really like this book. I think the system is really cool and when I'm following it, I feel tons better, even within just a couple of days. I'm amazed at how little I eat when following the system and not feel hungry. I'll be the first to admit that I'm not always good at following the system 100% of the time. But my sister lost 25 pounds using this system; I've seen it work for her so I just have to follow it and I'm confident it will work for me as well. I've only given it four stars because I haven't seen much for results but as I do better, I may come back and change that.", "num_likes": 0, "sort_order": "default", "shelves": ["own", "non-fiction", "self-help"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1052720009", "review_id": "1052720009", "date": "Sep 11, 2014", "rating": 2, "user_name": "Xanthi", "user_url": "/user/show/5966790-xanthi", "text": "This is a brief book, which I managed to read in one sitting. The points given are simple in theory, though as with most habit breaking issues, a challenge to implement. That is why I think I shall most likely be rereading this book at some stage. Note - it also comes with a CD to listen to daily.It is hard to rate a book like this immediately after the first reading. I guess one has to first implement the techniques and wait a while to see results, and then rate the book. But for now, it is getting 2 stars, as part of me is wary and skeptical. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1359214336", "review_id": "1359214336", "date": "Aug 09, 2015", "rating": 4, "user_name": "Teresa", "user_url": "/user/show/33915536-teresa", "text": "Quick, easy read. Interested to see if such simple recommendations actually works. I can say that since I have started this program (5 days ago) I sleep better, have more energy, have been able to meet my steps goal on my Fitbit each day, decreased moments when I'm down on myself for not exercising enough or eating correctly because I have no restrictions on my food choices. I find that my choices of foods are quite healthy and I am rarely hungry. The portion sizes are probably 1/3 of what I would normally eat. I won't weigh myself for 9 more days so will see the results then.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/209351906", "review_id": "209351906", "date": "Sep 16, 2011", "rating": 4, "user_name": "Matia", "user_url": "/user/show/6321690-matia", "text": "This book really helped me. It caused me to lose weight, and I am beginning to have a more normal relationship with food, not obsessing with it or measuring it all the time. The book can be a little hype-y, especially at the beginning, and when I first read it I was not sure the methods would work, but I gave them a trial and they did work for me. Read more at my blog: Review of \"I Can Make You Thin\" by Paul McKenna.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/557549150", "review_id": "557549150", "date": "Mar 10, 2013", "rating": 5, "user_name": "Lara", "user_url": "/user/show/7919362-lara", "text": "My kids bought me this for mothers day. I have read the book but find the cd more fascinating. I cannot remember anything in the cd as i count back from 300 and only get to 270. However i have found myself doing certain things without thinking ie putting my fork down between mouthfulls. Listening to the cd at night is so peaceful and relaxing and i am looking forward to seeing what the results are over next few weeks.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1065475407", "review_id": "1065475407", "date": "Sep 27, 2014", "rating": 5, "user_name": "Felicia ", "user_url": "/user/show/29235973-felicia", "text": "This book is the BEST book i'd ever read! It's simple and easy to uds and have most importantly, you do not need to diet to lose weight like any other diet book! I feel so at ease following his 4 golden rules! I definitely recommend it to anybody who wanna lose weight and want a simple life time methods! cheer to paul mckenna!!!! can't wait to see my result six months later! My mood also improved a lot, and definitely feel really less guilt eating my favorite food！", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/388551699", "review_id": "388551699", "date": "Aug 10, 2012", "rating": 3, "user_name": "Richard", "user_url": "/user/show/5914222-richard", "text": "This book is okay in theory, but actually it's better not to just read it, but to read a couple of pages a day, every day until you can get into the habits the book recommends. The one thing it does not address is how to get the willpower to get started. It does seem like a good idea, but so far I am unable to make it work for me. I will, however, keep trying!", "num_likes": 0, "sort_order": "default", "shelves": ["2012"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/655839289", "review_id": "655839289", "date": "Jul 01, 2013", "rating": 4, "user_name": "Rachel", "user_url": "/user/show/10143629-rachel", "text": "Common sense, good at reminding you of the little things like eating slowly, and only when you are hungry. However, I would have liked a stronger emphasis on exercise. I found the \"case studies\" or endorsements a bit irritating - just filler. Overall though, the book is very helpful, and the CD fantastic.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/765824368", "review_id": "765824368", "date": "Nov 15, 2013", "rating": 2, "user_name": "Nate Hewitt", "user_url": "/user/show/24793501-nate-hewitt", "text": "As an individual losing over 130 pounds. I read this book after my initial success in weight loss. I can tell you, it's okay, but can be misleading. Calories do matter, and those not familiar with them, can be at risk in gaining weight, and not getting the desired result. I recommend the book Try This Book For Size. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1067008434", "review_id": "1067008434", "date": "Sep 29, 2014", "rating": 4, "user_name": "Chloe Swann", "user_url": "/user/show/30469187-chloe-swann", "text": "Good at taking people back to the basics of how to eat without stuffing your face, as we all do these days. Not a revolution, just common sense. Still worth reading if you do over-eat, or boredom-eat. Easy to read in one evening, but the CD and exercises could keep you going a long time if you practice them well.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1242908538", "review_id": "1242908538", "date": "Apr 01, 2015", "rating": 5, "user_name": "Dawn", "user_url": "/user/show/1206906-dawn", "text": "I really like the thoughts and ideas in this book. Like any weight loss \"plan\" in my mind it has to make sense to you in order for it to work. I listen to the cd every other night as I am shutting down for the night. Hypnosis in private it okay with me...I'm not about to allow myself be hypnotized in public so I'm good with this process.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1528819415", "review_id": "1528819415", "date": "Jan 28, 2016", "rating": 3, "user_name": "Lora", "user_url": "/user/show/2192692-lora", "text": "Lots of good tips, especially if you're starting out to lose weight and want somewhere to turn to for a good over all view of things. Many points in here I discovered on my own, and I know they work. I also like the shift from 'will power' to 'imagination'. Less guilt, more thought that should lead to action.", "num_likes": 0, "sort_order": "default", "shelves": ["informative-how-to"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2629176963", "review_id": "2629176963", "date": "Dec 17, 2018", "rating": 3, "user_name": "Sam", "user_url": "/user/show/62760666-sam", "text": "Will see if it works.I am editing this around 5 months after the fact. This did not work for me. The suggestions that are made are sensible, but I found them hard to stick to (my lack of willpower), but the audio file that comes with it does not hypnotise me, and I have hypnotherapy sessions which do work for me, this audiofile just does not.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/33605943", "review_id": "33605943", "date": "Sep 23, 2008", "rating": 3, "user_name": "Amber", "user_url": "/user/show/1478410-amber", "text": "FINALLY--someone with a sensible approach to weight loss and healthy eating habits! There aren't many sensible, sustainable diet approaches out there. This is not a super cure but does make you feel good about yourself and how hard it can be to loose weight.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/53245538", "review_id": "53245538", "date": "Apr 19, 2009", "rating": 3, "user_name": "Jessica", "user_url": "/user/show/1947315-jessica", "text": "hmmm trying it out, I have read the book but I will wait to review it until I know if it works or not. Sounds easy but it is actually quite difficult to eat slow when gobbling delicious food is sounds so much more tempting.", "num_likes": 0, "sort_order": "default", "shelves": ["misc"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/55492845", "review_id": "55492845", "date": "May 09, 2009", "rating": 4, "user_name": "Cecilyrebecca", "user_url": "/user/show/1211513-cecilyrebecca", "text": "4 simple steps for losing weight and a meditation/hypnosis CD to reinforce the ideas. I like the 4 simple steps, I'm not sure if I buy into all of the hypnosis crap... but I do have to say that it seems to be working... ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/61482938", "review_id": "61482938", "date": "Jun 29, 2009", "rating": "", "user_name": "Mabeo", "user_url": "/user/show/676903-mabeo", "text": "Ok, so Darby and I really loved this show and thought he had some great things to say. He has some incredible insights on eating and the emotions we tie to it. Finally bought the book so I could remember all the good things we learned when we saw the show. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/188175658", "review_id": "188175658", "date": "Jul 23, 2011", "rating": 4, "user_name": "Marcia", "user_url": "/user/show/5861755-marcia", "text": "This was another book I stumbled upon in my quest to learn hypnosis. It was quick and easy to read. Very interesting and enjoyable. I am not actually trying to loose wait, so I can't say wether it actually works of not.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/244887344", "review_id": "244887344", "date": "Dec 09, 2011", "rating": 5, "user_name": "David John Bryan", "user_url": "/user/show/5931721-david-john-bryan", "text": "Paul McKenna uses a lot of TFT which is an offshoot of acupressure, and also uses a lot of cognitive and NLP which he is known for. His approach is to retrain the hard wiring of the mind and to break and establish new connections. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/258093398", "review_id": "258093398", "date": "Jan 07, 2012", "rating": 5, "user_name": "Avel Rudenko", "user_url": "/user/show/2126287-avel-rudenko", "text": "Based upon subconscious positive affirmations which make way for true change, act is if you're thin, soon all else will follow your beliefs. Make these new habits into a daily routine. You will see positive changes that will change your entire life.", "num_likes": 0, "sort_order": "default", "shelves": ["positive-power-energetic-attraction"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/354809396", "review_id": "354809396", "date": "Jun 24, 2012", "rating": 4, "user_name": "Lisa", "user_url": "/user/show/7468874-lisa", "text": "Common sense guide to being a more thoughtful eater. Cover looks gimmicky like other weight loss type books but there are some simple and helpful mental exercises and I think if someone actually followed this they would fined it helpful.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/412005004", "review_id": "412005004", "date": "Sep 10, 2012", "rating": 5, "user_name": "Louisezlam", "user_url": "/user/show/2746071-louisezlam", "text": "This book helps me think about food in a different way and changes my relationship with food. Some good points were brought up in this book and I am not trying to follow the program it proposes. We'll see if it works, but either way, an enlightening perspective and twist on dieting programs. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/517047151", "review_id": "517047151", "date": "Jan 25, 2013", "rating": 2, "user_name": "Ashraf Bashir", "user_url": "/user/show/2935885-ashraf-bashir", "text": "Nothing interesting, he keeps repeating the same four rules he mentioned again and again ! Even the tapping technique has no scientific meaning ! I didn't like it, but the 4 rules seems to work for me, despite this it's totally lengthened despite its small size.", "num_likes": 0, "sort_order": "default", "shelves": ["health"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/633597117", "review_id": "633597117", "date": "Jun 05, 2013", "rating": 3, "user_name": "Tara", "user_url": "/user/show/14169984-tara", "text": "Eat what you like, but only a few bites. That is what I got out of the book. Oh, and do not feel bad about throwing out what you did not eat. That half of a chicken breast was wasted the minute the poor thing was slaughtered, so no guilt. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1653012514", "review_id": "1653012514", "date": "May 30, 2016", "rating": 5, "user_name": "Maria McMahon", "user_url": "/user/show/53000992-maria-mcmahon", "text": "Paul McKenna's books are all good. I saw him live in London way back when he was still doing stage hypnosis and I was glad when he moved into writing good books about helping people to change their lives with hypnosis. ", "num_likes": 0, "sort_order": "default", "shelves": ["hypnosis-nlp"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1696345368", "review_id": "1696345368", "date": "Jul 12, 2016", "rating": 5, "user_name": "K", "user_url": "/user/show/51527474-k", "text": "Simply fab. Best little book out there for weight loss, but you need to study it though.You could read the entire thing in one day as its a little beauty, but one needs to study it before they see the effects. This is my third time reading this book as I suffer from binge eating ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1717438784", "review_id": "1717438784", "date": "Aug 03, 2016", "rating": 4, "user_name": "Knittywittywoo", "user_url": "/user/show/18909033-knittywittywoo", "text": "I have lost weight so I now need the help with maintaining. I am more interested in intuitive eating and wanting to reduce my portion sizes. Alot of this book makes sense and I will follow the 4 rules and probably refer back to it when needed.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2868495599", "review_id": "2868495599", "date": "Jun 25, 2019", "rating": 5, "user_name": "Bob Fereday", "user_url": "/user/show/73173221-bob-fereday", "text": "Wow just wowThis is the only book you need to help you lose weightIt does what it claims and Paul tells it like it is, and what’s more guides and encourages you to shed unwanted pounds with four simple rules", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/25107668", "review_id": "25107668", "date": "Jun 22, 2008", "rating": 3, "user_name": "Hind", "user_url": "/user/show/1259148-hind", "text": "Has a few good pointers on how to change your eating habbits and the Audio Cd is very relaxing :) but otherwise it didn't really do much for me.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/27306989", "review_id": "27306989", "date": "Jul 15, 2008", "rating": 5, "user_name": "Catherine Gillies", "user_url": "/user/show/1156510-catherine-gillies", "text": "I read this book after going to an independant hypnotist to stop smoking.....and I was eating like a pig - this book worked for me and helped me realise when enough was enough.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/42022693", "review_id": "42022693", "date": "Jan 05, 2009", "rating": 5, "user_name": "Pam", "user_url": "/user/show/1790254-pam", "text": "What a difference is such a short time. I was aware of his work from a tv show last year and am very excited about the changes in the family directly from listening to the tape", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/42470233", "review_id": "42470233", "date": "Jan 09, 2009", "rating": 5, "user_name": "Allison", "user_url": "/user/show/276475-allison", "text": "This book changed the way I feel about food and it's place in my life - for the better! Definitely a book I'd go back to again and again for inspiration/guidance. P.S., it works!", "num_likes": 0, "sort_order": "default", "shelves": ["read-in-09"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/42997437", "review_id": "42997437", "date": "Jan 14, 2009", "rating": 4, "user_name": "Brian Bradbury", "user_url": "/user/show/1713891-brian-bradbury", "text": "This is really an easy read. Very simplistic and very easy to \"follow the advice\". Everyone will love the advice. I read it in about 2 hours", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/44509068", "review_id": "44509068", "date": "Jan 27, 2009", "rating": 2, "user_name": "cheri", "user_url": "/user/show/1342960-cheri", "text": "I'll let you know what I think about self-hypnosis in about a month. ", "num_likes": 0, "sort_order": "default", "shelves": ["encouragement"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/47175727", "review_id": "47175727", "date": "Feb 22, 2009", "rating": 5, "user_name": "Lori Mason", "user_url": "/user/show/906645-lori-mason", "text": "Radical, but simple rules to lose weight and be healthier. I am really going to try this.", "num_likes": 0, "sort_order": "default", "shelves": ["non-fiction", "z2009"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/50437697", "review_id": "50437697", "date": "Mar 25, 2009", "rating": 3, "user_name": "Rebecca", "user_url": "/user/show/1777624-rebecca", "text": "The most commonsense approach to conquering food issues! I am working on it through the use of the CD with the book. I purchased the book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/51532542", "review_id": "51532542", "date": "Apr 04, 2009", "rating": "", "user_name": "Amber Ferguson", "user_url": "/user/show/2147312-amber-ferguson", "text": "This is a very good book. It helps you gain a stronger, better relationship with food. And it helps you to realize that food is your friend, not a foe.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/53144599", "review_id": "53144599", "date": "Apr 18, 2009", "rating": 5, "user_name": "Matt McClard", "user_url": "/user/show/999324-matt-mcclard", "text": "I liked this book but it is a little early to see if helped me loose the weight like it said I would. The book makes a lot of sense especially if you have ever tried more then one diet", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/55539063", "review_id": "55539063", "date": "May 09, 2009", "rating": 3, "user_name": "Nancy", "user_url": "/user/show/611530-nancy", "text": "This is a newer version of the mindfulness approach to listening to your body and eating.", "num_likes": 0, "sort_order": "default", "shelves": ["non-fiction", "mindfulness"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/58970398", "review_id": "58970398", "date": "Jun 09, 2009", "rating": 4, "user_name": "Toni", "user_url": "/user/show/825189-toni", "text": "Simple to read and understand ", "num_likes": 0, "sort_order": "default", "shelves": ["self-help", "health", "non-fiction"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/69446047", "review_id": "69446047", "date": "Aug 30, 2009", "rating": 5, "user_name": "Lisaannhomic", "user_url": "/user/show/2185853-lisaannhomic", "text": "Fast read. it comes with a CD that I haven't listened to yet. Makes good sense. Easy to put into action.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/69725970", "review_id": "69725970", "date": "Sep 01, 2009", "rating": 4, "user_name": "Carolina", "user_url": "/user/show/2692545-carolina", "text": "Probably the only book about keeping one's weight I have ever read and ever will. I was surprised to find great advise and doable things. I must credit this book with my husband's weight loss", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/87914176", "review_id": "87914176", "date": "Feb 02, 2010", "rating": 4, "user_name": "Cal", "user_url": "/user/show/586228-cal", "text": "Very interesting read. Only time will tell if it works or not!", "num_likes": 0, "sort_order": "default", "shelves": ["nonfiction", "2010"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/89520664", "review_id": "89520664", "date": "Feb 13, 2010", "rating": 5, "user_name": "Kirk", "user_url": "/user/show/2415179-kirk", "text": "WONDERFUL!! I am 3 days in and already just feel better! WORTH THE READ!!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/99366021", "review_id": "99366021", "date": "Apr 20, 2010", "rating": 3, "user_name": "Lisa Greer", "user_url": "/user/show/583112-lisa-greer", "text": "I liked it, but other approaches resonate more wth me.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/116535386", "review_id": "116535386", "date": "Aug 12, 2010", "rating": 4, "user_name": "Claire", "user_url": "/user/show/1093884-claire", "text": "Despite it taking me a six months to read, it's a quick read and has some useful tips. I would say this is the \"Women, Food and God\" for practical people.Just don't judge the book by my weight...", "num_likes": 0, "sort_order": "default", "shelves": ["non-fiction"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/119395476", "review_id": "119395476", "date": "Aug 31, 2010", "rating": 5, "user_name": "ضحى الحداد", "user_url": "/user/show/4075295", "text": "This book is the best book ever it really saved my life after years of dealing with weight ..I just love him", "num_likes": 0, "sort_order": "default", "shelves": ["e-book", "books-i-enjoyed-reading"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/125239638", "review_id": "125239638", "date": "Oct 07, 2010", "rating": 2, "user_name": "Andrea", "user_url": "/user/show/4357256-andrea", "text": "Lol ... I got caught out with this one too. We'll believe anything!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/133271480", "review_id": "133271480", "date": "Dec 02, 2010", "rating": 5, "user_name": "Donna", "user_url": "/user/show/774454-donna", "text": "Very cool. I haven't used the hypnotism cd yet because I have no quiet time alone except in the car!! But if it works like the author says, it'll be a dream.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/141693971", "review_id": "141693971", "date": "Jan 18, 2011", "rating": "", "user_name": "Khaled Ghorab", "user_url": "/user/show/3077260-khaled-ghorab", "text": "Another one of McKenna's great books. Focuses primarily on the psychology of eating. The hypnosis CD is grand!", "num_likes": 0, "sort_order": "default", "shelves": ["health"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/179194508", "review_id": "179194508", "date": "Jun 23, 2011", "rating": 2, "user_name": "Mckinley", "user_url": "/user/show/4176715-mckinley", "text": "Even has an infomercial!", "num_likes": 0, "sort_order": "default", "shelves": ["non-fiction", "health", "diet"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/180344516", "review_id": "180344516", "date": "Jun 28, 2011", "rating": 4, "user_name": "Danielle Pederson", "user_url": "/user/show/5696083-danielle-pederson", "text": "He makes a LOT of sense, so far the system has made me feel so much better. I haven't listened to him in a while but I keep meaning to get back to it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/200970443", "review_id": "200970443", "date": "Aug 21, 2011", "rating": 5, "user_name": "Miriam", "user_url": "/user/show/6053471-miriam", "text": "great!practical guide, easy to follow. allows you to change your life in no time, get in touch with what is behind emotional eating and overeating. should be read in schools!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/245755096", "review_id": "245755096", "date": "Dec 11, 2011", "rating": 3, "user_name": "Daniela", "user_url": "/user/show/3616989-daniela", "text": "Paul McKenna claims that his book and his CD can make you thin without really changing what you eat, but just how you eat it and changing your all over life style. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/295496401", "review_id": "295496401", "date": "Mar 16, 2012", "rating": 4, "user_name": "Melanie", "user_url": "/user/show/7725207-melanie", "text": "  It works if you follow it to the latter!! Good, common sense kind of read. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/321013950", "review_id": "321013950", "date": "Apr 29, 2012", "rating": 5, "user_name": "Amanda", "user_url": "/user/show/5658774-amanda", "text": "Prove everyone wrong, Paul. We shall she. He says it himself in the book multiple times: You don't have to believe it. You just have to do it/listen to it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/332610574", "review_id": "332610574", "date": "May 19, 2012", "rating": 5, "user_name": "Amanda", "user_url": "/user/show/9332236-amanda", "text": "I have used this and the meditation CD and what it does for you is brilliant! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/350860288", "review_id": "350860288", "date": "Jun 18, 2012", "rating": 4, "user_name": "Elaine", "user_url": "/user/show/6754441-elaine", "text": "It's not the writing that interests me about this book--it's the philosophy about not dieting and using self-hypnosis to lose weight. I've lost 18 lbs so far using the included CD. Quick read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/549260547", "review_id": "549260547", "date": "Mar 01, 2013", "rating": 5, "user_name": "Ellen", "user_url": "/user/show/11170576-ellen", "text": "So so helpful and good. When I decide to apply it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/577893419", "review_id": "577893419", "date": "Apr 01, 2013", "rating": 1, "user_name": "Tommie Elliott", "user_url": "/user/show/18844870-tommie-elliott", "text": "I've read this and I'm not thin.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/835019801", "review_id": "835019801", "date": "Jan 26, 2014", "rating": 5, "user_name": "Aliya", "user_url": "/user/show/5554029-aliya", "text": "wow! what a book. I read it in less than two hours, and it makes weight loss so easy to achieve (at least in theory). I don't know if it would work for real, but I do like the book enormously. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/954266509", "review_id": "954266509", "date": "Jun 01, 2014", "rating": 4, "user_name": "Pt Ghonojka", "user_url": "/user/show/19926573-pt-ghonojka", "text": "Very easy .. just simple rules you need to remember and then applied .. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/965809667", "review_id": "965809667", "date": "Jun 12, 2014", "rating": 4, "user_name": "Greg", "user_url": "/user/show/3395589-greg", "text": "Many (but not all) of the principles in this are pretty solid.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1084520777", "review_id": "1084520777", "date": "Oct 19, 2014", "rating": 4, "user_name": "Caitlin", "user_url": "/user/show/1741470-caitlin", "text": " Quick read, diet that is not a diet. Eat when you are hungry, eat what you want, and stop when you are full.", "num_likes": 0, "sort_order": "default", "shelves": ["read-2014"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1128908921", "review_id": "1128908921", "date": "Dec 10, 2014", "rating": 5, "user_name": "Asadali", "user_url": "/user/show/37824710-asadali", "text": "ghfgthg", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1144669663", "review_id": "1144669663", "date": "Dec 28, 2014", "rating": 1, "user_name": "Xondra Day", "user_url": "/user/show/5100591-xondra-day", "text": "Nothing new that a person shouldn't know about weight-loss already.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1189725088", "review_id": "1189725088", "date": "Feb 03, 2015", "rating": 5, "user_name": "Enas", "user_url": "/user/show/36765347-enas", "text": "Outstanding and fabulous bookStrongly recommend ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1305243757", "review_id": "1305243757", "date": "Jun 11, 2015", "rating": 2, "user_name": "Xenia", "user_url": "/user/show/43301592-xenia", "text": "I found the messages in the book compelling, understandable and the made lots of sense. I didn't like at all how it was written. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1338334011", "review_id": "1338334011", "date": "Jul 18, 2015", "rating": 3, "user_name": "Ciara Garrett", "user_url": "/user/show/7909040-ciara-garrett", "text": "The ideas in this book are very simple but prove to work! Short, to the point, cd included is effective.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1362682611", "review_id": "1362682611", "date": "Aug 13, 2015", "rating": 3, "user_name": "Michelle", "user_url": "/user/show/7418571-michelle", "text": "Good Book with some helpful tips - unfortunately I didnt lose any weight on this but I think that was because I never managed to get in a trance like state when listening to the recordings", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1548699252", "review_id": "1548699252", "date": "Feb 14, 2016", "rating": 4, "user_name": "Marie", "user_url": "/user/show/20909776-marie", "text": "Simple ideas about slowing down and eating consciously. The CD is great.", "num_likes": 0, "sort_order": "default", "shelves": ["books-read-2016", "audio-books"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1646853591", "review_id": "1646853591", "date": "May 23, 2016", "rating": 3, "user_name": "Caroline", "user_url": "/user/show/22802777-caroline", "text": "u", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1734468026", "review_id": "1734468026", "date": "Aug 21, 2016", "rating": 3, "user_name": "Sumeer G", "user_url": "/user/show/18964048-sumeer-g", "text": "Generally good advice for healthy eating habits.Avoid emotional eating, eat consciously when hungry, and don't join the clean plate club. Giving up bad habits takes imagination, not willpower.", "num_likes": 0, "sort_order": "default", "shelves": ["health-training-nutrition"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1817615860", "review_id": "1817615860", "date": "Nov 20, 2016", "rating": 4, "user_name": "Christine Nabil", "user_url": "/user/show/12760177-christine-nabil", "text": "just what i wanted.. a life style not a diet.", "num_likes": 0, "sort_order": "default", "shelves": ["self-help", "my-pdf-books"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1861140335", "review_id": "1861140335", "date": "Jan 02, 2017", "rating": 4, "user_name": "Tahani Shemmmari", "user_url": "/user/show/19181287-tahani-shemmmari", "text": "I will try this steps in this book and will give 5 stars ✨ if it works ✌️", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/3375661309", "review_id": "3375661309", "date": "Jun 06, 2020", "rating": 5, "user_name": "nisrin elsaadouni", "user_url": "/user/show/115885112-nisrin-elsaadouni", "text": "Its really works I like the book its so helpful And learn you how to reach you goalRecommend to be with everyone ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/30298043", "review_id": "30298043", "date": "Aug 16, 2008", "rating": 4, "user_name": "Erotic Horizon", "user_url": "/user/show/1431636-erotic-horizon", "text": "I Can Make You Thin (New Edition - Book & Cd) (Paperback) by Paul McKenna (2007)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/44873156", "review_id": "44873156", "date": "Jan 30, 2009", "rating": 3, "user_name": "Joyce", "user_url": "/user/show/911026-joyce", "text": "I'm not thin yet but I did read the book. Maybe if I applied the principles, it would work.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/91523170", "review_id": "91523170", "date": "Feb 26, 2010", "rating": 4, "user_name": "Mrym", "user_url": "/user/show/3347595-mrym", "text": "very nice simple advice to follow, I recommend it ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/193815901", "review_id": "193815901", "date": "Aug 03, 2011", "rating": 3, "user_name": "Chris King", "user_url": "/user/show/5945527-chris-king", "text": "great book, but i can't seem to self-hypnotize.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/346100289", "review_id": "346100289", "date": "Jun 10, 2012", "rating": "", "user_name": "Gina", "user_url": "/user/show/3700026-gina", "text": "p. 57,74, 80, 104, 114, 132 + CD", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1327814018", "review_id": "1327814018", "date": "Jul 06, 2015", "rating": 5, "user_name": "Ian", "user_url": "/user/show/12402339-ian", "text": "Time to wander in Putney for a bit", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1335130212", "review_id": "1335130212", "date": "Jul 14, 2015", "rating": 2, "user_name": "Graham Old", "user_url": "/user/show/1754674-graham-old", "text": "Complete rip-off of 'Diets Don't Work'!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/1978721238", "review_id": "1978721238", "date": "Apr 22, 2017", "rating": 4, "user_name": "Bassant", "user_url": "/user/show/39997243-bassant", "text": "chapter 5 and 6 is the most powerful chapter in the book, this book change my mind about food and exercise", "num_likes": 0, "sort_order": "default", "shelves": ["favorites", "healthy-food"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2011955577", "review_id": "2011955577", "date": "May 27, 2017", "rating": "", "user_name": "LOL_BOOKS", "user_url": "/user/show/39419170-lol-books", "text": "LOL SPEAKING OF PSEUDOSCIENCE, THE PAUL MCKENNA BOOK IS GRATE FOR THAT. MY MOM GOT IT AND I HAD TO MAKE HER THROW IT OUT CAUSE IT'S ALL ABOUT VISUALIZING YOUR FAVORITE FOODS MAKING YOU VOMIT AND BEING EMBARRASSED ABOUT BEING PUBLICLY COVERED IN VOMIT AND SHIT. IT'S SO GROSS AND LOL ANA, BUT I GUESS THAT WOULD WORK FOR YOU.", "num_likes": 0, "sort_order": "default", "shelves": ["nonfiction", "psychology", "food", "self-help", "yikes"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2057411899", "review_id": "2057411899", "date": "Jul 12, 2017", "rating": 4, "user_name": "Chetan Kadam", "user_url": "/user/show/60879349-chetan-kadam", "text": "very common but very good things told in bookit really helped me to change the relationship with food and to loose weight.I lost 19 kg in 11 months.It also helped me to understand about eating habits and common sense for eating.I 'm no more in control of the food and its cravings.Big Thanks,Chetan Kadam", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2292579499", "review_id": "2292579499", "date": "Feb 11, 2018", "rating": 4, "user_name": "Danielle Katz", "user_url": "/user/show/23908240-danielle-katz", "text": "The Psychology behind successful dieting. A very simple, do-able system. Bottom line is it all comes down to being conscious/ be present. Good Advice for all aspects of life. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2352942441", "review_id": "2352942441", "date": "Apr 10, 2018", "rating": "", "user_name": "محمود محمد شاكر", "user_url": "/user/show/49746891", "text": "I will return here(ISA) to evaluate and review this book after four months when i lose 25 Kgs from my recent weight .Be tunned !! ", "num_likes": 0, "sort_order": "default", "shelves": ["pdf"]}, {"book_id_title": "1010400.I_Can_Make_You_Thin", "book_id": "1010400", "book_title": "I Can Make You Thin", "review_url": "https://www.goodreads.com/review/show/2669132128", "review_id": "2669132128", "date": "Jan 11, 2019", "rating": "", "user_name": "Marko", "user_url": "/user/show/88049620-marko", "text": "I have two different editions.", "num_likes": 0, "sort_order": "default", "shelves": ["21l-cookbooks"]}]