[{"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1053826211", "review_id": "1053826211", "date": "Jul 30, 2019", "rating": 3, "user_name": "Emma", "user_url": "/user/show/26734926-emma", "text": "A witty autobiography from Peter Kay. For the most part the focus is on his life before fame and we mostly hear of his long list of part time jobs. I remember watching Pheonix Nights in the early 00s and found Kay and co very amusing and his brand of humour does translate relatively well in this novel. ", "num_likes": 27, "sort_order": "default", "shelves": ["biography", "non-fiction"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2797764660", "review_id": "2797764660", "date": "Apr 30, 2019", "rating": 4, "user_name": "Baba", "user_url": "/user/show/60866073-baba", "text": "Peter Kay's best selling autobiography captures his early years from school through to college and part-time working. A North Western lads view of going to a Catholic School run by Nuns, part-time work in a cash-and-carry, a petrol station, the Manchester Arena and more has probably never been funnier. What makes this book special is how it shows how hard Peter worked in his life to earn money to pay for his college... and driving lessons. How he was always on the look out for the next opportunity to earn legally. The book is so obviously Kay's creation as it has his 'voice' written all over it; his transparency, earnestly and comedy are all astounding, and to top it all off he appears to be just as good a story teller on page as he is on stage! 8.5 out of 12.", "num_likes": 5, "sort_order": "default", "shelves": ["biog-or-memoir"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/208394789", "review_id": "208394789", "date": "Sep 14, 2011", "rating": 3, "user_name": "Steve ", "user_url": "/user/show/4121048-steve", "text": "I bought and read this book in about 2008, even though I don't generally go for memoirs or biographies, as such (though I am aware that I've read a couple more; one was a biography on Kevin Costner)... I did find it a page-turner, and it's certainly different from many books out there ;)For those who don't know who the Hell Peter Kay is; he's a Northern English (Bolton, Lancashire) comedian ;)It basically covers how he started off in work, gained material from funny (kind of) things that happenned to him, then went into stand up comedy. Followed by a couple of television shows and commercials... Is it funny? Some parts may make you smile (depending on your sense of humour, he's not funny to everyone, and not all the time), but I didn't find it a 'laugh out loud' read... Example: In one of his places of work, he rounds a corner with a work friend and finds armed masked robbers and staff on the ground. One guy, in a Mickey Mouse or Colonel Ghadafi mask points a sawn-off shotgun at him and tells him \"Get Down!\" Peter Kay replies \"What, you mean dance?\" *Laughing*Okay, maybe some parts are actually 'laugh out loud' funny ;)The thing that struck me as a little odd, or maybe just not healthy, I'm not sure; Was how much he relied on his mother (I'm not saying that's a bad thing, or maybe I am *smiling*)... I mean like cooking his meals when he's an adult (daily, not occassionally), though he was obviously very close to his mother (and I certainly don't object to that)... At one point he leaves home to go to college, he packs his clothes and duvet and goes to catch a train. Okay, so far this isn't weird ;) But then, after one day (or something close) he decides it's not for him and he phones his mother... He says that college is okay, then asks what she's having for dinner... Then, as he's actually in a phone booth at the end of the street, he rushes down and knocks on his mother's door (then goes in for his dinner)... Maybe it's just me... I do understand showing your mother that you love her. I understand spending time with her... But I was cooking my own meals when I was 14 years old, doing my own washing and shopping (and my mother's shopping)... Okay, that may not be 'normal' either LMFAO... But I also left home at 18, so maybe it's just me... It's certainly my opinion ;)I enjoyed reading it the first time, but I wouldn't want to read it again. ", "num_likes": 4, "sort_order": "default", "shelves": ["non-fiction", "odd-humour-tale"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2809255961", "review_id": "2809255961", "date": "May 05, 2019", "rating": 5, "user_name": "Kate Lowe", "user_url": "/user/show/62459810-kate-lowe", "text": "Hilarious from page one, had to keep stopping as I couldn't see to read through the tears of laughter. Loved it!", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4477238403", "review_id": "4477238403", "date": "Feb 02, 2022", "rating": 3, "user_name": "Dan", "user_url": "/user/show/117921809-dan", "text": "Tonally, it’s exactly what you’d expect from the family-friendly comedian, even though some of it really hasn’t aged well in terms of political correctness.It was a breezy read - funny and generally very light.Only a small slither at the end was about his standup - the vast majority was his late teen years. It’s a shame because I would have liked much more about his comedy career.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/37178928", "review_id": "37178928", "date": "Nov 08, 2008", "rating": 4, "user_name": "Claire", "user_url": "/user/show/1692652-claire", "text": "One of the best autobiograhys I have read. You can just imagine Peter Kay writing it and is just what you expect from him. I did, however, expect the book to be more about his comedy career & more recent happenings.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2119985645", "review_id": "2119985645", "date": "Sep 10, 2017", "rating": 5, "user_name": "Sarah", "user_url": "/user/show/32394329-sarah", "text": "Brilliant - a laugh a minute, sentimental but not schmaltzy memoir of the comedian Peter Kay.", "num_likes": 2, "sort_order": "default", "shelves": ["book-group-reads", "best-of-the-best"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2932926107", "review_id": "2932926107", "date": "Aug 11, 2019", "rating": 5, "user_name": "Wilde Sky", "user_url": "/user/show/5455280-wilde-sky", "text": "A comedian writes about his early life.I found this book laugh out loud funny in places.Reading time around five hours.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4404144613", "review_id": "4404144613", "date": "Dec 30, 2021", "rating": 5, "user_name": "Jonathan", "user_url": "/user/show/6922294-jonathan", "text": "Thoroughly enjoyed this. I'm getting more and more into autobiographies as time goes on, and it's reassuring to know that a lot of famous people were precisely nowhere when all of a sudden, things started happening for them. A booster dose of hope at the end of the year! Maybe one day people will be giving my own autobiography two stars and wondering 'why the hell he felt the need to tell us this crap, who is he anyway?' A boy can dream. Needless to say, Peter did a much better job than I would.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2598052021", "review_id": "2598052021", "date": "Nov 25, 2018", "rating": 4, "user_name": "Tracey", "user_url": "/user/show/1209392-tracey", "text": "It wasn't as good as I expected, but I did enjoy it. It picked up and got more interesting towards the end", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4491787298", "review_id": "4491787298", "date": "Jan 23, 2022", "rating": 4, "user_name": "Sophie Bowns", "user_url": "/user/show/43058448-sophie-bowns", "text": "It was an entertaining and enjoyable read!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2907438779", "review_id": "2907438779", "date": "Dec 11, 2020", "rating": 5, "user_name": "Richard", "user_url": "/user/show/18385731-richard", "text": "Absolutely funny book but I expected nothing less from Peter Kay 😁", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3248251167", "review_id": "3248251167", "date": "Mar 26, 2020", "rating": 5, "user_name": "Alison", "user_url": "/user/show/111966649-alison", "text": "And laugh you do ! Fab read x", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/978039025", "review_id": "978039025", "date": "Jun 26, 2014", "rating": 2, "user_name": "Michelle Lewis", "user_url": "/user/show/32309596-michelle-lewis", "text": "The rating of this book is reflective of the story rather than the writing skill. There are no errors or structural problems and it is easy to read and vaguely interesting. I was thoroughly disappointed, however, with the plot. As a memoir the plot suffers from being a report of the truth which in the case of Mr Kay seems to be surprisingly dull.I read a lot of memoirs of comedians, Russel Brand, Jack Dee, Rob Brydon, Michael McIntyre and Stephen Fry to name a few. All of their memoirs showed a frank, warts and all glimpse into their lives and were a lot more humorous as a result as well. With The sound of laughter, I felt I could have written it myself with enough research and feel I know Peter Kay less than I did from my preconceptions before reading it. All the 'funny anecdotes' were things I had seen dozens of times before. He even described how he does a wedding sketch where he's a kid at a wedding sliding on his knees. Who hasn't seen that? He describes much of the things we have all seen before and made me feel I was now more than familiar with his entire repertoire. This isn't entirely Peter's fault. It is just that he seems to have been extremely lucky in his road to success and we are all aware of all of it. There isn't really a back story. I have found that, as a result of reading this book, my enjoyment in watching Peter Kay's comedy has suffered. All in all, I wish that I had never read it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2830303230", "review_id": "2830303230", "date": "May 27, 2019", "rating": 2, "user_name": "Elizabeth", "user_url": "/user/show/22202971-elizabeth", "text": "Not my cup of tea. I have enjoyed Peter Kay as a comedian but as a writer, no. I find that having to read “joke” every three sentences is a real put off particularly when the joke is not funny. This book being an autobiography I wanted to know something of the man and how he got to be a comedian. It was quite clear early on that Peter really didn’t have the material for an autobiography. Shame.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/468096881", "review_id": "468096881", "date": "Dec 02, 2012", "rating": 4, "user_name": "Gary", "user_url": "/user/show/15055195-gary", "text": "A very funny read but in this case it is no substitute for the live performances of Peter Kay. An entertaining quick read.Another one of those books that's ideal to dip in and out of when you want cheering up. A very light read that is not great but there are plenty of laughs to make it well worth reading. Pretty much what you expect with Peter Kay.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2778125161", "review_id": "2778125161", "date": "Apr 09, 2019", "rating": 5, "user_name": "Honor Grainger", "user_url": "/user/show/82512108-honor-grainger", "text": "I am not a huge fan of autobiographies but this is the only book my husband has ever mentioned to me (that may be because it is the only one he has ever read) so I was guilted into reading it. However, it is hysterically funny and wildly relatable, Peter Kay is the everyman. It was also by chance that I read it before sitting my driving test... so maybe it is a sign.", "num_likes": 0, "sort_order": "default", "shelves": ["read-2019"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2505955672", "review_id": "2505955672", "date": "Aug 24, 2018", "rating": 5, "user_name": "Kbrown", "user_url": "/user/show/18322755-kbrown", "text": "He’s just funny xx", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4252711480", "review_id": "4252711480", "date": "Sep 28, 2021", "rating": 5, "user_name": "Brian", "user_url": "/user/show/48891418-brian", "text": "This autobiography by Peter Kay was first published back in 2006. To be honest I didn’t read it back then, even though I love Peter Kay. Autobiographies in my opinion should be written towards the end of the subjects long and illustrious career, or at least in the autumn of it, once they have a story to tell. However it then came out on Audible read by Peter Kay. It was a no brainer, I had to listen to it. I may be 15 years late in discovering this book, but the wait was worth it and although I thoroughly enjoyed the content Peter Kay’s reading off it enhanced it 200%!What I loved about this was the way he reads it, it’s not just a straight forward narration, you get the feeling he’s sat there, book in hand reading just to you, constantly breaking off with comments, comic asides and the occasional brew. He mentions in his book that audio books can sometimes be boring and put you to sleep half way through the first chapter, that’s a criticism that can’t be applied in this case! This reading style fits perfectly with Peter Kay’s persona and it makes for a very entertaining, enjoyable and funny listen. As for my criticism of autobiographies published too early in someone’s career, well The Sound of Laughter only covers Peter Kay’s life up to him breaking through as a stand up comedian. There’s nothing about his successes such as Pheonix Night’s, Car Share or his uproariously funny stand up tours. So there is room for another volume - maybe at the end of his long and illustrious career! What you do get here amongst the jokes and laughter is a story of someone who worked hard to get where he is. Having had several part time jobs along the way. I think for me what sums him up is the fact it took him 5 tests and 6 years to pass his driving test, he never gave up.I would thoroughly recommend the Audible version of The Sound of Laughter if like me you didn’t read the book or if even if you did, either way it’ll brighten up your day and put a smile on your face. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4266951321", "review_id": "4266951321", "date": "Oct 25, 2021", "rating": 4, "user_name": "Louise Selby", "user_url": "/user/show/26002924-louise-selby", "text": "Did a complete 360 with this book. I didn’t get off to a good start with it. The story spans his life from high school to mid twenties when he won his first stand up comedy competition. This covers his school life, life following school, uni, various college courses and dozens of jobs. However good luck working out which order all of that goes in. This was my first and immediate frustration with the book. Nothing is in chronological order and he leaps about going forwards and backwards. But only that but he will start a story, go off on a tangent, come back to the original story, go off on a tangent again… The first chapter I hadn’t a clue in the end which story he was trying to tell. A few chapters in and I was really fed up with it. I listened to this on audible so it was Peter reading it, and he has put in some extra bits where he will just stop the book and talk for half an hour. Except he talks about nothing (sorry). With his chaotic form of recounting events and his rambling in between I very nearly gave up on the book. But I decided after a weeks rest to give it another go. Glad I did, as this was the part where he tells his little anecdotes about the various jobs he’s had. I loved listening to his stories. I loved hearing how close he was to his family, how he loved being at home, his favourite tea of chicken Kiev, chips, beans and a fried egg (must try that). It all made it very Peter Kay. Suddenly I was really enjoying the book, and it picked up a lot. The lack of chronology still bothered me but when i heard how he started his stand up acts it made sense, it’s his style. No order just as it comes, and he’s been known to change his whole act on his way to the stage and improvise. So it was just his style. Really enjoyed it in the end. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4296427797", "review_id": "4296427797", "date": "Nov 04, 2021", "rating": 4, "user_name": "Andy Gascoigne", "user_url": "/user/show/25747440-andy-gascoigne", "text": "I listened to the audiobook as I figured having the man himself read his own book would be on the money. Hmmm. It was ok, but the actual reading was quite strained and sometimes painful. Much better when he strays off-script and wanders off on a distraction, which let’s face it is the style of him in action. Let’s be clear, I think Peter Kay is one of the best comedians I’ve ever seen and vividly remember around 2002 unable to breathe for laughing at one of his gigs. Though some of his material/delivery has now dated a little, there’s still a lot of joy in this. However there is one (seemingly very funny) chapter where he is describing his training for his Stewards job at the Manchester Arena which suddenly becomes, with hindsight, quite insensitive (searching bags for bombs, referring to “blowing the legs off” etc). It was written (and narrated) prior to the Ariana Grande incident, but the smile fades very quickly at this point. That said, I enjoyed the book and it does offer an insight into the man himself as well as some of his funniest moments. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4254387843", "review_id": "4254387843", "date": "Oct 06, 2021", "rating": 3, "user_name": "Chris Best", "user_url": "/user/show/38847456-chris-best", "text": "There is no doubt that this is entertaining, but I'm not sure how much you learn about Kay himself. The focus is on delivering comedy around the stories in his life, rather than the reality of the stories themselves. There are two times I think we come close to seeing anything different. The first - unfortunately - is the parade of Partridge style \"needless to say, I had the last laugh\" grudges throughout the book where Kay continually names various people who rubbed him up the wrong way in his formative years. The second is more touching where he reflects on the role religion has played in his life, and was a unexpected moment of unapologetic sincerity.That said, the funniest line in the book is where he says he \"doesn't like to rip people off\" - presumably he got over that when he released the same stand up tour on repackaged DVD for about five years running. Needless to say Peter had the last laugh as he got my cash for this book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2199822626", "review_id": "2199822626", "date": "Nov 30, 2017", "rating": 2, "user_name": "Erin-Elizabeth", "user_url": "/user/show/69330122-erin-elizabeth", "text": "I love Peter Kay but I didn't love his autobiography.It started off well enough and some of the characters he recalls from his early years growing up in Bolton were amusing and unique. I found myself making connections between his stand up and the subject matter in this book. There were a few real laugh out loud moments and I was really enjoying it. Then, something happened halfway through. It seemed to get lost and I was finding it incredibly dull. He warbled on about his music interests and collection for what seemed like a decade and I found it harder and harder to pluck up the enthusiasm to pick up the book and continue reading. In the end, I stopped fighting and took it back to the library. I think I'll stick to his DVDs instead.", "num_likes": 0, "sort_order": "default", "shelves": ["biographies-and-autobiographies"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3628487463", "review_id": "3628487463", "date": "Nov 10, 2020", "rating": 3, "user_name": "James Taylor", "user_url": "/user/show/54269944-james-taylor", "text": "The book begins with a story about how he started learning to drive which seemed odd, but he goes off on tangents, with loads of flashbacks. There’s some funny stories, or at least he manages to throw in some punchlines now and then. Each chapter is on a different part of his life, but the stories aren’t chronological. Sometimes he even jumps about in time during the same chapter. I don’t see any reason for him to do this. He mainly discusses his employment history; warehouse, petrol station, video rentals, bingo hall, cinema, and more. There’s not much content about his transition into the world of comedy which is rather odd, given that it’s a comedian’s autobiography.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3145577745", "review_id": "3145577745", "date": "Jan 20, 2020", "rating": 3, "user_name": "Tom Houlton", "user_url": "/user/show/70517091-tom-houlton", "text": "For an autobiography this is not like Peter Kay at all and it is such a shame.Extreme negativity and complaining throughout, Kay comes across as mean and even offensive. The novel doesn't get going until it's too late and, for some reason, focuses mainly on his life between 15-21 years old.It does have some laughs and is extremely easy to read, with Kay's special 'chatty' style. However, to not focus on how he actually rose to fame in his own story, seems surreal and neglectful of his audience.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4247589486", "review_id": "4247589486", "date": "Sep 22, 2021", "rating": 4, "user_name": "Paul Reid", "user_url": "/user/show/16357119-paul-reid", "text": "Do not read this book!Peter reads the audiobook himself many years after writing it and often just puts his book down and goes off on a tangent which could go anywhere, so listen to it! The book was a great listen, with many laugh out loud moments that kept me entertained for a couple of days worth of driving.It spans from his childhood up to when he first wins a local stand up competition beating Jonny Vegas, now maybe there already is one (I’ll have to check) but I hope one day there’s a book which takes the story up to present day.More power to you Peter.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4506689257", "review_id": "4506689257", "date": "Jan 26, 2022", "rating": 5, "user_name": "Valerie Holden", "user_url": "/user/show/23180809-valerie-holden", "text": "Peter Kay has long been the UK’s favourite comedian with sell-out arena tours, TV series and memorable guest appearances. For reasons known to himself, in 2017, he stepped back from all public appearances including a second sell-out arena tour. Peter Kay’s record breaking, best-selling autobiography was written back in 2006 and finally came out on audible last year with the narration by the great man himself. It is so good to see (and hear) him again. He has been sorely missed. A real treat on this damp and cold January day.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1781756471", "review_id": "1781756471", "date": "Jan 02, 2017", "rating": 3, "user_name": "Jane", "user_url": "/user/show/5907245-jane", "text": "Peter Kays autobiography starts off pretty funny then fades the further it goes on. There are quite afew funny bits but I am on the fence about whether I found it particularly interesting or not. There was something about this book I just couldn't put my finger on and meant I wasn't quite engaged in it which was a shame.I quite like Peter Kay as a comedian but I am not a huge fan and maybe thats why I am on the fence as avid fans probably really enjoyed it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2201905887", "review_id": "2201905887", "date": "Dec 02, 2017", "rating": 4, "user_name": "Plum-crazy", "user_url": "/user/show/30347735-plum-crazy", "text": "I'm not one for autobiographies or memoirs but I did enjoy this. Kay's writing style made it so easy to just keep dipping into this book & reading a bit at a time. It's just like listening to him talk...unless I'm starting to read with a Lancashire accent (which I do hope not being a Yorkshire lass!)If you've seen his Mum Want's A Bungalow show, you'll recognise a lot of the anecdotes....great fun, & don't forget to look out for all the side notes.", "num_likes": 0, "sort_order": "default", "shelves": ["nonfiction-autos-bios-and-memoirs"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2302280799", "review_id": "2302280799", "date": "Feb 24, 2018", "rating": 4, "user_name": "Soozee", "user_url": "/user/show/38578772-soozee", "text": "An entertaining read, charting Peter Kay's early life and rise to becoming a successful comedian. In parts it seemed to jump around and lack cohesion, but overall its a good read - a 'laugh out loud' book. Not sure about his confessions to petty thievery, but maybe going public puts the management of such establishments on the alert! An easy and pleasant book to read; you can hear his voice in the narrative.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4360778426", "review_id": "4360778426", "date": "Dec 25, 2021", "rating": 5, "user_name": "Alex", "user_url": "/user/show/59249895-alex", "text": "I listened to the new audiobook version of Peter Kay’s autobiography more than a decade after reading it. The audiobook has the benefit of Kay going off on tangents about his memories, as this is the first time he read the book since it’s release.It is a very wholesome read and includes many hilarious childhood anecdotes, many of which made it into his standup routines later in his life.Great book for fans of Peter Kay.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2341652124", "review_id": "2341652124", "date": "Apr 14, 2018", "rating": 2, "user_name": "Theo Kokonas", "user_url": "/user/show/35533313-theo-kokonas", "text": "If you're looking for a laugh-out-loud read, this isn't it. Peter Kay's stand-up performances are impressive but his writing skills are ok. It's not that I hated it, it just didn't have that staying power I expected of it. This book appears to be a staple in the charity shops I frequent for good reason; you read it, think \"yeah, it was ok\" and pass it on.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2753886715", "review_id": "2753886715", "date": "Mar 20, 2019", "rating": 3, "user_name": "Gareth", "user_url": "/user/show/1248708-gareth", "text": "Peter Kay is a very funny man, but this autobiography feels a bit odd. It’s worth reading for the last couple of chapters where he becomes the comedian everyone loves, and those strange little stories told in the earlier chapters make sense when you realise they’re part of his first few routines as a stand-up. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4390525711", "review_id": "4390525711", "date": "Dec 15, 2021", "rating": 5, "user_name": "Cherrelle Smith", "user_url": "/user/show/10984341-cherrelle-smith", "text": "This was the best kind of re-read. Peter Kay finally recorded the audiobook version of his best selling autobiography, injecting it with even more personality than the print version already had. I absolutely adored his additional comments and additional 'break' chapters. Listening to it felt like I was sitting down for a cuppa and a chat with him and I loved every minute.", "num_likes": 0, "sort_order": "default", "shelves": ["autobiography", "read-in-2021"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2897466852", "review_id": "2897466852", "date": "Oct 18, 2019", "rating": 4, "user_name": "Mikey James", "user_url": "/user/show/99822717-mikey-james", "text": "Great, fun read. Only reason why I didn’t give it 5 stars was because I was hoping for a bit more background on Peter’s fame. Instead this book focuses on all his jobs before he was famous. Hopefully he’ll write another soon. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3275675487", "review_id": "3275675487", "date": "Apr 14, 2020", "rating": 5, "user_name": "Louise Allison", "user_url": "/user/show/61375678-louise-allison", "text": "Funniest thing I've read in years - it took me straight back to being a teen in the 80's! It also took me back to living in the north of England with the sarcasm, humour and way of living. Helps if you read it with a Yorkshire accent ha ha. LOVE LOVE LOVE!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4251872349", "review_id": "4251872349", "date": "Sep 22, 2021", "rating": 3, "user_name": "John Mills", "user_url": "/user/show/55135074-john-mills", "text": "Audiobook: Kay's performance is pretty good. Easily distracted but adds heavily to the autobiography and the general tone. Book itself feels very dated with some descriptions and anecdotes not really holding up culturally or socially. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4241486188", "review_id": "4241486188", "date": "Sep 27, 2021", "rating": 5, "user_name": "Olly Mogs", "user_url": "/user/show/82478965-olly-mogs", "text": "I got the audible version and it was so worth it - what a complete joy to listen to. He doesn't just read the book he interacts with it and goes off on delightful tangents. The contents are interesting too - definitely worth a listen", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4347244624", "review_id": "4347244624", "date": "Nov 20, 2021", "rating": 4, "user_name": "Nathan Chadwick", "user_url": "/user/show/109092829-nathan-chadwick", "text": "It’s exactly what you’d expect from Peter Kay. Down to Earth, no grandiose bullshit, just pure self deprecating humour. Worth listening to, as he goes off script a lot, and it’s nice to hear a reflective take a decade on! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4498583124", "review_id": "4498583124", "date": "Jan 23, 2022", "rating": 3, "user_name": "Lesley Elliot", "user_url": "/user/show/52523477-lesley-elliot", "text": "Only really part one of his autobiographyGood read. Funny and warm. He sound like a genuine bloke. I enjoyed the book, but as I said it seems to be only the first part of his story and ends just as his journey to fame has started. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2034439033", "review_id": "2034439033", "date": "Jun 19, 2017", "rating": 2, "user_name": "Kathlyn", "user_url": "/user/show/9134262-kathlyn", "text": "I like Peter Kay - I think he's hilarious but this book just isn't.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2046185063", "review_id": "2046185063", "date": "Jul 06, 2017", "rating": 5, "user_name": "Charlotte Smith", "user_url": "/user/show/38708746-charlotte-smith", "text": "What a good book from Peter Kay, hope there is a second book from him.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2222451737", "review_id": "2222451737", "date": "Dec 22, 2017", "rating": 3, "user_name": "Eva", "user_url": "/user/show/7466147-eva", "text": "Funny and a good record of what happened but somehow didn’t really reveal anything personal, I didn’t feel like I was getting to know him at all.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2430036260", "review_id": "2430036260", "date": "Jun 21, 2018", "rating": 4, "user_name": "Becky", "user_url": "/user/show/56678786-becky", "text": "A fairly quick, very engaging, chatty read.3.5 stars", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2514201554", "review_id": "2514201554", "date": "Aug 31, 2018", "rating": 3, "user_name": "Tony", "user_url": "/user/show/31818441-tony", "text": "Lightweight autobiography covering his early life up to winning a stand-up competition, passing his driving test and meeting his wife. As I didn't really know anything about him, it was amusing", "num_likes": 0, "sort_order": "default", "shelves": ["personal"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2993796881", "review_id": "2993796881", "date": "Oct 03, 2019", "rating": 3, "user_name": "Stuart Champion", "user_url": "/user/show/58588168-stuart-champion", "text": "Funny in places. His stand-up routine comes across quite well, although the lines might work better performed.Good to hear how his success came about.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3109938789", "review_id": "3109938789", "date": "Dec 30, 2019", "rating": 1, "user_name": "Jessica", "user_url": "/user/show/40842727-jessica", "text": "Peter Kay is funny. This book is not.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3224734790", "review_id": "3224734790", "date": "Mar 09, 2020", "rating": 4, "user_name": "Dale Woodfield", "user_url": "/user/show/111170925-dale-woodfield", "text": "Fun read", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3255054512", "review_id": "3255054512", "date": "Mar 30, 2020", "rating": 3, "user_name": "L A", "user_url": "/user/show/105434352-l-a", "text": "Reread. Not as funny as I remembered but defo still funny in parts. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3294886049", "review_id": "3294886049", "date": "Apr 29, 2020", "rating": 5, "user_name": "Edwina", "user_url": "/user/show/10406872-edwina", "text": "I really funny book. Great read for fans of Peter Kay. you can hear his voice all the way through it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3370912351", "review_id": "3370912351", "date": "Jun 02, 2020", "rating": 4, "user_name": "Readerjems", "user_url": "/user/show/39002258-readerjems", "text": "Very funny", "num_likes": 0, "sort_order": "default", "shelves": ["2008"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3522909236", "review_id": "3522909236", "date": "Aug 30, 2020", "rating": 3, "user_name": "Cats Are Best", "user_url": "/user/show/119631347-cats-are-best", "text": "I loved it, very funny indeed. Loved his favourite tea as well: Chicken Kievs, chips, beans and a fried egg", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3564052819", "review_id": "3564052819", "date": "Sep 24, 2020", "rating": 5, "user_name": "Luci", "user_url": "/user/show/121932029-luci", "text": "Love Peter Kay and loved his story. Very inspirational and funny!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3641660388", "review_id": "3641660388", "date": "Nov 12, 2020", "rating": 1, "user_name": "Nick", "user_url": "/user/show/123657090-nick", "text": "This book is utter shit", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3659791868", "review_id": "3659791868", "date": "Nov 23, 2020", "rating": 5, "user_name": "Louise Jeffery", "user_url": "/user/show/125110749-louise-jeffery", "text": "A truly brilliant and entertaining read, I enjoyed it from start to finish!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2951401505", "review_id": "2951401505", "date": "Dec 17, 2020", "rating": 5, "user_name": "Tim", "user_url": "/user/show/100207402-tim", "text": "Fantastic read hilariously funny and well written", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3737124937", "review_id": "3737124937", "date": "Jan 02, 2021", "rating": 5, "user_name": "Julie", "user_url": "/user/show/105504834-julie", "text": "Laugh out loud funny. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3790017076", "review_id": "3790017076", "date": "Jan 22, 2021", "rating": 4, "user_name": "Karen Tracey", "user_url": "/user/show/50462643-karen-tracey", "text": "Short but sweetShort but sweet. Down to earth honest reading. Felt like I was watching his life as it happened. Lovely man", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3746688732", "review_id": "3746688732", "date": "Jan 26, 2021", "rating": 5, "user_name": "Karen", "user_url": "/user/show/127680738-karen", "text": "I read this book quickly and laughed so much.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3838459278", "review_id": "3838459278", "date": "Feb 14, 2021", "rating": 1, "user_name": "Lucy Unsworth", "user_url": "/user/show/82829811-lucy-unsworth", "text": "Badly converted A lot of silly spelling mistakes. A quick read through before the book was put up on kindle was all that was required ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3872021284", "review_id": "3872021284", "date": "Mar 05, 2021", "rating": 5, "user_name": "Caz", "user_url": "/user/show/60957512-caz", "text": "Brilliant. Funny just like him. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3008763062", "review_id": "3008763062", "date": "Mar 07, 2021", "rating": 4, "user_name": "Sue", "user_url": "/user/show/102940664-sue", "text": "Funny book", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3970892739", "review_id": "3970892739", "date": "Jun 13, 2021", "rating": 2, "user_name": "Tom Birkett", "user_url": "/user/show/129043474-tom-birkett", "text": "Pretty boring, mostly about childhood. Skim read last third as had barely laughed so far.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4129357106", "review_id": "4129357106", "date": "Jul 24, 2021", "rating": 5, "user_name": "ROB SHERSBY", "user_url": "/user/show/99997384-rob-shersby", "text": "Absolutely brilliant!!!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4205549082", "review_id": "4205549082", "date": "Aug 29, 2021", "rating": 5, "user_name": "Germaine De", "user_url": "/user/show/139659770-germaine-de", "text": "Funny as fuck", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4240652402", "review_id": "4240652402", "date": "Sep 17, 2021", "rating": 5, "user_name": "Siân Collins", "user_url": "/user/show/21250055-si-n-collins", "text": "I absolutely loved this and laughed my way through it. Peter's perspective on his own life is full of heartwarming cheer and positivity. Hilarious and insightful.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4251197203", "review_id": "4251197203", "date": "Oct 01, 2021", "rating": 5, "user_name": "Jeanette", "user_url": "/user/show/6778399-jeanette", "text": "Loved this. Even more so because it was narrated by Peter Kay. Laughed out loud so many times. ", "num_likes": 0, "sort_order": "default", "shelves": ["all-time-favourites", "audiobooks"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4276346020", "review_id": "4276346020", "date": "Oct 13, 2021", "rating": 4, "user_name": "Joe Polshaw", "user_url": "/user/show/24527706-joe-polshaw", "text": "Very entertaining and works very well as an audiobook.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4331903001", "review_id": "4331903001", "date": "Nov 20, 2021", "rating": 5, "user_name": "Jaybels", "user_url": "/user/show/106337127-jaybels", "text": "Brilliant - heart-warming and hilarious. Favourite comedian.", "num_likes": 0, "sort_order": "default", "shelves": ["audible"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4414701372", "review_id": "4414701372", "date": "Dec 27, 2021", "rating": 5, "user_name": "Rosie Lee", "user_url": "/user/show/56917060-rosie-lee", "text": "Peter kay is simply the best ❤️", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4401667801", "review_id": "4401667801", "date": "Dec 27, 2021", "rating": 5, "user_name": "Carrie-Jennifer Cairns", "user_url": "/user/show/75818731-carrie-jennifer-cairns", "text": "Read it before, multiple times when it was first released. It was just as good as I remembered it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4440501335", "review_id": "4440501335", "date": "Jan 03, 2022", "rating": 5, "user_name": "Joanne Mckee", "user_url": "/user/show/143715412-joanne-mckee", "text": "Absolutely fantastic. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4406148729", "review_id": "4406148729", "date": "Jan 07, 2022", "rating": 5, "user_name": "Matt Gantry", "user_url": "/user/show/140504127-matt-gantry", "text": "Absolutely brilliant. I was laughing randomly at the gym with my headphones on!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4456351925", "review_id": "4456351925", "date": "Jan 07, 2022", "rating": 5, "user_name": "Warren", "user_url": "/user/show/144526295-warren", "text": "Brilliant book and so funny", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4472179134", "review_id": "4472179134", "date": "Jan 13, 2022", "rating": 5, "user_name": "Bryan Irving", "user_url": "/user/show/38573240-bryan-irving", "text": "Several times I had to stop reading just to sit laughing for a while.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4350402040", "review_id": "4350402040", "date": "Feb 02, 2022", "rating": 4, "user_name": "S W", "user_url": "/user/show/134943235-s-w", "text": "I enjoyed listening to Peter Kay tell me about his life up to the point when he became a comedian. Very entertaining as expected! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4533522176", "review_id": "4533522176", "date": "Feb 15, 2022", "rating": 1, "user_name": "Nick", "user_url": "/user/show/77291844-nick", "text": "Listened to the audiobook and hated it. I love peter’s comedy but this is just nonsensical jibberish ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/4281411284", "review_id": "4281411284", "date": "Oct 10, 2021", "rating": 4, "user_name": "Jack Youd", "user_url": "/user/show/141509127-jack-youd", "text": "My personal favourite comedian, this was a very funny read and interesting to see the journey he went on to become the comedian everyone knows and loves. The stories he tells from school and jobs leave you crying with laughter. Great read.", "num_likes": 0, "sort_order": "default", "shelves": ["tv"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1869807988", "review_id": "1869807988", "date": "Jan 07, 2017", "rating": 2, "user_name": "lorraine", "user_url": "/user/show/57231593-lorraine", "text": "2.5 stars hhhmmm...there are some laughs (and some cringes), but this reads more like a stand up routine (same old, same old...funny at times yes, but it´s that never ending rehash) rather than giving us a look at the \"real\" mr kay. feel it lacks honesty, but maybe i´m being unfair. rather glib and often a tad spiteful. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/682947342", "review_id": "682947342", "date": "Aug 01, 2013", "rating": 4, "user_name": "Mark Farley", "user_url": "/user/show/167018-mark-farley", "text": "A few years ago, Peter Kay’s book, ‘The Sound of Laughter’ took the book trade (and I very much suspect, Random House) completely by surprise by becoming the biggest-selling British autobiography of all time in hardback, selling one million copies in its first three months. I remember reading some sort of ballpark figure in The Bookseller that Christmas or following New Year in the regions of one in three households in the North West had received a copy and that at least 80% had been from that surrounding area. That alone is a huge achievement and testament to Peter’s warm and infectious style (one that can only come from up north), not to mention the success he has achieved from his other endeavours within the media. He has also the attribute of having a similar effect to the sales of DVDs. Peter (on the other hand), could quite well become the Alan Bennett for the next generation if his first book is anything to go by. The book isn’t massively well written but has a definite grasp on the current nostalgia/anecdote market trend. In many ways, he is a hark back to the days of light entertainment and the likes of Freddie Starr and reading a lot of this book did make me want to take Freddie to one side and say, “Here Freddie, that thing you complained about the direction TV has gone and away from people like you…” …because Peter is the embodiment of light entertainment, Freddie. He is just funny and inoffensive. Unlike you. Peter’s book is a joy though. He has this great style that is beyond the genre and I think his secret to book success is how he has really took to writing out of the box with his narrative, in that he doesn’t just tell you the story, he takes you along the writing process and ribs the idea of himself going down the book route. His love for his culture and indeed it’s nostalgia is also quite endearing. The mention of things, products, places, TV shows of yesteryear makes you chuckle and turn the page and the fact that you do realise that this is not really a celebrity at all (or not one that embraces the culture of) is quite significant and evidence of his appeal. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3972358", "review_id": "3972358", "date": "Aug 02, 2007", "rating": 4, "user_name": "Olivia", "user_url": "/user/show/247705-olivia", "text": "Peter Kay is one of those comedians that I often laughed at when I saw him on television. However, I wouldn't have called myself a fan. I thought there was something endearing about him and I always related to his anecdotes but that was that.Following a hectic work day recently I went in to a book shop in search of something funny/light etc. The cover image of Kay in his Sound of Music garb was enough for me.I brought it home and went to my spiritual home (IE. The bathroom) where I took up residency for quite some time!) Kay is British but his childhood was quite similar to my Irish Catholic one and he is of the same vintage. I laughed aloud at his description of the 'good room' mentality. For those not in the know the 'good room' was a forbidden zone for many children of a certain generation. (1970's to 1990).Kay came from a Coronation Street type home -- a small two up two down house. Yet his mother still insisted on keeping one room for guests. The 'good room' was strictly off limits unless someone turned up. So basically, you had this ridiculous situation of not being allowed in to one room unless an outsider came in. Crammed in like sardines unless a visitor called. The book is laugh out loud funny. His description of the awful jobs he took before he hit the big time are hilarious. His attempts to learn how to drive, the characters he met in his menial jobs -- the book is a real treat if you need a quick 'pick me up' after a stressful work week. ", "num_likes": 0, "sort_order": "default", "shelves": ["booksread"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1453415725", "review_id": "1453415725", "date": "Nov 27, 2015", "rating": 5, "user_name": "Kurt Chambers", "user_url": "/user/show/7738793-kurt-chambers", "text": "This is the first time I've read an autobiography. I'm not the type of person that is star struck, but I love Peter Kay! I'm a little older than him, but we were brought up in the same era so I could relate to everything he jokes about, despite just being a southerner. And he is so funny! The book was well written. I only found two very minor mistakes. As I have never read an autobiography, I don't have anything else to compare it to. But I laughed out loud on many occasions whilst reading this. It was so very interesting to see how Peter came from such a normal family to reach the stardom he has now but some measure of luck. I find Peter very talented and it is a great inspiration to see how all his determination and hard work paid off for him. This book is very English, so I'm not sure what the American market would make of it. Here is a funny little story from myself. We have a gnome in our garden that we call Peter Kay. My grandchildren painted two gnomes for our garden. One of them looked like something from a horror movie and the other, for some strange reason looks just like Peter Kay! :D", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/205383002", "review_id": "205383002", "date": "Sep 05, 2011", "rating": 2, "user_name": "Silpa Kohler", "user_url": "/user/show/2656687-silpa-kohler", "text": "I was rather disappointed with this book as it was not nearly as funny as I was expecting it to be. Having read autobiographies written by Michael McIntyre and Anh Do (an Vietnamese/Australian comedian), I was expecting big things from Peter Kay. But unfortunately, all I could muster were slight smiles rather than full-blown how-embarassing-I'm-pissing-myself-with-laughter-while-on-the-bus-and-now-everyone-thinks-I'm-a-weirdo moments. Peter's tales while he was at school were amusing but his stories of going from one part-time job to another were a bit on the boring side. A lot of the references were lost on me (I didn't realise he was that much older than me) but there were a couple than rang a bell. 2 stars because it kept me engaged during the day that it took me to read it. I don't think I'll bother with his other books for the moment though.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/336889287", "review_id": "336889287", "date": "May 26, 2012", "rating": 2, "user_name": "What Lynsey Read", "user_url": "/user/show/5999314-what-lynsey-read", "text": "Generally, I'm neither a fan of auto/biographies or Peter Kay, but this was this month's book club choice (strange one, I know!) and so I dove in.On the plus side, I actually laughed out loud - something I never do - several times, and I found it interesting to read about his adolescence.But even I recognised some of this prose as material from his stand up routine. I was also disappointed that it stopped before describing his rise to fame. I suppose that's so he can make some more money from his subsequent books.I also found the writing style really clunky. Although it did read as though Kay were actually speaking, his humour isn't subtle enough for me. I don't need to be told when he was being sarcastic or making a joke.", "num_likes": 0, "sort_order": "default", "shelves": ["book-club", "biogs"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/366168615", "review_id": "366168615", "date": "Jul 11, 2012", "rating": 4, "user_name": "Caroline Rhea", "user_url": "/user/show/4814130-caroline-rhea", "text": "i'm not sure whether peter kay was aiming for funny or not with this book, but i have to say, i found myself wanting to cry more than i did laugh. there was the odd funny part, but mostly i found a lot of it really ~open and quite, sad... i think that added to the book though. i've read some comedians books where they turn every thing into a \"comedy\" moment and it's just a bit cheesy, whereas i actually feel like i kind of know more about peter kay, now i've read this.i'd recommend it. i'm not saying it's not at all funny, because it is, but i only really found one or two laugh out loud moments.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/731373718", "review_id": "731373718", "date": "Sep 30, 2013", "rating": 3, "user_name": "Andy Harris", "user_url": "/user/show/20672017-andy-harris", "text": "I like a lot Peter Kay's early work - Phoenix Nights in particular. This book cover his life upto his first big break winning a stand up competition and the's where it ends. So if you're looking for an insight into any of his tv work it isn't in the book. The period of his life it covers has some funny moments - albeit I am not sure quite how true parts are, some of it reads more like part of his stand up routine rather than real life. My biggest gripe is it felt like it stopped early in his life to allow another volume or two to be released later, as a cynic it felt like he was holding back so he had another few books of autobiography to sell later.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1378425087", "review_id": "1378425087", "date": "Aug 30, 2015", "rating": 5, "user_name": "Gary Smith", "user_url": "/user/show/35564615-gary-smith", "text": "I am not really one for reading auto biographies, but this is the best I've ever had the pleasure to do do. In parts it had me laughing out loud, it's very well written and in a way , I would suggest all of us remember things, thinking about one subject, only for something that is relevant pops up, before you continue where you left off. I do hope that at some stage in the future, Peter Kay, writes a continuation of his life's stories. I for one, would be buying it. Please read this book, with tissues for the laughter, at the ready.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/72216168", "review_id": "72216168", "date": "Sep 23, 2009", "rating": 4, "user_name": "Sara Lou", "user_url": "/user/show/557365-sara-lou", "text": "Loving Peter Kay I really enjoyed reading his book. I wouldn't usually read the AB of a person who hasn't really been on the radar of fame that long, but PK is such a likeable person and his voice really comes through in this. It's full of his humour and charm and not full of skeletons in the closet or ridiculous gossip you'd expect of todays celebrity. Enjoyable read into one of my favourite comedians.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/76141511", "review_id": "76141511", "date": "Oct 29, 2009", "rating": 3, "user_name": "Andrew", "user_url": "/user/show/2730673-andrew", "text": "I enjoyed this book,It's a light read which really taps into the nostalgic element with mention of such stores as Rumbelows etc through the book.It really shows how Peter came accross his comic crafting through interaction with people,family and workers.Laugh out loud funny in parts which i always find a good thing with a book(unless it's a thriller)especially as a gag can be ruined by the setting up of it within written form", "num_likes": 0, "sort_order": "default", "shelves": ["biog-autobiog"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/109472334", "review_id": "109472334", "date": "Jun 30, 2010", "rating": 5, "user_name": "Antonia", "user_url": "/user/show/3914242-antonia", "text": "You have to be living in Britain or have grown up in the UK and seen him on TV or stage to appreciate.But it is very funny - he has a wonderfully candid down-to-earth way of speaking, which is hilarious, and it comes across in the writing. One of those where you find yourself snorting or spluttering out unexpectedly with laughter. He loves to say riskee things, but with a cheeky little wink in his eye that just makes you titter!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/196055755", "review_id": "196055755", "date": "Aug 08, 2011", "rating": "", "user_name": "Sam Woodfield", "user_url": "/user/show/5888439-sam-woodfield", "text": "I have waited for ages to read this book and was am not disappointed now the wait is over. It was great to read of those encounters which set Kay on his way to being one of Britains best known and loved comics. Although not hysterical throughout, Idid find this quite a funny read and had to read some parts out loud to others so that they too could share the humour.Overall a really good read, especially for fans of Kay and his style of humour.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/478077983", "review_id": "478077983", "date": "Dec 15, 2012", "rating": 2, "user_name": "Bubblesthefairy", "user_url": "/user/show/4215281-bubblesthefairy", "text": "Just done reading this and thought it was ok..... Thought really it would have been better than it was though...You could just imagine the events in the book happening as Peter Kay writes just like he is in his comedy, just like he was chatting to a friend. Wouldnt say it was a waste of time to read but wouldnt go crazy to read it.... A little something to read when you have some time to kill i guess ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/532911952", "review_id": "532911952", "date": "Feb 11, 2013", "rating": 5, "user_name": "Denise", "user_url": "/user/show/17190178-denise", "text": "I am a fan of Peter Kay, I have seen him live twice so had no doubts I would enjoy his book. He makes me cry with laughter and this book did too. It gives a very funny insight into Peter's childhood and working life before he hit the big time. I am around the same age as Peter and live not far from Bolton so I could relate to most things that he mentions. I have never laughed so much reading any book.", "num_likes": 0, "sort_order": "default", "shelves": ["biography"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/15771097", "review_id": "15771097", "date": "Feb 19, 2008", "rating": 2, "user_name": "Kirsty", "user_url": "/user/show/904493-kirsty", "text": "After finding Peter Kay's two DVDs absolutely hilarious, I was expecting to be thoroughly tickled by this book. I was hugely disappointed. Whilst funny in places, this book just dragged for me, and I struggled to finish it. Most of it was either material heard before in his DVDs, or just plain boring!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/64194718", "review_id": "64194718", "date": "Jul 20, 2009", "rating": 2, "user_name": "Godzilla", "user_url": "/user/show/737004-godzilla", "text": "I was slightly disappointed with this - it's basically his stand up act re-worded. Little real insight into his motivations and experiences, but an easy read. It felt as though he never really let his guard down. I know most autobigraphies will gloss over certain parts, but this one felt so shallow. I found some of the chronology hard to follow too.", "num_likes": 0, "sort_order": "default", "shelves": ["biographies", "2009"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/70760464", "review_id": "70760464", "date": "Sep 10, 2009", "rating": "", "user_name": "Michele", "user_url": "/user/show/130934-michele", "text": "I for one am not fond of celebrity autobiographies.Many have barely started their lives; but in the new age of celebrity religion we needs must read every boring detail. Entertaining comic he may be but his life is really not that fascinating or indeed funny. Sadly the jokes are all too predictable. ", "num_likes": 0, "sort_order": "default", "shelves": ["giving-up"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/246939052", "review_id": "246939052", "date": "Dec 14, 2011", "rating": 4, "user_name": "eastwood  (do you feel lucky punk,well do ya)", "user_url": "/user/show/6716822-eastwood-do-you-feel-lucky-punk-well-do-ya", "text": "now i am not really an autobiography reader normally,but i am a peter kay fan and this is definitely worth a look, goes on about his childhood with some good one liners and continues throughout,of course there is a lot of stuff you have heard before from tv and his shows, but i would still recommend this one,couldn't put it down really funny.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/653559872", "review_id": "653559872", "date": "Jun 28, 2013", "rating": 1, "user_name": "Mitsu", "user_url": "/user/show/21734410-mitsu", "text": "He can definitely tell a story can R Peter. unfortunately there is nothing particularly exciting to tell here but perhaps I have ruined it for myself by reading of the shenanigans of Mr Brand. I would say his writing is not as funny as his stage acts/tv shows and some of his jokes were a bit cringy in that they were so obvious and quite a basic level of comedy.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/676819357", "review_id": "676819357", "date": "Jul 25, 2013", "rating": 3, "user_name": "A", "user_url": "/user/show/22351785-a", "text": "I have always loved Peter Kay, but I never knew that he was an author.This book was very insightful, funny and really cheered me up when I was feeling lowI would recommend it to anyone that is a fan of Peter Kay, you really get to experience him as a person. Obviously, if you can't stand him - don't read it!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1148258861", "review_id": "1148258861", "date": "Dec 31, 2014", "rating": 5, "user_name": "MF", "user_url": "/user/show/21402976-mf", "text": "At times I wished the book was written in a more chronological order, but Peter got the focus right, telling zinger after zinger of funny incidents in his life. Good to see how he found his vocation, despite failing the system early on. I laughed on my own and in company reading this book, for that reason alone it deserved 5 stars. Funny book! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2523369323", "review_id": "2523369323", "date": "Sep 08, 2018", "rating": 3, "user_name": "Undomiel Books (Rosie)", "user_url": "/user/show/85949810-undomiel-books-rosie", "text": "A really fun read by an iconic comedian, you call fully hear Peter Kay in the writing. Some of the moments shared about his childhood were genuinely emotive and very touching, I genuinely felt so much empathy for young Peter, and his growth as a person is fantastically entertaining to read. It makes me respect him even more now than I previously did, not just as a comedian, but as a person too. ", "num_likes": 0, "sort_order": "default", "shelves": ["genre-comedy", "author-european", "non-fiction", "format-memoir"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/8579329", "review_id": "8579329", "date": "Nov 02, 2007", "rating": 4, "user_name": "Helen Pridham", "user_url": "/user/show/537019-helen-pridham", "text": "Anyone who grew up in the same sort of environment as Peter Kay will find this book hysterical.If you watched the A Team on Sunday night after your bath and you remember and used the little letter stickers that came with videos then this is the biography for yo.", "num_likes": 0, "sort_order": "default", "shelves": ["read2006"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/19183787", "review_id": "19183787", "date": "Apr 01, 2008", "rating": 4, "user_name": "Katie", "user_url": "/user/show/798834-katie", "text": "Coming from Bolton and adoring his style of comedy there was no doubt that I'd love this book. Surprisingly interesting in that he discusses his life up to becoming famous, and not beyond. But lots of typos which frustrated me! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/34383850", "review_id": "34383850", "date": "Oct 02, 2008", "rating": 3, "user_name": "Heidi", "user_url": "/user/show/1511638-heidi", "text": "Not really a laugh-out-loud kind-of book, more smiling knowingly. Its an interesting memoir/reminiscence of Peter Kay's youth and adolescence, but the book ends just as he gets his first big break, so there isn't much detail about his comedy career.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/81875781", "review_id": "81875781", "date": "Dec 23, 2009", "rating": 4, "user_name": "Beth", "user_url": "/user/show/3069503-beth", "text": "I really liked this, found myself giggling alot of the way through it. The only thing i thought was wrong it finished way to early, he gave himself a couple of pages to explain he got married etc etc but i wanted to know how they met blah blah blah im hoping his new book might explain things. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/101541310", "review_id": "101541310", "date": "May 06, 2010", "rating": 5, "user_name": "Susan Bullock", "user_url": "/user/show/1945779-susan-bullock", "text": "Funny enough I was out side a charity shop one day and saw this book for 50p.I never regretted buying this book,its funny all the way through it. I would highly recommend it to people who likes Peter Kay! ", "num_likes": 0, "sort_order": "default", "shelves": ["peter-kay"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/105025488", "review_id": "105025488", "date": "May 31, 2010", "rating": 5, "user_name": "Philippa", "user_url": "/user/show/3807308-philippa", "text": "Loved, loved, loved this book, laugh out loud funny. I always seem to be reading in a public place when I read the funniest bit. For me it's what happens in detention with the nuns. Will definitely read it again. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/184738060", "review_id": "184738060", "date": "Jul 13, 2011", "rating": 4, "user_name": "Louise", "user_url": "/user/show/5738322-louise", "text": "I did really enjoy this book, Documenting the years before peter was famous, this makes an intresting and funny read. Of course, most of it is exagrated, but thats what you would expect from a comic anyway. A really funny read, recomended.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/189157002", "review_id": "189157002", "date": "Jul 25, 2011", "rating": 3, "user_name": "Niels", "user_url": "/user/show/5872906-niels", "text": "Peter Kay has an exceptional way of finding the funny bits in everyday life. Not beig a northener and a Dane on top of that makes some passages difficult as they relate to names not known. However, must say that many a time I laughed out loud at this book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/202357287", "review_id": "202357287", "date": "Aug 26, 2011", "rating": 4, "user_name": "David Campton", "user_url": "/user/show/6132768-david-campton", "text": "Started to read this on a boat from Scotland with my family. The sound of my laughter brought them much embarassment. Sadly the rest of the book wasn't quite as funny as the first few chapters, but still worth a read.", "num_likes": 0, "sort_order": "default", "shelves": ["humour", "biography"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/207268922", "review_id": "207268922", "date": "Sep 10, 2011", "rating": 4, "user_name": "Jim", "user_url": "/user/show/5041353-jim", "text": "A popular stand up filling in his back story. How working in a petrol station forecourt can prepare you for the limelight, and how the customers provide you with comedic source material. A very funny man.", "num_likes": 0, "sort_order": "default", "shelves": ["comedy"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/210189287", "review_id": "210189287", "date": "Sep 18, 2011", "rating": 4, "user_name": "James Long", "user_url": "/user/show/6345933-james-long", "text": "Starts brilliantly with some very funny stories but I did feel it just didn't quite last the course. Towards the end it just wasn't written with the same enthusiasm I felt. Enough laugh out loud moments though to give it 4 stars. Worth a read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/238565139", "review_id": "238565139", "date": "Nov 22, 2011", "rating": 3, "user_name": "John", "user_url": "/user/show/7024263-john", "text": "No great literary merit here but didn't expect it. More like reading a stand up routine which (to be fair) he admits the incidents became. Pleasant, undemanding and reasonably funny but why does everything he touches go so mega?", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/308350859", "review_id": "308350859", "date": "Apr 07, 2012", "rating": 5, "user_name": "Sara", "user_url": "/user/show/7474975-sara", "text": "I'd never read an autobiography before I read this a few years ago and I don't think any others would even come close to being as good as this. As soon as I picked it up to the second I put it down I had tears in eyes, howled from start to finish. The funniest book I think I've ever read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/460198498", "review_id": "460198498", "date": "Nov 20, 2012", "rating": 1, "user_name": "Si Jones", "user_url": "/user/show/5861798-si-jones", "text": "The only celebrity autobiography I've ever read and unfortunately I did not enjoy it. His stand-up can be laugh-out-loud funny but this just wasn't.I recommend 'I, Patridge' instead, it's brilliant.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/485720149", "review_id": "485720149", "date": "Dec 26, 2012", "rating": 5, "user_name": "Simon Kitt", "user_url": "/user/show/14696181-simon-kitt", "text": "A marvelous biography detailing Peter from the early age to the beginnings of his career in comedy. Whilst reading it's very easy to imagine him reading it to you. Every chapter has at least a laugh if not more!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/926401323", "review_id": "926401323", "date": "May 02, 2014", "rating": 3, "user_name": "Jeanette", "user_url": "/user/show/2016189-jeanette", "text": "My husband suggested reading this book, as he absolutely loved it. I often heard him laughing to himself when he was reading this book. Unlike my husband, I am no fan of Peter Kay. Although I managed to get through the book, I was glad to have finished it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1461018663", "review_id": "1461018663", "date": "Dec 05, 2015", "rating": 4, "user_name": "Cameron King", "user_url": "/user/show/15847325-cameron-king", "text": "The book is funny, some of the stories make you laugh out loud. However, anyone who has seen any of Peter Kay's routine will be familiar with a good few of the stories. Apart from that it was a pleasure to read!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1365386", "review_id": "1365386", "date": "May 22, 2007", "rating": 5, "user_name": "Becky", "user_url": "/user/show/93366-becky", "text": "This is one of the few autobigraphies I've ever read! It made me laugh throughout - very Northern!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/6006705", "review_id": "6006705", "date": "Sep 10, 2007", "rating": 3, "user_name": "Evelyn (Flask1) MacLean", "user_url": "/user/show/348045-evelyn-flask1-maclean", "text": "Something I learned from this book is that those who make us laugh, are predominantly those who, throughout their own lives have laughed the least!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/6279686", "review_id": "6279686", "date": "Sep 16, 2007", "rating": 4, "user_name": "Sephie", "user_url": "/user/show/112769-sephie", "text": "A very enjoyable and funny read - I too have experienced the nuns although some years before Peter, but nothing seems to have changed much!!", "num_likes": 0, "sort_order": "default", "shelves": ["auto_biog"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/6492878", "review_id": "6492878", "date": "Sep 20, 2007", "rating": 3, "user_name": "Diana Apperley", "user_url": "/user/show/303752-diana-apperley", "text": "It was OK, not brilliant.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/13511029", "review_id": "13511029", "date": "Jan 25, 2008", "rating": 4, "user_name": "Kerry Peattie", "user_url": "/user/show/831571-kerry-peattie", "text": "Hilarious book! Tells the life of Peter Kay and his road to fame. I felt like I was reading it with his accent though! Highly recommended.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/14743515", "review_id": "14743515", "date": "Feb 06, 2008", "rating": 4, "user_name": "Vanessa  Sinclair", "user_url": "/user/show/882054-vanessa-sinclair", "text": "Non stop laughing and I could remember things like this happening within my family and friends and their families Throughly enjoyable", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/16432171", "review_id": "16432171", "date": "Feb 26, 2008", "rating": 2, "user_name": "Akindofmagic", "user_url": "/user/show/945086-akindofmagic", "text": "An excellent read i love peter kay,he lives not to far Away from, although it was a very good read it didnt leave me in stiches lets just say the book isnt as funny as the man. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/16718469", "review_id": "16718469", "date": "Feb 29, 2008", "rating": 5, "user_name": "Donna Rodgers", "user_url": "/user/show/955882-donna-rodgers", "text": "One of the funniest books I've ever read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/19314336", "review_id": "19314336", "date": "Apr 02, 2008", "rating": 5, "user_name": "Ismail Mayat", "user_url": "/user/show/1049649-ismail-mayat", "text": "I lived down the road from peter kay and my old friend lived next to Paddy. The book had me in stitches also great bit of nostaligia as I am originally from bolton.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/19774679", "review_id": "19774679", "date": "Apr 08, 2008", "rating": 4, "user_name": "Caroline", "user_url": "/user/show/1068437-caroline", "text": "This is hilarious for an English girl who was brought up in the north of England. I would be interested to see if anyone who was not brought up in the north of England found it as funny as I did!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/35004782", "review_id": "35004782", "date": "Oct 10, 2008", "rating": 3, "user_name": "Nicola", "user_url": "/user/show/1115868-nicola", "text": "Quick to read and laugh out loud.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/36162911", "review_id": "36162911", "date": "Oct 25, 2008", "rating": 1, "user_name": "Tom", "user_url": "/user/show/204408-tom", "text": "smug, un-funny, very disappointing. the king of \"white-dog-poo and spangles\" humour. TV shows are great, this was a howling waste of time that I stopped 3 chapters in. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/40064488", "review_id": "40064488", "date": "Dec 14, 2008", "rating": "", "user_name": "Mum", "user_url": "/user/show/1801799-mum", "text": "Very funny book about Peter Kays early career.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/43602017", "review_id": "43602017", "date": "Jan 19, 2009", "rating": 4, "user_name": "Leanne", "user_url": "/user/show/1915244-leanne", "text": "Not a masterpiece but very very heartwarming!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/43685672", "review_id": "43685672", "date": "Jan 20, 2009", "rating": 2, "user_name": "Milton Keynes", "user_url": "/user/show/1933662-milton-keynes", "text": "If youve seen his live act then many of the same jokes are in here, annoyingly so. Plus the book stops before hes made it famous. Poor attempt.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/46606863", "review_id": "46606863", "date": "Feb 17, 2009", "rating": 5, "user_name": "Katrina", "user_url": "/user/show/2040658-katrina", "text": "Excellent book, very funny and heart-warming. Peter Kay rules!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/98181794", "review_id": "98181794", "date": "Apr 12, 2010", "rating": 5, "user_name": "Emma", "user_url": "/user/show/3531804-emma", "text": "This is a fantastic laugh out loud book documenting the early years of Peter's life and career. Even the captions on the photos are funny!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/111579459", "review_id": "111579459", "date": "Jul 14, 2010", "rating": 3, "user_name": "Laura Daly", "user_url": "/user/show/4006789-laura-daly", "text": "Funny in parts boring in parts ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/134324060", "review_id": "134324060", "date": "Dec 09, 2010", "rating": 4, "user_name": "Andy", "user_url": "/user/show/4640538-andy", "text": "Very funny - more funny because he's my age I suspect.", "num_likes": 0, "sort_order": "default", "shelves": ["autobiography", "television"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/137092797", "review_id": "137092797", "date": "Dec 29, 2010", "rating": 3, "user_name": "Paul", "user_url": "/user/show/4643325-paul", "text": "I was slightly disappointed with this. There were some funny moments but I was never quite sure how much was story. Some well painted characters though", "num_likes": 0, "sort_order": "default", "shelves": ["autobiography"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/140501587", "review_id": "140501587", "date": "Jan 13, 2011", "rating": 2, "user_name": "Liane", "user_url": "/user/show/4762568-liane", "text": "Was ok but slighty boring after a while...", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/144242114", "review_id": "144242114", "date": "Jan 28, 2011", "rating": 4, "user_name": "Craigb", "user_url": "/user/show/4837309-craigb", "text": "I think Peter Kay is a comedy genius. This book is OK but not as funny as watching the man on TV or live on stage. ", "num_likes": 0, "sort_order": "default", "shelves": ["biography"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/150270511", "review_id": "150270511", "date": "Feb 24, 2011", "rating": 5, "user_name": "Shell Stitcher", "user_url": "/user/show/5027599-shell-stitcher", "text": "EXCELLENT!!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/192251957", "review_id": "192251957", "date": "Jul 30, 2011", "rating": 5, "user_name": "Gemma", "user_url": "/user/show/5921554-gemma", "text": "Excellent book! I literally laughed out loud while reading this and recommend it to anyone who loves Peter Kay and loves to laugh", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/194473703", "review_id": "194473703", "date": "Aug 04, 2011", "rating": 4, "user_name": "Carla", "user_url": "/user/show/5961215-carla", "text": "I loved it. Really cheered me up at a depressing time of year.", "num_likes": 0, "sort_order": "default", "shelves": ["biographies-memoirs", "celebrity-memoirs", "nampara-library"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/194957568", "review_id": "194957568", "date": "Aug 05, 2011", "rating": 3, "user_name": "Edwina Stephen", "user_url": "/user/show/5969629-edwina-stephen", "text": "I could hear his voice as I read it - a good laugh!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/200697090", "review_id": "200697090", "date": "Aug 21, 2011", "rating": 5, "user_name": "Cheryl", "user_url": "/user/show/6043057-cheryl", "text": "Another great Peter Kay book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/201703306", "review_id": "201703306", "date": "Aug 24, 2011", "rating": 3, "user_name": "Val Williams", "user_url": "/user/show/5911111-val-williams", "text": "Nice easy read! Just like Peter talking... but I needed the big light on to read it!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/231313014", "review_id": "231313014", "date": "Nov 04, 2011", "rating": 2, "user_name": "Mark", "user_url": "/user/show/6881312-mark", "text": "A light and silly read.", "num_likes": 0, "sort_order": "default", "shelves": ["autobiography", "comedy"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/260173580", "review_id": "260173580", "date": "Jan 11, 2012", "rating": 5, "user_name": "Lovesreading06", "user_url": "/user/show/6878619-lovesreading06", "text": "This is an intersting book and so funny. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/260866692", "review_id": "260866692", "date": "Jan 12, 2012", "rating": 3, "user_name": "Louise", "user_url": "/user/show/2460995-louise", "text": "Read it in five hours. Some spelling errors etc which convinced me he wrote it himself. Very nice insight to his life and beliefs.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/268192837", "review_id": "268192837", "date": "Jan 26, 2012", "rating": 4, "user_name": "Alice", "user_url": "/user/show/6838599-alice", "text": "Enjoyed reading this book - Peter Kaye is a very funny man and the book has a lot of small references to things that were popular in the 70's/80's. An easy lighthearted read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/337708617", "review_id": "337708617", "date": "May 27, 2012", "rating": 4, "user_name": "Kyle Lewis", "user_url": "/user/show/9758533-kyle-lewis", "text": "I have to admit that I don't remember finishing it, but probably did. I do remember it being LOL hilarious :)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/357311407", "review_id": "357311407", "date": "Jun 28, 2012", "rating": 5, "user_name": "Adam Al Jabry", "user_url": "/user/show/10517234-adam-al-jabry", "text": "  Hilarious and witty!!! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/359030981", "review_id": "359030981", "date": "Jul 01, 2012", "rating": 4, "user_name": "Tara", "user_url": "/user/show/5914778-tara", "text": "Some real good \"laugh out loud\" sections but best delivered in a stand-up performance.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/389299469", "review_id": "389299469", "date": "Aug 11, 2012", "rating": 1, "user_name": "Andy", "user_url": "/user/show/6315857-andy", "text": "Read this on my Kindle via library loan. Had to use Calibre and a plug-in to convert it. Interesting technical challenge - crap book. Deleted.", "num_likes": 0, "sort_order": "default", "shelves": ["dnf"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/401310409", "review_id": "401310409", "date": "Aug 27, 2012", "rating": 5, "user_name": "Tina", "user_url": "/user/show/12247380-tina", "text": "Very funny book, lots of laughs and all the different jobs Peter did before he was a comic.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/403729355", "review_id": "403729355", "date": "Aug 30, 2012", "rating": 4, "user_name": "Adam Cabuk", "user_url": "/user/show/12332685-adam-cabuk", "text": "This book was LOL though probilly it is not true he told it like it was pulled out of a family photo album. The jouerny of his carrier as a comadien inspired me.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/474587050", "review_id": "474587050", "date": "Dec 10, 2012", "rating": 5, "user_name": "Sarah Elizabeth", "user_url": "/user/show/14704707-sarah-elizabeth", "text": "I love this book I cry laughing everytime I read it Peter is truly hilarious :-)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/483017253", "review_id": "483017253", "date": "Dec 22, 2012", "rating": 4, "user_name": "Leo Nguyen", "user_url": "/user/show/15673091-leo-nguyen", "text": "Great Brit humor, I was in stitiches for must of the book, especially when he was in driver school. Hilarious read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/498816790", "review_id": "498816790", "date": "Jan 07, 2013", "rating": 5, "user_name": "James Smith", "user_url": "/user/show/15851062-james-smith", "text": "Brilliant. Pretty funny too!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/523535996", "review_id": "523535996", "date": "Feb 01, 2013", "rating": 2, "user_name": "Anne", "user_url": "/user/show/9140972-anne", "text": "Disappointing, not as funny as I thought it would be and actually showed he is not the loveable guy you think he is. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/542886228", "review_id": "542886228", "date": "Feb 21, 2013", "rating": 4, "user_name": "Anthony Ward", "user_url": "/user/show/17451943-anthony-ward", "text": "Made me laugh throughout. Some really good personal stories in there.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/553722143", "review_id": "553722143", "date": "Mar 06, 2013", "rating": 5, "user_name": "Kramie Moon", "user_url": "/user/show/17387325-kramie-moon", "text": "Loved it cried with laughter reading it", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/554949154", "review_id": "554949154", "date": "Mar 07, 2013", "rating": 5, "user_name": "Sue Forbes", "user_url": "/user/show/17078452-sue-forbes", "text": "very funny book writen by a funny man and an honest look at how he started out in his career, a good biography and must read if your a peter kay fan", "num_likes": 0, "sort_order": "default", "shelves": ["favorites"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/640763869", "review_id": "640763869", "date": "May 26, 2013", "rating": 3, "user_name": "Mags Delaney", "user_url": "/user/show/21138508-mags-delaney", "text": "Second visit this time the audio book read by Peter himself with lots of added extras.", "num_likes": 0, "sort_order": "default", "shelves": ["biography"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/688258424", "review_id": "688258424", "date": "Aug 07, 2013", "rating": 5, "user_name": "Zoe", "user_url": "/user/show/18083391-zoe", "text": "Absolutely hilarious. ", "num_likes": 0, "sort_order": "default", "shelves": ["favourites"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/714755948", "review_id": "714755948", "date": "Sep 08, 2013", "rating": 3, "user_name": "Alex", "user_url": "/user/show/23774461-alex", "text": "Mildly Amusing", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/741937345", "review_id": "741937345", "date": "Oct 15, 2013", "rating": 4, "user_name": "Emma Coleman", "user_url": "/user/show/24707919-emma-coleman", "text": "Love Peter Kay's book.He is halrious.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/761436567", "review_id": "761436567", "date": "Nov 10, 2013", "rating": 5, "user_name": "Daniel James", "user_url": "/user/show/25521712-daniel-james", "text": "A wonderfully written autobiography from Peter Kay. I read the entire book in his voice and after reading this book I felt like his jokes had more depth to them. Great stuff!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/951331134", "review_id": "951331134", "date": "May 29, 2014", "rating": 5, "user_name": "Sandie Beynon", "user_url": "/user/show/31808928-sandie-beynon", "text": "A book I bought and read long ago and one of funniest I've read. Have read it more than once and it still makes me laugh hard. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/970925514", "review_id": "970925514", "date": "Jun 18, 2014", "rating": 4, "user_name": "Jamie Robertson", "user_url": "/user/show/31292552-jamie-robertson", "text": "Funny enough, but you are left feeling that he is going for a gag rather than tell you about himself.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1112174475", "review_id": "1112174475", "date": "Nov 21, 2014", "rating": 5, "user_name": "Dan Lane", "user_url": "/user/show/35434108-dan-lane", "text": "It was a fantastic autobiography! Hilariously funny and honest! I look forward to reading his second book! ", "num_likes": 0, "sort_order": "default", "shelves": ["autobiographies"]}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1161329786", "review_id": "1161329786", "date": "Jan 08, 2015", "rating": 3, "user_name": "Scott", "user_url": "/user/show/11135067-scott", "text": "Preferred Lee Evans' and David Jason's. Funny nonetheless it just tailed off for me over the last few chapters because the things he was talking about I've seen in his stand up routines.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1269111895", "review_id": "1269111895", "date": "May 01, 2015", "rating": 5, "user_name": "Paul Tisserant", "user_url": "/user/show/20482255-paul-tisserant", "text": "A very funny read. Told in a relaxed style and left me giggling to myself.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1275605216", "review_id": "1275605216", "date": "May 09, 2015", "rating": 3, "user_name": "Stacey", "user_url": "/user/show/11071893-stacey", "text": "I thoroughly enjoyed how it was written. I kept hearing his voice when I was reading it. Parts of it had me in stitches. All in all a decent autobiography.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1301432513", "review_id": "1301432513", "date": "Jun 07, 2015", "rating": 5, "user_name": "Sarah", "user_url": "/user/show/6098861-sarah", "text": "A laugh out loud, brilliant book!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1322325627", "review_id": "1322325627", "date": "Jul 01, 2015", "rating": 4, "user_name": "Sarah Tipper", "user_url": "/user/show/17905900-sarah-tipper", "text": "This book reads like his stand-up, it's full of funny little scenes from his family life and from his school days and jobs. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1407176443", "review_id": "1407176443", "date": "Oct 03, 2015", "rating": 4, "user_name": "Christian", "user_url": "/user/show/47509739-christian", "text": "Very enjoyable book to read", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1504224010", "review_id": "1504224010", "date": "Jan 10, 2016", "rating": 5, "user_name": "Alison Lorey", "user_url": "/user/show/50818560-alison-lorey", "text": "Crying with laughterLoved this book so honest and very funny great read would highl recommend thanks Mr Kay", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1539356195", "review_id": "1539356195", "date": "Feb 06, 2016", "rating": "", "user_name": "Samantha Harwood", "user_url": "/user/show/10776561-samantha-harwood", "text": "Absolutly brilliant book. Could read without bursting out into laughter. One of my favourite books, Ive even re-read it and still laughed as much. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1654306102", "review_id": "1654306102", "date": "May 31, 2016", "rating": 5, "user_name": "Garry Marlton", "user_url": "/user/show/6863518-garry-marlton", "text": "I made the mistake of reading this book while out in the public. WARNING you will laugh out load.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1893916648", "review_id": "1893916648", "date": "Jan 27, 2017", "rating": 3, "user_name": "Lynda", "user_url": "/user/show/53490997-lynda", "text": "Not as funny as I was expecting", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2270467891", "review_id": "2270467891", "date": "Jan 24, 2018", "rating": 5, "user_name": "Andrew McLeod", "user_url": "/user/show/76896004-andrew-mcleod", "text": "Hilarious. The only book I have ever genuinely laughed at.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3025774377", "review_id": "3025774377", "date": "Jun 03, 2020", "rating": 3, "user_name": "JB 007", "user_url": "/user/show/97757900-jb-007", "text": "3 and a half stars", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/3872338259", "review_id": "3872338259", "date": "Mar 04, 2021", "rating": 3, "user_name": "Gary Cupitt", "user_url": "/user/show/129636513-gary-cupitt", "text": "Good honest read, just expected a few more laughs. Bar set high by Peter Kay, so was always prone to falling a bit short. More Sound of titter though", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/94195008", "review_id": "94195008", "date": "Mar 15, 2010", "rating": 5, "user_name": "Samantha", "user_url": "/user/show/3128094-samantha", "text": "i loved this books english wit,found myself laughing out load", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/559811863", "review_id": "559811863", "date": "Mar 13, 2013", "rating": 1, "user_name": "Jane Oberheim", "user_url": "/user/show/11725145-jane-oberheim", "text": "I never finished this which is extremely rare for me. Didn't find it funny at all. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/876661420", "review_id": "876661420", "date": "Mar 09, 2014", "rating": 5, "user_name": "Tracey", "user_url": "/user/show/22686496-tracey", "text": "Brilliant. A must for all Peter Kay fans", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1606241737", "review_id": "1606241737", "date": "Apr 10, 2016", "rating": 5, "user_name": "Barbi  Ivánka-Tóth ", "user_url": "/user/show/43116288-barbi-iv-nka-t-th", "text": "Funniest autobiography I've ever read so far.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1897858901", "review_id": "1897858901", "date": "Jan 31, 2017", "rating": 5, "user_name": "Toni-Lee", "user_url": "/user/show/56731675-toni-lee", "text": "So funny, always love him", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/1759128513", "review_id": "1759128513", "date": "May 01, 2017", "rating": 5, "user_name": "Noel", "user_url": "/user/show/15726949-noel", "text": "a refreshing autobiography which has made me laugh out loud . so funny about everyday things much better than other humourous biographies by others e.g miranda hart not funny at all.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "1147591.The_Sound_of_Laughter", "book_id": "1147591", "book_title": "The Sound of Laughter", "review_url": "https://www.goodreads.com/review/show/2400365332", "review_id": "2400365332", "date": "May 23, 2018", "rating": 5, "user_name": "Paul", "user_url": "/user/show/74303802-paul", "text": "Leonard new everybody and now everyone knows Leonard thanks to Peter Kay. I took my time reading this book because I'm not a reader. Glad I read this though I really enjoyed it.10 out of 10", "num_likes": 0, "sort_order": "default", "shelves": []}]