[{"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3574972", "review_id": "3574972", "date": "Jul 26, 2007", "rating": 5, "user_name": "Jessica", "user_url": "/user/show/224703-jessica", "text": "After reading this book I decided that I will probably never loan it out because I will want to read it over and over again.This is, by far, the most emotionally provocative book I've ever read. For about the first 25 chapters or so, I was convinced I knew what was going on, only to be hurled into an entire weekend of crying and page-turning. I couldn't stop crying, yet I couldn't put it down. This book made me realize so many things about myself, life, death, and what it really and truly means to love someone so completely that you would be nothing without them.Now, I plan to read all of Marian Keyes' other books. She is an amazingly gifted writer and I can't wait to learn more about the Walsh sisters and the many other characters she's created.", "num_likes": 91, "sort_order": "default", "shelves": ["topshelf"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/157042736", "review_id": "157042736", "date": "Mar 27, 2011", "rating": 3, "user_name": "Corey", "user_url": "/user/show/3699250-corey", "text": "I mentally classify most novels into one of two broad categories: Literature or Crap. Within the Crap category there are several further levels. Books with negligible literary attributes (like no plot, no character development, poor writing, etc....ehh hmmm... Twilight) fall into the \"Watching TV\" category (because reading one of these books is the intellectual equivalent and takes the same amount of effort as sitting through a TV show). Marian Keyes' books definitely do not fall into the Literature category because they don't offer much in the way of new insights or artistic use of language, but as far as Crap goes, they are pretty high quality. They are extremely funny and the writing is surprisingly GOOD! I definitely couldn't write that well while maintaining such a complexity of characters and plot lines for 600 pages. That's for sure. Her books are belittlingly labeled as \"chick lit\", forever dooming serious readers to deny having enjoyed them. But thinking about it, (and in an effort to justify my own enjoyment,) the whole chick lit phenomenon is remarkably anti-feminist. Why is there no equivalent nomen for books about traditionally testosterone-y topics like war, fist fights and cars (\"dick lit\" or \"prick lit\" are two possible suggestions - no more vulgar than \"chick lit\" mind you)? Personally, I'd much rather lose myself in a book about a peaceful topic like human relationships (romantic, familial or professional) and the beauty industry, than something bloody and violent. The fact that I am capable of losing myself in 600 pages about cosmetics, a topic that I know absolutely nothing about and have no interest in, is testament to the quality and pace of the writing and the story. Three stars instead of four because, without giving anything away, parts of the theme were really depressing.", "num_likes": 67, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1526686425", "review_id": "1526686425", "date": "Jan 26, 2016", "rating": 4, "user_name": "LENA TRAK", "user_url": "/user/show/51989964-lena-trak", "text": "My best friend recommended this and I have to thank her for it. A lovely book, I remember crying my eyes out so I often had to put it down, get a grip and then go on. Easily read even though I hadn't read the first 3 books of the Walsh Family series. If you enjoyed books by Ahern or Kinsella then you will love Keyes' style!", "num_likes": 43, "sort_order": "default", "shelves": ["chick-lit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2104935842", "review_id": "2104935842", "date": "Aug 29, 2017", "rating": 5, "user_name": "Nilufer Ozmekik", "user_url": "/user/show/53701594-nilufer-ozmekik", "text": "First time I read this book, I was too young, too dim witted and lack of spidey or spider senses. I caught the big revelation at the second half but I have to tell you: this quite emotional, ugly tear jerking, poignant story and my second favorite book of Walsh Sisters series (Angels is my least favorite one: even though it takes place in LA) I highly recommend it.", "num_likes": 38, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2288941690", "review_id": "2288941690", "date": "Feb 08, 2018", "rating": 4, "user_name": "Saadia B. ||  CritiConscience ", "user_url": "/user/show/76507338-saadia-b-criticonscience", "text": "Powerful narrative.Blog | YouTube  | Instagram | Facebook | LinkedIn", "num_likes": 29, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/44549604", "review_id": "44549604", "date": "Jan 27, 2009", "rating": 1, "user_name": "Becky", "user_url": "/user/show/1504452-becky", "text": "This book is one terrible mess, which is surprising because it's written by a \"bestselling\" author. I mean, the dialogue...does she really think people talk like that? And what was up with all those boring email sections, which did nothing to add to the story. Plus, all the main characters are super annoying, especially the parts concerning the main character's job. The most obnoxious part of the story is the \"plot twist\" which happens about 200 pages into the book. I'm fairly certain that everyone must know what the twist is about 50 pages into the story, and the rest of the pages leading up to the \"shocking\" twist are painful. Why did I keep reading this book?", "num_likes": 26, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/31714663", "review_id": "31714663", "date": "Sep 01, 2008", "rating": 5, "user_name": "Bev", "user_url": "/user/show/1394428-bev", "text": "I'd have to put this book in my list of top-ten favorites of all time! I picked up the book-on-tape version at the library and immediately fell in love with Marian Keyes. I had to get the print version to enjoy the story again, and I am not usually one to re-read books (because there are so many others on my \"to-read\" list)! After reading this most engaging novel, I felt compelled to read all of Keyes' other books, most of which were wonderful as well. This one remains my favorite of hers, however. I think it is several steps above the chick-lit category. The story is both hysterically funny and extremely poignant. I loved getting to know the Walsh sisters and bits and pieces of their various stories, so I was delighted to learn that there were other books that had different Walsh sisters as the main character.I like how Anna's story is revealed a little bit at a time, and the intermittent flashbacks that help us learn about her relationship to Aiden. I fell in love with him right along with her and felt endeared to him throughout the story. I sobbed at the end--it was such a touching and satisfying conclusion. I enjoyed this book so much that I have given it as a gift to several of my friends. *Highly recommended!", "num_likes": 23, "sort_order": "default", "shelves": ["all-time-favorites"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/16505597", "review_id": "16505597", "date": "Feb 27, 2008", "rating": 4, "user_name": "Danielle", "user_url": "/user/show/682440-danielle", "text": "This was my first Marian Keyes book, so I haven't read the others about the Walsh sisters. I think I have a hard time getting into a lot of books, it usually takes the first 100 pages before I care about the book. Once I hit the turning point in the novel (around chapter 25) it was un-put-down-able. Seriously, I read the majority of the book on Sunday afternoon (about 300 pages).I enjoy Anna, there is a lot that I can relate to about her under the surface. She is a PR Account Executive, I've worked in the PR field (not on the account side) for about five years and the things she would complain about made me giggle because I could totally see it.Watching Anna remember February 16th was heartbreaking, watching her recovery would break my heart one minute and have me laughing out loud the next page. Definitely a good read, now I think I need to read Watermelon so I can experience more of the other Walsh sisters. Only Helen and Rachel were discussed a lot in Anybody Out There?", "num_likes": 14, "sort_order": "default", "shelves": ["for-the-ladies"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/21343573", "review_id": "21343573", "date": "Apr 30, 2008", "rating": 5, "user_name": "Krystal", "user_url": "/user/show/110181-krystal", "text": "I'm having a love affair with Keyes at the moment. Started with Lucy Sullivan gets married (loved it) hiccuped with Watermelon (not so much) then on to Rachel's holiday (rivaled Lucy's story) and now, this one. Anybody out there is Anna's story. Keyes was on point in this book, Anna was heartbreakingly familiar. When I realized where her story was heading I was a bit angry, as I was already in love with Anna and Andy as a couple...how could Keyes do this to me. It was the delicate way that Keyes wove Annas story that made me keep reading through my anger =) I love how in each of these story about this family, one sisters life story, or segment of their life, is explored, and then you kind of get updates in the following sisters story. It's a nice way for the stories to continue. I'm trying not to give too much away, mostly cause I know Laura has this marked as to read. There were many moments in the books where I just paused and was wowed by Keyes ability to turn a phrase, or make a moment so recognizable and emotional. One of my favorite quotes (cause I have felt this way before) is\"Funnily enough, I wasn't that keen on butterflies. It was a hard thing to admit because everyone loves butterflies and not liking them is akin to saying you don't like Michael Palin, or dolphins or strawberries. But to me, butterflies were slightly sneaky; all they were were moths in embroidered jackets. And, yes, moths were creepy and their flapping wings made a nasty papery sound-but at least they were honest; they were brown, they were dull, they were stupid (flying into flames at the drop of a hat). All in all, they hadn't much going for them but they didn't pretend to be anything other than what they were.\"its not really a pivotal quote, but I liked it ;)", "num_likes": 12, "sort_order": "default", "shelves": ["chicklit", "variousfemaleauthors"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/95498221", "review_id": "95498221", "date": "Mar 23, 2010", "rating": 1, "user_name": "notgettingenough ", "user_url": "/user/show/2658311-notgettingenough", "text": "Why I will never read this book. The verdict is in.As I wandered down to my local coffee shop the other morning, I couldn’t help noticing a little pile of books somebody had put on the footpath, part of a clearing up. A motley collection, if ever I saw one, was my professional assessment. Over the next couple of days the pile got smaller. Somebody took the book on ’Twenty-two ways to improve the feng shui of your lavatory.’ And ‘Things you can do with bonsai plants if you have a front loader.’ Even the Booker Prize winner went missing. Eventually all that was left was Marian Keyes Anybody Out There? Apparently not, Marian. Apparently not.", "num_likes": 11, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/6358603", "review_id": "6358603", "date": "Sep 17, 2007", "rating": 3, "user_name": "Jennifer", "user_url": "/user/show/388792-jennifer", "text": "I read the Marian Keyes novels completely out of order, having started with a copy of  Watermelon my mum leant me when I was home on break. As a result, I perhaps saw the Sullivan girls mature in a slightly different order than other people who read the books in \"order.\"Nevertheless, I was confused by this book, and one other,  Rachel's Holiday. From the initial character development I got on Anna and Rachel, I always felt that it would have made far more sense to send Anna to rehab. This book was even further for me. This isn't a bad book. The writing isn't bad, although the plot is a bit strange. My main complaint about this novel is that, for my money, except for a few small flashbacks that fill in the missing years between books, this novel has NOTHING to do with the Anna we meet in the other books. Pretty much all of the Anna, the pretty, somewhat diaphanous hippie we meet in the other books-- is explained away in a few pages, which sum up a whirlwind of her life and dismiss every other instance of her in the series. I felt discomfited by this fact, especially since I felt that the actions of the character in this novel were not in tune with those which would have been taken by the character I knew. All in all, I felt if Keyes felt she needed to write this book, it should have been written as a stand-alone; I didn't feel the plot was well-served by being compressed into a standing character structure that really did not allow for the interplay between the characters here. If nothing else, again, I feel this book would have been better \"delegated\" to Rachel. ", "num_likes": 9, "sort_order": "default", "shelves": ["british", "chicklit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/21033767", "review_id": "21033767", "date": "Apr 26, 2008", "rating": 5, "user_name": "Julie", "user_url": "/user/show/869060-julie", "text": "SPOILERS AHEAD - do not read if you plan to read this book!!I've had a sense of deja vu lately when I've been reading. One was with Remember Me? and the other one was with this great one by Marion Keyes. It's been ages since I read PS I Love You by Cecilia Ahern but I think the premise was similar - in this one, the main character has been seriously injured in a car crash that has killed her newlywed husband. She is in denial of this fact for the first third of the book but then comes to accept it and is in grim pursuit of trying to communicate with him, along with dealing with her friends sympathy and trying to keep her job at a cosmetics firm. I loved it - she's an Irish woman living in NYC and her family back in Dublin is hilarious, and the twist at the end of the book brings it to a satisfying conclusion. I don't think I've ever been let down by Marion Keyes. ", "num_likes": 9, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/26943642", "review_id": "26943642", "date": "Jul 11, 2008", "rating": 5, "user_name": "Jennifer", "user_url": "/user/show/1319319-jennifer", "text": "This was the first book by Marian Keyes that I've read, and it made me see why so many people like her! She does a great job of keeping you guessing what has happened to Anna throughout the first 200 or so pages, until its finally revealed how she got her injuries and what has happened to Aidan. Normally I might say that a book this long was a bit overdone and could've been cut back on, but I loved every page of it. I was crying by the ending. This book really pulled me into the story and made me feel for Anna so much. ", "num_likes": 9, "sort_order": "default", "shelves": ["favorites"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/42223440", "review_id": "42223440", "date": "Jan 07, 2009", "rating": 2, "user_name": "Brittany Bennett", "user_url": "/user/show/756850-brittany-bennett", "text": "Kind of a weepy girl book. I had a hard time being convinced that their relationship was so amazing and am pretty sure that had this been a real couple, it would have seemed so great simply because she'd only been with the guy for a year and half - fully still within the infatuation stage. But still - the feelings are there regardless of the reasons for them, and it didn't keep me from emphasizing with her entirely. I also felt like Keyes tried a little too hard to be cutesy, especially in the first part of the book when describing the woman's family. For example, I had enough of the \"Greatest Job in the World (TM)\" garbage by the end of the first chapter. She toned it down for the second half of the book, though, which made it much more bearable.Anyway, not a terrible read for the beach or a plane ride. But not winning any awards any time soon, either.", "num_likes": 7, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4024710263", "review_id": "4024710263", "date": "Nov 11, 2021", "rating": 2, "user_name": "Kayla Jefferson", "user_url": "/user/show/112600470-kayla-jefferson", "text": "This book gave me p.s. i love you vibes (without the letters). It started off with the feeling off Anna’s husband had either cheated or left her. We find out Anna and Aidan had been in a horrific car accident resulting in Aidan’s death. I found the emails to be unnecessary and didn’t fit with Anna and Aidan’s story. Seemed really dragged out with alot of things that could have really been cut out. Also what was with the emails are her mum and sister illiterate and really don’t know how to spell?", "num_likes": 6, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/71767677", "review_id": "71767677", "date": "Sep 19, 2009", "rating": 2, "user_name": "Alisha Marie", "user_url": "/user/show/1585205-alisha-marie", "text": "Anybody Out There was a book that started out really great. However, after a while, not only did it start to drag on, it also started to resemble a mess...a mildly intriguing mess, but a mess none the less. Now, I don't need much from a chick-lit to be happy, but in Anybody Out There, I just needed more.The Good: Part 1. Part 1 of Anybody Out There was the best out of the three parts in this book. The family dynamics, which was my favorite part of Anybody Out There, were more prominent in the first part and were only alluded to in the last two parts. Another good thing was the twist. I definitely did not see that coming, particularly because I thought this was going to be a breezy, easy, funny chick-lit. Definite points for the twist.The Okay: Part 3. Part 3, where everything was coming together, was not as good as Part 1, but way better than Part 2. Jacqui's side plot was funny enough that it kept me interested in Anybody Out There. As unplausible as it was, I was also mildly satisfied with the ending. Although, that could have been because I just wanted the book to be over.The Bad: Part 2. I don't know how something involving mediums could've been so flippin' boring. Part 2 just dragged on and on. Oh, and Helen's emails...also dragged on and on. I found Helen to be funny and interesting at first, but after those emails, I was so incredibly bored with her character. That side plot was just pointless. Another bad thing about Anybody Out There was the numerous side plots. You had the mediums, you had the husband turmoil, the job turmoil, the ex-girlfriend turmoil, and a couple more turmoils that I don't feel like elaborating on. This book just had way too much going on. Oh, and it also stopped being funny at one point. So, overall, I found Anybody Out There to be a dud. No laugh out loud moments, but a couple of chuckles at first. Then, there were no chuckles...no type of laughter. There was major eye-rolling, though. Utterly forgettable and more than a little boring, so I say skip it.", "num_likes": 6, "sort_order": "default", "shelves": ["read-2013", "books-i-own-that-i-ve-read", "chick-lit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1127484250", "review_id": "1127484250", "date": "Dec 09, 2014", "rating": 5, "user_name": "Nina", "user_url": "/user/show/26835369-nina", "text": "A really good holiday read, with more grit than I had expected. ", "num_likes": 6, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4144734751", "review_id": "4144734751", "date": "Jul 30, 2021", "rating": 4, "user_name": "Toria", "user_url": "/user/show/27369602-toria", "text": "This is the 6th book I've read by Marian Keyes and my ratings have been all over the place, from 2 stars to 4 stars. But this is by far my favorite. This had so much to the story and was such an readable story. While it was a long book it didn't take much time to flew through.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1680138", "review_id": "1680138", "date": "Jun 05, 2007", "rating": 1, "user_name": "Zen Cho", "user_url": "/user/show/113127-zen-cho", "text": "This wasn't quite as bad as I thought it would be, but it was not the kind of book I would ever have picked up on my own. This is because it is pretty bad. It's not that I dislike chicklit as a genre so much as that it is not a genre I will forgive occasional badness in so long as it presses my buttons, and this was just all sloppy writing and uninteresting characters. Characters is kinda overstating it; they were more names plus associated collections of tics.But as I said, it was not as bad as I thought it would be. I liked the descriptions of the main character's wacky outfits.This book has a surprisingly perky cover for a book about death.", "num_likes": 5, "sort_order": "default", "shelves": ["chicklit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/150379732", "review_id": "150379732", "date": "Feb 24, 2011", "rating": 5, "user_name": "Hildy", "user_url": "/user/show/5033175-hildy", "text": "first read: February 2011second read: December 2016This is one of my favourite books. It is rare that I read about a couple that is so obviously perfect for each other and so intensely in love. I miss that. This book is quirky, laugh out loud funny, and so emotional. Keyes nailed every part of this. It was long but I still wish that there was more to read.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3533641132", "review_id": "3533641132", "date": "Sep 12, 2020", "rating": 1, "user_name": "Julie", "user_url": "/user/show/110510311-julie", "text": "Oh dear, think I switched off at the point where she said his jumper didn't smell like his groin did 🙄😂Think this was meant to have been moving but it certainly wasn't for me.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3757467348", "review_id": "3757467348", "date": "May 03, 2021", "rating": 3, "user_name": "Mela", "user_url": "/user/show/41757430-mela", "text": "Definitely the worst of Marian Keyes that I have read so far (six). Not a bad book, just out of tune with me.In the beginning, I was gripped. I hadn't any idea about a plot, so when I understood what 'event' was the core of the story I was really sad (and even more hopeful about the book). I remember how phenomenal was On Second Thought by Kristan Higgins (it is one of my favourite novels).But it started to drag. I was so not interested in Anna's professional life. Then, there was Helen - what for was she so big part of the book? And Anna's struggles with grief eventually started to annoy me.There were quite a few precious moments. E.g. the funny scenes with Walsh's family, and some wiser ones. But too little as for six hundred pages.I was weeping for Aiden at one point, and now I am (metaphorically) weeping for this Keyes' novel (I am still her big fan).[2-2.5 stars, rounding up thanks to male characters, like Aiden, Matt, Angelo, Leon, Joey]", "num_likes": 3, "sort_order": "default", "shelves": ["contemporary-fiction", "series", "contemporary-romance", "british-literature", "zz-marian-keyes", "humor"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4097069173", "review_id": "4097069173", "date": "Jul 09, 2021", "rating": 5, "user_name": "Lauren Johnston", "user_url": "/user/show/34121511-lauren-johnston", "text": "This was such an emotional read.. absolutely loved it and couldn’t put it down. Another brilliant read from Marian Keyes! ", "num_likes": 3, "sort_order": "default", "shelves": ["read-in-2021"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4354417213", "review_id": "4354417213", "date": "Nov 30, 2021", "rating": 4, "user_name": "Siobhan", "user_url": "/user/show/52492774-siobhan", "text": "I think I'm calling it, this is my favourite of the Walsh sister stories. (still one left to read, but Helen is my least fave sister (no one says \"warcrime\" that many times. No one.) so her story is going to have to be amazing to top Anna's).", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/39468027", "review_id": "39468027", "date": "Dec 06, 2008", "rating": 4, "user_name": "Jen", "user_url": "/user/show/236648-jen", "text": "I love the various Marian Keyes books, especially the ones featuring the individual sisters from the Irish family, the Walshes. Her books are almost standard chick-lit fare, but Keyes's writing and her doses of Irish wickedness make them stand above the crowd.This book features the fourth Walsh sister, Anna. We've met Anna in the other Walsh sister books, where she's something of a spacey, hippie-ish waif, but here she's been transformed into a savvy New York business woman--a bit of a stretch, I thought, but, hey, I was glad Anna seemed to have pulled herself together. All the other books deal with some type of major upheaval in the heroines' lives, but Anna gets nailed the worst, I think. This one still had funny moments, but really, it was a pretty heavy read. ", "num_likes": 3, "sort_order": "default", "shelves": ["rough-read", "irish", "fiction", "made-me-cry", "chick-lit", "love-hurts"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3295076748", "review_id": "3295076748", "date": "Oct 28, 2020", "rating": 1, "user_name": "Mo", "user_url": "/user/show/75006997-mo", "text": "Awfully cliche book, but I'm only reading it for the language anyways, and it helps to be able to predict everything that happens. 🙄", "num_likes": 3, "sort_order": "default", "shelves": ["danish", "2020"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3228315647", "review_id": "3228315647", "date": "Mar 12, 2020", "rating": 4, "user_name": "LindyLouMac", "user_url": "/user/show/117720-lindyloumac", "text": "Update to post with My Review: March 19th, 2020For the second time recently, I have chosen to read a novel, that is part of a series, without realising until after I had finished! The first one in the Walsh family series was 'Water Melon' which I read in 1996, cannot recall the content now, neither have I read any of the others. Honestly, I do not feel this matters as it stands alone perfectly. A sad read but Marian Keyes has lifted the story with a lot of humour, so expect tears and laughs. Do not be put off by the nearly 600 pages as it is a very quick read, that will take you out of yourself. Something we all need in these difficult times. Pre Read Notes: March 12th, 2020I am going to start this today; I don't think I read the earlier ones in the Walsh family series so hope it doesn't matter?My intention had been to start Grown Ups but finding this sitting on my TBR shelf, thought I should read this older title first! Originally published in 2006 and republished in 2012, this period was when I was living in Italy and did not get to read any books written by Marian Keyes. In fact, I rediscovered her work in 2017 when I read 'The Break' and reviewed on LindyLouMac's Book Reviews, prior to this I have not read any novels by her since 2001. https://lindyloumacbookreviews.blogsp...#bookreviews #authors #MarianKeyes", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1896519321", "review_id": "1896519321", "date": "Feb 08, 2018", "rating": 5, "user_name": "Lyndall Rae", "user_url": "/user/show/63640443-lyndall-rae", "text": "This is literally the first book to ever make me cry. Another winner by Marian Keyes. 👏🏼", "num_likes": 2, "sort_order": "default", "shelves": ["books-i-own"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3639301854", "review_id": "3639301854", "date": "Nov 11, 2020", "rating": 2, "user_name": "Margo", "user_url": "/user/show/59279155-margo", "text": "This one was too melancholy for me, and the h didn't appeal to me.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/26555457", "review_id": "26555457", "date": "Jul 07, 2008", "rating": 4, "user_name": "Julie", "user_url": "/user/show/1304553-julie", "text": "This is a story about one of the Walsh sisters. There are five sisters in this Irish family that Marian Keyes has written several books about. This one is about Anna. It begins with her in in Ireland at her parents' home, although we find out early that she lives in New York and is here recovering. We also know that she misses Aidan very much and that she feels she must recover from her injuries quickly so that she can get back to New York to find him. What we do not know is what happened to her or where Aidan has gone. Her family does not want her to go back and tries to protect her from whatever is waiting for her there. Anna has to face the past in order to move on though. The story is told in flashbacks and is touching and funny. The Walsh family had me laughing out loud, while the Anna's story had me in tears. I highly recommend this title as I enjoyed it very much. If you like this book, try Keyes' other novels about the Walsh's.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/79965672", "review_id": "79965672", "date": "Dec 05, 2009", "rating": 5, "user_name": "Amanda Patterson", "user_url": "/user/show/3010986-amanda-patterson", "text": "Anna Walsh sits and convalesces at her family home in Ireland, thinking obsessively of her husband, Aidan, and their life in New York. Why, you wonder, does she not just call him? Anna is surrounded in true Keyes fashion by a nutty mother, and an assortment of eccentric sisters. Keyes is on top form in this novel and Anybody Out There? is up there with the best she’s ever written. Like her character, Anna Walsh, one has the sense that Marian Keyes also had to grow up eventually and deal with some hard truths.If you’ve dealt with the cocktail of loss and love and family, read Anybody Out There?", "num_likes": 2, "sort_order": "default", "shelves": ["books-i-remember"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2229523606", "review_id": "2229523606", "date": "Dec 28, 2017", "rating": 2, "user_name": "DebKiwi", "user_url": "/user/show/74813059-debkiwi", "text": "Marian Keyes just doesn't have the \"cool\" factor as an author. This story would have been ok had it been condensed onto 1/3 of the pages and really what were those hideous emails from her ridiculous mother about.. they didn't add to the story at all.A really dumb read.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1579188", "review_id": "1579188", "date": "Jun 01, 2007", "rating": 1, "user_name": "Aida Ramos", "user_url": "/user/show/69972-aida-ramos", "text": "As much as it pains me to say this... It´s sooo bad! She tries something halfway between funny and tragic, and manages to do neither, which is sad. ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4207549524", "review_id": "4207549524", "date": "Aug 29, 2021", "rating": 4, "user_name": "Alison", "user_url": "/user/show/9010166-alison", "text": "Three and a half stars.Anna Walsh is recovering at her parents' home in Ireland, but is desperate to return to New York, her job working for promoting a kooky cosmetics brand, and her husband Aidan who hasn't responded to her calls or emails.Since this book is 15 years old, I think it is safe to say that the twist is Aidan and Anna were in an horrific accident and Aidan is dead. TBH I got that vibe pretty early on anyway, and if you have read Rachel's Holiday you would be expecting some sort of twist anyway.There are plot twists, mad Irish shenanigans, fabulous gay neighbours, evil bosses and numerous sub-plots. Despite the long period since publication the book stands up pretty well and is full of that quirky Marian Keyes writing style.", "num_likes": 0, "sort_order": "default", "shelves": ["interfering-friends", "irish", "womens-fiction", "count-the-cliches", "secret-baby", "2021-read", "detective", "irritating-seniors", "read-anything-by-this-author", "insta-love"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2874456233", "review_id": "2874456233", "date": "Jun 27, 2019", "rating": 4, "user_name": "Melinda Elizabeth", "user_url": "/user/show/3101703-melinda-elizabeth", "text": "whoops I did it again, read a book half way through a series I didn't know existed... but the best part is that you definitely didn't need any prior knowledge of the Walsh family to enjoy this one! Anna is in Dublin recuperating. We are given details sparingly about what is wrong with her and how it happened, and we aren't too sure what is going on with her husband Aidan. Is she stalking him? Are they talking? Why is he ignoring her when she gets back to New York? Split into three parts, Anybody Out There has very distinct parts that make the book easy to read and keeps you interested in the story. There's some great comedic moments throughout and a nice love story at its heart. If you have read the others in the series I'm sure this one fits right in, if not then it's also fine to read by itself.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2287744547", "review_id": "2287744547", "date": "Feb 07, 2018", "rating": 3, "user_name": "Colleen", "user_url": "/user/show/1661766-colleen", "text": "One of the reviewers of this book said she classifies books into either literature or crap. I would probably call the second category \"fluff\" instead. The reviewer also mentions there are levels within the categories. So true. This book is \"fluff\" but it has some good messages about the difficulty of the grieving process. For about a third of the book, we don't know why Anna Walsh has been injured or why her husband doesn't seem to be responding to her. We experience her crazy family and friends throughout; they are all a bit over the top. Anna goes over the top a few times as well. The author could probably have cut out about 100 pages and still told the story. But, with that said, I may read more of Marian Keyes \"fluff\" especially in the Walsh family series. Her \"fluff\" provides some relief from more serious books/literature. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2107623426", "review_id": "2107623426", "date": "Sep 02, 2017", "rating": 4, "user_name": "Jane Long", "user_url": "/user/show/38455117-jane-long", "text": "I enjoyed this book as I do with most of Marian Keyes' books. I agree though with my daughter Samantha, who read this book first and said she enjoyed it, but the story was a bit depressing. (Even Marian Keyes agreed!) I felt I knew the characters fairly well as they have been in a few of the books I have read by the same author. The family is quite big and lots of different things are going on all the time.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3000569767", "review_id": "3000569767", "date": "Oct 06, 2019", "rating": 4, "user_name": "Victoria", "user_url": "/user/show/49721745-victoria", "text": "This was poignant and bittersweet The second to youngest Walsh girl Anna has always been a free spirit, going her own way. In this story we meet her in a very different way. Struggling to cope with the loss of her husband after a car accident. She is not coming to terms with her grief at first, and Keyes is masterful at allowing the story to unfold, allowing us to see Anna work through all the stages of her grief. very well written ", "num_likes": 0, "sort_order": "default", "shelves": ["2019-reading-challenge"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3220466081", "review_id": "3220466081", "date": "Mar 06, 2020", "rating": 5, "user_name": "Ilene Harris", "user_url": "/user/show/6990633-ilene-harris", "text": "“Anybody Out There?” Life is perfect for Anna Walsh. She has the perfect job in the Big Apple along with a great apartment and the best friends. What could go wrong? Everything! She wakes up one morning in her parent’s house in Dublin, Ireland with stitches on her face, a broken arm and a dislocated knee, and no memory of what happened to her. A great mystery along with the best family relationships book and excellent writing.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1980128549", "review_id": "1980128549", "date": "Apr 23, 2017", "rating": 3, "user_name": "Oriyah Nitkin", "user_url": "/user/show/7225272-oriyah-nitkin", "text": "This was a fun book that read like a movie. Nice plot, though I felt that certain revelations would have been better later on in the book, and it left me hanging a little more than I would have liked. Fun, quick, good - (even.) And then it was done and mostly unremarkable. But good while it lasted.", "num_likes": 0, "sort_order": "default", "shelves": ["fiction"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2875989460", "review_id": "2875989460", "date": "Jun 29, 2019", "rating": 3, "user_name": "Denise", "user_url": "/user/show/4877957-denise", "text": "Marian Keyes is one of those authors who is so ridiculously popular that I suppose it was only a matter of time until I finally gave in and gave one of her books a try, never mind that I don't care for the genre much. This was... fine, I guess. I enjoyed the writing, but I'd have been fine with the book being half as long - after a while, I just got tired of all the silly obnoxious people being silly and obnoxious.", "num_likes": 0, "sort_order": "default", "shelves": ["read-2019"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4146449102", "review_id": "4146449102", "date": "Jul 31, 2021", "rating": 2, "user_name": "The Library Lady", "user_url": "/user/show/288297-the-library-lady", "text": "Anna Walsh has always been the quiet space cadet amidst the Walsh family tummult. So her transformation here into a go-get-em PR flack for a makeup company, her aggressive confidence, is less than believable. And then there's her personal life, and since I don't want to offer spoilers, let's just say that she is in denial, that her methods for coping are over the top ridiculous, and that the plot resolution includes a hokey twist and a New Agey bit that rattled my saccharine meter AND made me want to throw the book across the room.( Luckily I remembered that I was reading it on Kindle, and didn't actually throw my phone!)The idea of reading book #5 reminds me of driving by an accident, and not wanting to look but feeling compelled to look. So I will remind myself that Keyes is capable of some really good chick-lit, and I will read that one as well.", "num_likes": 0, "sort_order": "default", "shelves": ["adult-fiction", "series-running-out-of-gas"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1957781377", "review_id": "1957781377", "date": "Apr 14, 2017", "rating": 4, "user_name": "Karen", "user_url": "/user/show/17161285-karen", "text": "Interesting family!! Plenty of funny , serious, sad and enjoyable times. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3127537040", "review_id": "3127537040", "date": "Jan 06, 2020", "rating": 5, "user_name": "ShannonCC", "user_url": "/user/show/3061765-shannoncc", "text": "I really liked this one. At one point I did go on Goodreads to find spoilers because I just had to know a bit about the ending before I decided if I was going to keep reading. But it's not anything bad about the book, it's more that I was looking for light, happy reading and this is *not* that. It did seem to me like it was two separate books though. The first third was very different from the last two thirds. But the story is really good. Just be ready for lots of sad.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3164355311", "review_id": "3164355311", "date": "Jan 29, 2020", "rating": 3, "user_name": "Margaret", "user_url": "/user/show/64499884-margaret", "text": "I was surprised to find I enjoyed this book, plenty of humour and some moving sections. The last page was too gooey and soppy for me, though, it spoiled an otherwise entertaining read. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3280063129", "review_id": "3280063129", "date": "Apr 14, 2020", "rating": 3, "user_name": "Magdalena", "user_url": "/user/show/41468548-magdalena", "text": "Funny!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3300217929", "review_id": "3300217929", "date": "Apr 25, 2020", "rating": 5, "user_name": "Sue", "user_url": "/user/show/108184430-sue", "text": "Another brilliant story about the Walsh family, this time Anna. So easy to read, funny, moving and relatable. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3112172474", "review_id": "3112172474", "date": "Dec 31, 2019", "rating": 5, "user_name": "Sarah McCallan", "user_url": "/user/show/28621932-sarah-mccallan", "text": "Not sure why I’ve never really read Marion Keyes much or ever (can’t remember). Loved this and read it in one big gulp.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3325103387", "review_id": "3325103387", "date": "May 08, 2020", "rating": 5, "user_name": "Shauneen", "user_url": "/user/show/83252337-shauneen", "text": "This book fuelled my love for Keyes! I remember balling my eyes out crying and honestly feeling the loss that this character was experiencing whole heartedly. I never expected the twists. So beautifully written! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3292110510", "review_id": "3292110510", "date": "Apr 25, 2020", "rating": 4, "user_name": "Courtney d", "user_url": "/user/show/75490750-courtney-d", "text": "The book brings out so many emotions through the loss Anna has endured. It has made me realise life is too short and to live everyday to the fullest. “Anna’s officially a wreck” I am officially a wreck, I cried one too many times reading this book, I can’t wait to read the rest of the Walsh family’s adventures. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/191941590", "review_id": "191941590", "date": "Jul 29, 2011", "rating": 5, "user_name": "gille", "user_url": "/user/show/5871480-gille", "text": "This is my favorite of all the Walsh sisters books. I love Anna, she is my favorite sister, and I was so moved by her story. Having read this one first sort of ruined the others, although I loved them too, as I knew what would happen in the end for each sister in her relationships. This was a heartbreaking tale, filled with laughter and tears (A LOT of tears!) and HUGE twists and turns that are hardly expected. Although everyone reading the series should start with Watermelon, then read Rachel's Holiday, then Angels, and finally Anybody Out There?, you should start TODAY so you can get to this one ASAP.Anna is the fourth sister in the Walsh family. She has three older sisters: Claire (Watermelon), Maggie (Angels), and Rachel (Rachel's Holiday), as well as a younger sister, Helen. Anna is the flaky sister, she did a lot of drugs when she was in her teens and twenties, but stopped when Rachel went to rehab. She is known for wearing fringy skirts, going out for milk and coming home months later, and generally being a free-spirited, if not naive, young woman. At the start of Anybody Out There?, Anna wakes up in Dublin, in her parents home, bruised and broken, and seemingly having no idea how it happened. The last thing she knew, she was in New York, working for a cosmetics company. Then everything changes.This book was heavy and sad. It has very funny parts, and the language used by Anna and her friend is hilarious. Like other books I've reviewed, I read other reviews and found them to be misguided. The change in Anna happens in Rachel's Holiday, and continues in Angels. She grows up. She gets a job. She starts on the right path. That has already been built for us in previous stories. Rachel's rehab gets Anna on the straight and narrow. There were also criticisms of Anna and Aiden as a couple, and their lovey-ness being a symptom of their relationship being relatively new. I disagree with this - sometimes people meet, they fall in love, and they remain absolutely enamored with each other for the duration of their lives. It is not out of the question, and it's something that every woman dreams about. Just because this fictional character has it, doesn't mean it's to be disparaged.. Otherwise, this book really piqued my interest in the Walsh family. I found them fun and funny, and I wanted to know more. Each woman grows differently. She makes choices, she lives both with the consequences and through them. Each heroine is likable, each is unique, and you want to know more about them. My heart broke for Anna, and although you KNEW there would be twists, I did not find them to be at all predictable - and I am usually VERY good at predicting the twists and outcomes of books. Finally, the blurb on the book talks about amnesia, of which there is NONE. Anna may not remember what happened, but it's more likely that she knows and has blocked it out. I actually had this book on my shelf for at least a year, and did not read it because I'm pretty tired of amnesia stories. This phrase is not a reason to skip this book as I did for so long!!Anna's story is TRULY one of despair and of hope. I can't wait to read Helen's story, and I'm waiting for Marian Keyes to write about Mammy Walsh, too!!!I highly recommend this book, but only AFTER the three others in the series have been read!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1945262037", "review_id": "1945262037", "date": "Mar 22, 2017", "rating": 4, "user_name": "Raine", "user_url": "/user/show/4035975-raine", "text": "ANYBODY OUT THERE? is quite the mixture of humor and sadness. Part One is where we meet Anna, who has been injured and is spending time recuperating in her parents home in Ireland. She lives in NYC with her husband Aiden, who is missing. Maybe I'm not used to reading these types of books, but we find out where Aiden is at the beginning of part two, and I was shocked - I had a totally different take on where he could be.Anna eventually goes back to NYC to resume her career as a PR Exec for Candy Grrrl, a popular make up line. We meet her quirky friends and sister Rachel (Anna has 4 sisters and this book is #4 in the series where they each get a feature story). Emails go back and forth between Anna and her Mum and sister Helen in Ireland.While I did laugh at many of the lines in this book, it also address one of the hardest things that can happen in a woman's life. It is done beautifully if not a little corny toward the end. The book is a little long and I think it could have done without the Janie and Jack factor, but it held my attention and I will be checking out some of the other books in the series so I can meet the other sisters in-depth! ", "num_likes": 0, "sort_order": "default", "shelves": ["abandonment", "other-countries", "marriage", "mothers-and-daughters", "pbr-tags", "women", "x-75-books-in-2017", "goal-75-books-in-2017-read", "love", "ireland"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2543388050", "review_id": "2543388050", "date": "Jan 09, 2022", "rating": 2, "user_name": "Micah", "user_url": "/user/show/61011682-micah", "text": "DNF - too much waffle", "num_likes": 0, "sort_order": "default", "shelves": ["on-kindle", "part-of-a-series", "on-my-bookshelf"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4404944289", "review_id": "4404944289", "date": "Dec 22, 2021", "rating": 3, "user_name": "Zar", "user_url": "/user/show/64351708-zar", "text": "I really like Marian Keyes books so I had a nice time reading this. It wasn't my favourite, it was quite sad and at times slightly slower paced or strange, but on the whole it was just fine. ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/323925575", "review_id": "323925575", "date": "May 04, 2012", "rating": 5, "user_name": "Sammi", "user_url": "/user/show/9275398-sammi", "text": "Along with 'Rachel's Holiday' this is probably my favourite Marian Keyes book. What I love about her books is that she doesn't write 'typical' chick-lit. I generally hate chick-lit (well, apart from Sophie Kinsella's books) but Marian Keyes always manages to add a difficult subject (drug addiction, domestic abuse, rape) and deal with it sensitively and intelligently while also being hilarious.Anybody Out There? tells the story of one of the younger Walsh siblings (we've met them before in Watermelon, Rachel's Holiday and Angels), Anna. I always particularly love the stories about the Walshes as you really get to know them throughout the series and the characters feel so real to me (I know that sounds a trite thing to say but they remind me of my mum's family!).When we've come across Anna in the earlier novels about her older sisters she's a bit of an f-up, but in Anybody Out There? we find that she's pulled herself together and is married and living in New York where she has The Best Job in the World. At the start of the book though she's back in Ireland recovering from a horrible accident in her parent's best living room and desperately trying to get in touch with her husband who won't return her calls. Although you'll probably figure out what's coming before it's revealed, there is one twist that will come as a shock, and knowing what's coming doesn't make it any less emotional when Anna finally begins to come to terms with what's happened. I don't want to give too much away here, but suffice to say you'll probably fall in love with Aiden along with Anna (the story of how they met and married is told throughout the book in flashback form) and find yourself a little bit heartbroken as well. A really brilliant book that I strongly recommend to everyone, even if they don't normally go for chick-lit. Oh, and one more thing. Although the book is part of a series of books about the Walsh sisters it doesn't matter if you haven't read the others, but once you've read this one you're bound to want to!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/136740743", "review_id": "136740743", "date": "Dec 27, 2010", "rating": 2, "user_name": "Tori Hoeschler", "user_url": "/user/show/595700-tori-hoeschler", "text": "Sad at Best, Tedious and Boring at WorstFirst of all, I started this book without realizing that it is actually the 4th in a series involving these Walsh sisters. This always annoys me and although I don’t think this was a situation where I missed something by not reading the first three, it did deter from my overall reading enjoyment. Now, I very much went into this book with eyes wide open; I assumed it was chick lit-y and as such, was not expecting to be bowled over with literary magnificence. But even so, with managed expectations, this story was really grating on my nerves and although there were definitely times when I was choked up and my stomach was in knots, there were MORE times when I was like “OH MY GOD WAKE UP AND GET ON WITH IT!” Now, there are several points when the story takes an unforeseen turn and I’d be lying if I said those points didn’t really hold my interest (ie, when she figures out what happens to her husband, secret part to husband’s life is revealed, etc.) But these story benders are few and far between and you have to trudge through pages and pages of trite dialogue and predictable narrative to get to them which, like I said, did a number on my nerves. In any case, if you’ve read the first three by this author and liked them, then have at this book. You’ll like it. But if you’re just perusing for some light reading, find something else. This is book is very forgettable. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1788967167", "review_id": "1788967167", "date": "Oct 19, 2016", "rating": 1, "user_name": "Susan Liston", "user_url": "/user/show/630381-susan-liston", "text": "I do not read chick-lit. Why did I find this lurking in my enormous under-the-kitchen-table pile? I think I must have bought it because I read some essays by Marian Keyes and found them amusing. (I had no idea until just now, reading other reviews, that this was one of a series) I found the story intriguing at first, our heroine Anna is recuperating at her parent's house from some nasty injuries. What happened to her, and why has her boyfriend, actually husband, seemingly abandoned her? Well, if you have more than one functioning brain cell you have figured that part out looooooong before the big \"twist\" at well over a hundred pages in. (it was soon after that I made a bet with myself as to what would happen on the last page) I read on and on but encountered nothing of much interest and a lot of repetition. Finally I realized that although this book should have ended long ago, it still had 150 pages left. What? I gave up and read the last page. I WAS RIGHT. Oh barf. (I would gloat, but as this is not the first book I've ever read, and I am over 12, my guess was not that great a feat.) Then I went back and dutifully skimmed over the unread portion, to see if I missed anything. Oh, the dog pooper plot, I had forgotten about that.. I didn't realize I was supposed to be wondering about it, because I hadn't been. Oh NO, what? Another little \"twist\"? And how convenient, and how ridiculous. I am SO sure. A good reminder of why I do NOT read this stuff. ", "num_likes": 0, "sort_order": "default", "shelves": ["read-2016"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/18302651", "review_id": "18302651", "date": "Mar 21, 2008", "rating": 3, "user_name": "Jenn", "user_url": "/user/show/899674-jenn", "text": "Penguin's advertising blitz last year for Marian Keyes books paid off. I have had an inexplicable urge to read one for ages. Well, not entirely inexplicable, as 6 feet tall posters plastered all over the Tube come to mind. But I still don't think I would have found the initiative to procure one so I am lucky May brought this to dinner and put it in front of me. This was surprisingly sad for chicklit! Especially one with butterflies all over the cover (altho the butterflies now make sense). Totally worthwhile read for the \"feathery stroker\" concept alone:\"He kept stroking me, in this awful feathery way, like he'd read a book about how to give women what they want. Bloody Feathery Stroker. I wanted to rip my skin off.\"And so the phrase came about. It suggested an effeminate quality which instantly stripped a man of all sex appeal. It was a damning way to be categorized. Far better, in Jacqui's opinion, to be a drunken wife-beater in a dirty vest than a Feathery Stroker.The Feathery Stroker rules had complex variantions and sub-sections: men who gave up their seat on the subway were Feathery Strokers - if they smiled at you. But if they grunted, \"Seat,\" in a macho, no-eye-contact way, they were in the clear.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/101253892", "review_id": "101253892", "date": "May 04, 2010", "rating": 2, "user_name": "Cosine", "user_url": "/user/show/2605688-cosine", "text": "It was so bad, I couldn't wait to put it down. I tried my best to like it but after reading 400 pages, I gave up and just went to the back and read the ending. In the end, I just find this book such a waste of my time. I so wanted to like it, especially since it was a 21st birthday gift from my friends and its a pity I don't.I can relate to the denial during the initial chapters but I honestly cannot tolerate those ridiculous e-mails, especially those with Helen (youngest sister) and her mother. The novel keeps banking on the stereotype of pretty girls = stupid girls. Almost every single pretty girl in the novel is pea-brained or something. The entire family seems to be made up of totally nonsensical women from the acting-young-marriage-hating-divorcee-eldest-sister to the so-old-but-still-so-childish-mother and exciting-life-wannabee-younger-sister. It was so hard to swallow that much personality and that much drama! And come on, what's with all the crotch staring between the protagonist and her sister's, Rachel, fiancee? Major exaggeration.The only saving grace of the book is love between Anna and her guy. And even that can be super cheesy in certain parts of the novel as well.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1668256598", "review_id": "1668256598", "date": "Jun 14, 2016", "rating": 5, "user_name": "Stephanie Ince", "user_url": "/user/show/54200149-stephanie-ince", "text": "Read this book in less than a week so verrrry happy considering it's a near good 500 pages. I seriously couldn't put this book down! Even when I had to put it down I was constantly thinking about reading it or making up in my head what was going to happen. I'm so glad I read this book. I got this book and tbh kind of forgot about it. Put it to the back of my bookcase and read others. But I didn't have much left to read so I thought I would give it a go. What I love about this book is it made me feel all different emotions. I felt sad, angry, upset, happy all in one and that's what I love about a book how it can make you feel all mixed emotions. I won't say too many spoilers because the main part of the book is not what you expect and I must admit my jaw dropped when I was reading this. I loved all the characters in the book I especially loved Jacqui and her great sense of humour and sarcasm. I realised that this is a series which tells the story of all the Welsh sisters but I don't think you have to read them in a particular order which was good for me because I would have had to read the others before this. I would recommend this to anyone. Now I've read this it's definitely opened up my eyes to Marian Keyes and her books.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/30263308", "review_id": "30263308", "date": "Aug 15, 2008", "rating": 5, "user_name": "Norabee", "user_url": "/user/show/1430355-norabee", "text": "It’s Anna’s Turn in the Spotlight!!Marian Keyes is a powerhouse – to me, she's a combination of Maeve Binchy mixed with a little Sophie Kinsella but clearly a phenomenal talent in her own right. I think I enjoyed this Walsh sister book better than the others (while, like everyone else, patiently waiting for Helen’s book) it was funny, sad, long, but in a good way – there was no skimming or counting pages with this read – enjoyable, I’m glad I saved it because there are not many books as good as the ones that Keyes pens and I’m so glad she recognized her talent and is doing what she’s supposed to be doing in this life – Well Done – Bravo, yet again to Marian Keyes!In this tale, Anna is in her early thirties, married and a victim of a tragic car accident. The story opens with her convalescing at her parents’ home in Ireland. There have been many reviews of this book and I don’t want to spoil it, so I won’t go into too many details – if you read the product description and other review, then you already know what the book is basically about. There is an interesting twist mid-way into the book that will keep you reading. This was a really good read – highly recommended!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1604953146", "review_id": "1604953146", "date": "Apr 08, 2016", "rating": 3, "user_name": "Anna at A Wondrous Bookshelf", "user_url": "/user/show/8520038-anna-at-a-wondrous-bookshelf", "text": "Anna Walsh is the youngest of four sisters in the Walsh Irish family. The book starts with Anna having survived a freakish car accident and recovering back home in Ireland in her parents’ house. When Anna finally heals, she is ready to move back to her real life in New York City, to her “best job in the world” job, and to her loving husband, Aidan. Most of the story is told through flashbacks of Anna’s memories, and when Aidan disappears Anna sets out to find him by consulting fortune-tellers, horoscopes, and psychics in an attempt to contact Aidan.I friend of mine gave me this book to read at work one day. Well, unbeknownst to me this is book number four in a series. In all fairness, this is not really a continuation of the previous stories, so it can easily stand alone. I liked the way Keyes wrote this story, the book is quite sad a times and I would’ve appreciated her characters more had I read the previous novels, but overall I really liked this book. This novel has an interesting view on grieveing and how some people cope with it. I didn’t love it, but I really enjoyed reading it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/14620543", "review_id": "14620543", "date": "Feb 05, 2008", "rating": 4, "user_name": "Nikki", "user_url": "/user/show/843576-nikki", "text": "As with all Marian Keyes books this one was excellent. Continuing to follow in the lives of the Walsh sisters this book focused on Anna. She wasn't as hippy as I expected given how she was described in the other books, but I was glad as she was fleshed out as a very likable (and believable) character. This book is hard to put down as Keyes keeps you on edge trying to figure out what is going on. All you know is that Anna finds herself back in Dublin with her parents with some pretty severe injuries that she acquired while living in New York with her hubby, with no memory of what happened to her. Keyes holds out until about the middle of the book before Anna remembers what happened to her. Let me tell you - this book will make you laugh, and it will also make you cry buckets. It definitely makes you sit back and take stock of your life and everyone special to you. I would recommend it, but I would also recommend that you also read Watermelon, Angels, and Rachel's Holiday so that you can see the perspective of the other Walsh sisters too. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/91013153", "review_id": "91013153", "date": "Feb 23, 2010", "rating": 3, "user_name": "Lisa", "user_url": "/user/show/1512868-lisa", "text": "I'm not a huge fan of chick-lit, so was quite surprised at being recommended this, with further surprise to follow when I actually found myself enjoying it - giggling at Anna's family and her turns of phrase, and wondering how on earth she'd got in the state she was in on the lead in to the reveal (about a quarter of the book through).This initial set up was very nicely done, even if I did have a sneaking suspicion about what had happened (though I think that might have had something to do with half remembering a bit of a spoiler, rather than the writing). Once that part was through things did start to get a little predictable, but the charm with which it was written paid off and had me still wanting to read on.Alternating between funny and moving (and sometimes both at the same time), although not brilliant this wasn't the horror that I had expected it to be and had me hugging my boyfriend extra close afterwards, and I certainly wouldn't have quite the same reaction to reading another chick lit that I've indulged in previously (lots of eye rolling and sick noises!)", "num_likes": 0, "sort_order": "default", "shelves": ["2010", "romance", "comedy", "sobfest"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/174637106", "review_id": "174637106", "date": "Jun 07, 2011", "rating": 3, "user_name": "Kimberly", "user_url": "/user/show/737986-kimberly", "text": "This is the first Marian Keyes book I've read. I'm not sure if I would have ever picked up any of her books, perhaps in the course of browsing the shelves at the library, I might have. This one was \"assigned\" to me as part of my library's book discussion group.Overall, I liked the story, but there were quite a few things I could have done without. I didn't know why Anna's mother and sisters were so obsessed with the make-up she got from her PR job. And really, I didn't much care for the whole crazy make-up/wardrobe descriptions in regards to Anna's job, either. I didn't like the paranormal/psychic/spiritualist/other-wordly aspect of this book. I understand that when people experience the loss of someone close, they wish they could have a way of communicating with their dearly departed, but I just thought those parts of the book were stupid. I'd have to say, however, that my least favorite parts were the emails from Anna's sister, Helen, describing her private investigation job spying on \"Mr. Big's\" wife. Ugh!", "num_likes": 0, "sort_order": "default", "shelves": ["chick-lit", "library-book-discussion-group"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/756178465", "review_id": "756178465", "date": "Nov 03, 2013", "rating": 3, "user_name": "Kate Forsyth", "user_url": "/user/show/3237560-kate-forsyth", "text": "I have never read any of Marian Keyes’ books before and bought one on the very strong recommendation of a friend. She said that they were the sort of books that make you laugh and make you cry, and really, what more could you want from any book? ‘Anybody Out There’ is certainly an engaging mixture of humour and pathos and gave me a lump in the throat more than once. It tells the story of Anna Walsh, who has been in some kind of terrible accident, and is recuperating on her parents’ couch in Dublin. But Anna is desperate to speak to a man named Aiden and so returns to New York to find him. There’s a vast cast of eccentric characters, some odd and some funny moments, and a dark and serious streak I was not expecting. Marian Keyes is not afraid to grapple with themes of grief, depression, loneliness, and pain, even as she mocks the shallowness of the beauty industry and throws in some slapstick humour. The warmth and wit of her heroine, Anna, keeps the story from jangling too wildly. This is chick-lit with heart and an acute social conscience.", "num_likes": 0, "sort_order": "default", "shelves": ["contemporary", "romance"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/211925995", "review_id": "211925995", "date": "Sep 20, 2011", "rating": 2, "user_name": "Denise", "user_url": "/user/show/5115728-denise", "text": "This book was awesome... and then it was crap. It kept me curious throughout the pages, it kept talking about broken bones and scratches and memory blanks and I simply had to know what was going on. The moment it had all been revealed was the moment I put down the book and said to myself \"For me, this book ends here!\" ... Well, actually that's not how it happened, although it should have. After everything had been revealed, I went on, curious and excited about what was going to happen next. Anna finally found out that Aidan was dead, but then she turned to that paranormal bullshit and met that I-don't-even-remember-his-name guy whose wife had died (imagine the coincidence!) and he too came to \"contact\" her. Now it had to stop and this was when I realized I should've stopped right where I said before.I don't really intend to read the whole book at any time but... who knows, maybe in the future... when I'm trapped on a deserted island with only this book at hand!", "num_likes": 0, "sort_order": "default", "shelves": ["abandoned"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1904470210", "review_id": "1904470210", "date": "Feb 06, 2017", "rating": 5, "user_name": "Shahrun", "user_url": "/user/show/6192290-shahrun", "text": "This book (in the series about the Walsh Sisters) features that mysterious character - Anna. She is full of surprises! From the little glimpses of her in previous books, who knew she would have such a dramatic turnaround and get her life together (even though of course for the purpose of this book it has all gone to shit). I figured out straight away where Aidan was but, being as it was Marian Keyes, had no idea how it all came about. This is a really hilarious, but also deeply moving story of loss and the road to recovery.", "num_likes": 0, "sort_order": "default", "shelves": ["the-whilcoulls-top-100-2010"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/274101790", "review_id": "274101790", "date": "Feb 07, 2012", "rating": 4, "user_name": "Kat A", "user_url": "/user/show/7633439-kat-a", "text": "I've just found out, because I'm reading yet another Marian Keyes book right now, that there is a whole series about the Walsh Family of 5 sisters. Each sister seems to have her own book. This one is about Anna, who looses her husband in a tragic cab accident and her struggle to move on with her life afterwards. It's poignant and funny and sad all at the same time, and the crazy antics of the Walsh family (especially Mammy Walsh and sister Helen) are a great antithesis to the sadder parts. As always happens when I read the majority of an authors body of work, the more I read, the better I like the writing, especially when there's continuity of characters, as with Christopher Moore and Jennifer Weiner. Keyes writes well about the different locations her books are set in, this time being New York. Either she did a ton of research or actually lived there.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/23828066", "review_id": "23828066", "date": "Jun 05, 2008", "rating": 4, "user_name": "Amy", "user_url": "/user/show/1206706-amy", "text": "Still completely love Mummy Walsh! I absolutely adore this family dynamic. I sometimes feel too old and domesticated to enjoy alot of chicklit, but this was SO good! I laughed. I cried. Think \"Friends\" meets \"Bridget Jones\" meets \"Medium\" meets \"Sopranos\"...ok maybe that's too much, but I really did enjoy this. Definitely not your run of the mill chicklit. I would be interested to read more of the Walsh sisters.After note...feck! jolly girls! jolly boys! feathery stroker! So, I've just returned from vacation and I found myself using SO MANY coined terms from this book! I even have my husband using them! I think I may choose this for book club even though its relatively fluffy just so all the girls in book club can start talking like the Walsh sisters...and now me! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/26142199", "review_id": "26142199", "date": "Jul 02, 2008", "rating": 3, "user_name": "Martha Wewer", "user_url": "/user/show/863487-martha-wewer", "text": "I apparently already read this book and didn't realize it, that's how not memorable it was. I like Marian Keyes but this just didn't do it for me. It was witty in parts and dark in parts. It's about a woman who lives in New York and she is in a terrible accident and she's taken home to Ireland to recover. When she returns to NYC, she life isn't what it appears to be. She works for a cosmetic company and she has scarring, she doesn't hear from her fiance, she has a screwball family and you know, if the author had taken anyone of those and ran with it, my opinion my have been different. It was a little TOO much in terms of varied stories and storylines. I didn't hate it but I didn't love it either.", "num_likes": 0, "sort_order": "default", "shelves": ["chick-lit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1896375876", "review_id": "1896375876", "date": "Jan 29, 2017", "rating": 5, "user_name": "Molly", "user_url": "/user/show/60353813-molly", "text": "Marian Keyes is an author that I’ve been recommended plenty of times in the past but I never got around to reading anything by her. This was the first book I decided to pick up and now it’s something I have to recommend all of you. The way she writes made the book impossible to put down. She wrote it so the main character, Anna told you what was going on, but not the full story and what caused this until much later in the book. There would be short flashbacks to the past but you are kept in the dark about what happened to her husband Aiden. It had me hooked and to tell you the truth, I did cry. Multiple times. The book is funny, sad, romantic and everything I could have asked for. If you need a new book, this is one for you. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/6197555", "review_id": "6197555", "date": "Sep 14, 2007", "rating": 4, "user_name": "Maria Elmvang", "user_url": "/user/show/168347-maria-elmvang", "text": "Marian Keyes is a great writer, and I love the way she manages to draw readers into her books from the very first page. This book is no exception to that rule, but as for the plot itself, I have to admit I preferred the way Cecilia Ahern handled it in PS. I Love You.That's not to say I didn't like the book though (after all, I did give it 4 stars! ;) ), I loved the twist a quarter way through the book, and I felt that Marian's depiction of Anna's grief and reaction to that grief was extremely well written. She just didn't affect me personally the way Cecilia did.", "num_likes": 0, "sort_order": "default", "shelves": ["4-stars", "chick-lit", "not-owned", "2008"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/452727417", "review_id": "452727417", "date": "Nov 10, 2012", "rating": 1, "user_name": "Chris", "user_url": "/user/show/10983379-chris", "text": "another revew.This book is one terrible mess, which is surprising because it's written by a \"bestselling\" author. I mean, the dialogue...does she really think people talk like that? And what was up with all those boring email sections, which did nothing to add to the story. Plus, all the main characters are super annoying, especially the parts concerning the main character's job. The most obnoxious part of the story is the \"plot twist\" which happens about 200 pages into the book. I'm fairly certain that everyone must know what the twist is about 50 pages into the story, and the rest of the pages leading up to the \"shocking\" twist are painful. Why did I keep reading this book?", "num_likes": 0, "sort_order": "default", "shelves": ["marian-keyes"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2201562310", "review_id": "2201562310", "date": "Dec 02, 2017", "rating": 5, "user_name": "Les", "user_url": "/user/show/71637136-les", "text": "Loved This Book!!Marian Keyes writes chic lit, a genre I typically hate. However, I've been a Keyes fan for many years. She has a wicked humor and makes me laugh out loud. This is her best novel, by far. It's got so much more to it. It's also my daughter's favorite. We can agree on this book although we don't like the same books ever. We've each read it more than once. It's touching and funny, and it's certainly not your typical light beach read. It's the best in the Walsh sisters series. Rachel's Holiday is good too, but this one with Anna is superior. I laughed and cried at the same time. Unusual for a novel to do that for me. Loved it and will read again one day soon!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/6052332", "review_id": "6052332", "date": "Sep 11, 2007", "rating": 2, "user_name": "Kristina Hoerner", "user_url": "/user/show/320289-kristina-hoerner", "text": "I am a big Marian Keyes fan. She is one of my favorite Brit chick lit authors. This is her newest. Unfortunately, it was not one of her best. Maybe I am getting tired of the Walsh sisters. In this one, Anna has returned home horribly injured and missing her husband Aidan. It takes way too long to find out what happened to Aidan (though you have a pretty clear idea much earlier) and too long for her to figure out how she is going to re-create her life. I generally like this author but was not as pleased with this title.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/99578200", "review_id": "99578200", "date": "Apr 22, 2010", "rating": 4, "user_name": "Fuglsang", "user_url": "/user/show/3622173-fuglsang", "text": "Typical Marian Keyes style but with a horrid and heart breaking plot which struck me completely in the heart. This book leaves a lot of room for thoughts on... everything really. It even made me cry in the end, finally convincing me that Marian Keyes can by no means be compared to other chick-lit writers. She is unique.In a way it made me feel sad and happy at the same time - and made me believe that there's hope in the darkest of times.Once again I thank Marian Keyes for a funny, romantic, interesting - but also heart breaking - reading experience.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/452869217", "review_id": "452869217", "date": "Nov 10, 2012", "rating": 3, "user_name": "Hanne", "user_url": "/user/show/9653496-hanne", "text": "It actually started really well. I loved part 1 - the right kind of vagueness, not knowing where this was heading, not knowing what really happened. Slowly getting a suspicion which turned out to be right after another dozen pages.But as of page 212 it went all down hill. The last part was a bit better again, but then... it ended with an epilogue! One of those i'm-listing-everyone-and-tell-you-how-great-their-lives-are-now-in-two-pages epilogues. oh, how i dislike those!So unfortunately, overall just was just meh.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/661164827", "review_id": "661164827", "date": "Jul 07, 2013", "rating": 4, "user_name": "Dawn", "user_url": "/user/show/7261586-dawn", "text": "Thought this would be a light and fluffy read for on the bus. So much more than that.Anna Walsh is recently bereaved having lost her husband in a tragic car accident which also left her badly injured and horribly scarred. This story follows most of the first year following the accident as Anna grieves and learns to move on with her life.The author is fabulous at writing the heart-wrenching emotion of grief. She is also funny. This is an excellent blend of both emotions.May be my new favourite author.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1105429106", "review_id": "1105429106", "date": "Nov 13, 2014", "rating": 4, "user_name": "Andrew", "user_url": "/user/show/7270318-andrew", "text": "This is the second book I have read in this series, and this time the book is about Anna Walsh. Initially it flips back and forth between the current time and meeting (and her subsequent relationship) with Aidan. The vast majority of the book is her trying to deal with losing Aidan. Whilst some heavy subject matter, there is also a lot of humour present within the book. I did enjoy this book, like with the first one I read in this series, Rachel's Holiday, and I will be continuing to read books in this series and will try other books by Marian Keyes.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/55821118", "review_id": "55821118", "date": "May 12, 2009", "rating": 4, "user_name": "Mattie", "user_url": "/user/show/1436894-mattie", "text": "I really liked this book it took me a little bit to get into and you do cry at points, but I laughed out loud at some parts as well. The author is irish and I just love how they write and speak. i love English authors as well. It makes me want to call my mom, mum. There is some crude parts so I wouldn't op it for a church reading group. And Mom you would hate it DO NOT READ IT, you couldn't handle it is too much like real life for you. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/68413546", "review_id": "68413546", "date": "Aug 21, 2009", "rating": 2, "user_name": "Andrea", "user_url": "/user/show/2651989-andrea", "text": "God, I figured out he was dead by the second phone call (Spoiler) and just made myself angry for not realizing it during phone call #1.This is a solid 2. I'd have given it a 2.5 (Which is impossible with these stars, but, like, a 2.5 in my mind), but in the end she sees a butterfly messenger of hope and I was so angry. Her pessimism and cynicism were the best parts, not dream-visiting ghosts. Ugh.", "num_likes": 0, "sort_order": "default", "shelves": ["read-2009"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/85485217", "review_id": "85485217", "date": "Jan 17, 2010", "rating": 5, "user_name": "Cathy", "user_url": "/user/show/3168170-cathy", "text": "Excellent novel. I hadn't read Marian Keyes in years and was suspecting a light read. Too my surprise, Keyes took the topic of grief and made it real, enjoyable, laughable at times, and very poignant. At first I wanted to just return the book to the library, but almost halfway through it and immersed in the life of the latest Walsh sister, I had to finish it. I was not disappointed and gained a newfound respect for Keyes. A+", "num_likes": 0, "sort_order": "default", "shelves": ["chick-lit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1576227320", "review_id": "1576227320", "date": "Mar 11, 2016", "rating": 5, "user_name": "Maria Casey", "user_url": "/user/show/3865096-maria-casey", "text": "First five star rating of the year, which was so unexpected. I really wasn't expecting much from this book because it just didn't really appeal to me; didn't like the title, haven't read the author before (even though she's very famous in Ireland), hated the cover... It's been on my shelf for years and I just wanted to read it so I could get it off my shelf. ButI loved it. I loved all the characters and the story was so good and I just loved everything. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/100892236", "review_id": "100892236", "date": "May 01, 2010", "rating": 5, "user_name": "Janis Lyn (Jay) Almeida Alencar Lagos", "user_url": "/user/show/3629666-janis-lyn-jay-almeida-alencar-lagos", "text": "The best Marian Keyes book so far! I laugh a lot and also cried. The Walsh girls are definitely fun and crazy at the same time, especially Helen. I loved this book because we get information about Rachel's life with the amazing Luke and Claire with Adam too. The story, the drama, the jokes...AMAZING! No more words", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/236156811", "review_id": "236156811", "date": "Nov 16, 2011", "rating": 5, "user_name": "Amina ", "user_url": "/user/show/4124211-amina", "text": "Oh. My. Gosh.Now I'm telling people to 'take care' and cross the road carefully. Horror-stricken. I can't beleive this story... its so true but totally heart-breaking.Though I love the book to bits I wouldn't reccomend it coz it totaly shatters your mood :'( But if you're that type... be my guest. You'll love the sadness that will overwhelm you.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/701576289", "review_id": "701576289", "date": "Aug 22, 2013", "rating": 4, "user_name": "Radha", "user_url": "/user/show/1534349-radha", "text": "It's been a long time since a book evoked a range of emotion the way this one did. I laughed, cried, was downright depressed then was able to laugh again. I enjoyed the seemingly flawless way the author portrayed the protagonists' family and was able to incorporate humor despite the feelings the protagonist was going through. Highly recommend.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1967310957", "review_id": "1967310957", "date": "Apr 10, 2017", "rating": 4, "user_name": "Essy", "user_url": "/user/show/62526000-essy", "text": "The beginning of the book was a bit slow and I kept putting it down for later. Eventually, the book sort grew on me and I could not put it down. The story takes us through Anna's life post losing her newly wed husband, as she goes through the different stages of grief. Its heart wrenching but ends with a sense of renewed hope.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2403026166", "review_id": "2403026166", "date": "May 25, 2018", "rating": 1, "user_name": "Disco", "user_url": "/user/show/18649988-disco", "text": "I have to agree with the reviewer(s) who mentioned that the character of Anna contradicted everything we'd read about her in the previous Walsh family books. How does a floaty hippy suddenly make millions in Manhattan? Extremely jarring. I notice the people who read this book first like it more than those who read earlier books in the series. The lack of character continuity was lazy. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/25241736", "review_id": "25241736", "date": "Jun 23, 2008", "rating": 3, "user_name": "Gloria", "user_url": "/user/show/1262346-gloria", "text": "I was expecting typical chick-lit and got a little of that along with a little more depth. I can't say too much without ruining it a bit, but Keyes' insights into the emotional topics of this book are spot-on. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/35102833", "review_id": "35102833", "date": "Oct 12, 2008", "rating": 3, "user_name": "Ashley ", "user_url": "/user/show/810272-ashley", "text": "This book made me laugh and sniffle all on the same page. This book dealt with everyday occurances in someone's life after after a tragic period. I am going to have to go back and read the other Walsh sister books because this family cracked me up.", "num_likes": 0, "sort_order": "default", "shelves": ["chick-lit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/36720146", "review_id": "36720146", "date": "Nov 01, 2008", "rating": 2, "user_name": "Erin", "user_url": "/user/show/300244-erin", "text": "First of all, I feel deceived by the description--she doesn't have amnesia like you are led to believe. She is in fact in denial and going through the mourning process. I stuck with it, but I was SO ready for this one to end.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/40292945", "review_id": "40292945", "date": "Dec 17, 2008", "rating": 5, "user_name": "Shelby *trains flying monkeys*", "user_url": "/user/show/1053760-shelby-trains-flying-monkeys", "text": "What a great book! I usually will read so called chick lit but it isn't one of my fav. genres. This book isn't just chick lit. I stepped into Anna's world and became her friend. I could easily picture wanting my \"multiple orgasm\" lipstick! Great fun and touching at the same time. ", "num_likes": 0, "sort_order": "default", "shelves": ["read-2008"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/141756723", "review_id": "141756723", "date": "Jan 18, 2011", "rating": 4, "user_name": "Joanna", "user_url": "/user/show/1272695-joanna", "text": "I really enjoyed this book. Once I got into it, it was difficult to put down. It's not your typical \"feel good\" book, but it keeps you going and basically reminds you that everything is going to be ok!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/166237428", "review_id": "166237428", "date": "May 06, 2011", "rating": 3, "user_name": "Jenn", "user_url": "/user/show/969371-jenn", "text": "Not bad, but I recall liking the other Sister's books better. I lost some of the interest in the second half of the book - it just seemed to drag somewhat. And I guess I wanted her to fall in love all over again regardless of the mourning period. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/902462611", "review_id": "902462611", "date": "Apr 06, 2014", "rating": 5, "user_name": "Abby Green", "user_url": "/user/show/3509594-abby-green", "text": "Amazingly enough I'd never read this. Falling in love with Marian Keyes all over again. No - one has come close to matching her very particular brand of Irish wit and style in women's fiction. This has everything: plot, sexiness, emotion and blisteringly perfect writing. She is the Queen.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/954881760", "review_id": "954881760", "date": "Jun 01, 2014", "rating": 4, "user_name": "Devon", "user_url": "/user/show/7904191-devon", "text": "-I love The Walsh Sister series -Anna Walsh is officially my favorite of the sisters-Even when you see the twist coming a mile away it still kinda knocks the wind out of you -Funny and sad all at the same time, well done Keyes ", "num_likes": 0, "sort_order": "default", "shelves": ["my-favorite-books-of-2015"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1179655470", "review_id": "1179655470", "date": "Jan 25, 2015", "rating": 4, "user_name": "Evie Pey", "user_url": "/user/show/33713500-evie-pey", "text": "Not my usual choice of book, but I liked it a lot. It is a book you don't really have to concentrate on and you kinda know what's gonna happen but really enjoyable and quite sad. I might be tempted to read more Marian Keyes after this if I want an easy read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1204566092", "review_id": "1204566092", "date": "Feb 18, 2015", "rating": 5, "user_name": "Isabelle Agius", "user_url": "/user/show/20499079-isabelle-agius", "text": "Marian Keyes manages to make you live through the tragedy of losing a loved one and the bereavement process that follows. Anna's pain is so tangible.... Definitely one of the top books of this author. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1397826986", "review_id": "1397826986", "date": "Sep 21, 2015", "rating": 3, "user_name": "Tuğba", "user_url": "/user/show/47205192-tu-ba", "text": "I love, love, love Marian Keyes! I love how she writes from the heart, how the characters are so very real. This book isn't your typical \"feel good\" book but it keeps you going and basically reminds you that everything is going to be ok!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1032763723", "review_id": "1032763723", "date": "Dec 01, 2016", "rating": 5, "user_name": "CariAnn", "user_url": "/user/show/5937814-cariann", "text": "I don't give out 5 stars very often, but this book was so good! The entire series has been lovely so far, but this is at the top of my list. I'm very curious to move on to youngest sister Helen's story...", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/18723199", "review_id": "18723199", "date": "Mar 26, 2008", "rating": 5, "user_name": "Melissa (LifeFullyBooked)", "user_url": "/user/show/721595-melissa-lifefullybooked", "text": "I really liked this story about a woman who is recovering from an accident. It has stayed with me over a long period of time. Really touching.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/20763613", "review_id": "20763613", "date": "Apr 22, 2008", "rating": 5, "user_name": "Megan", "user_url": "/user/show/893843-megan", "text": "This book required therapy to get over. It hurt. And I would read it again in a heartbeat. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/50742905", "review_id": "50742905", "date": "Mar 28, 2009", "rating": 2, "user_name": "Misha", "user_url": "/user/show/175912-misha", "text": "Cute enough so far, but I'm not loving it....Couldn't finish...abandoned...hate it when that happens", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/70391903", "review_id": "70391903", "date": "Sep 07, 2009", "rating": 5, "user_name": "Mimapdx", "user_url": "/user/show/2465423-mimapdx", "text": "This the best \"Marian Keyes\" book. And that is saying a lot.You will cry and then laugh, then cry and laugh at the same time. Simply wonderful.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/140221208", "review_id": "140221208", "date": "Jan 12, 2011", "rating": 4, "user_name": "Janemargaret", "user_url": "/user/show/3857687-janemargaret", "text": "Smart, funny, touching. Full of crazy characters. I laughed out loud.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/204831741", "review_id": "204831741", "date": "Sep 03, 2011", "rating": 5, "user_name": "Jennifer Holland", "user_url": "/user/show/6198985-jennifer-holland", "text": "If you've ever lost someone close to you - read this book. I was left with tears, but so satisfied.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/559480106", "review_id": "559480106", "date": "Mar 12, 2013", "rating": 4, "user_name": "Laura", "user_url": "/user/show/10778429-laura", "text": "I love Anna, love her. I'm really looking forward to reading the author's previous novels with Anna's sisters. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/742026919", "review_id": "742026919", "date": "Oct 15, 2013", "rating": 5, "user_name": "Sharon", "user_url": "/user/show/24517687-sharon", "text": "One of my all time favourite books. I loved Anna & all the Walsh family. Such a great book. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/963050161", "review_id": "963050161", "date": "Jun 09, 2014", "rating": 1, "user_name": "NKZ", "user_url": "/user/show/5746225-nkz", "text": "Seriously? No book should have 103 chapters.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/984148328", "review_id": "984148328", "date": "Jul 02, 2014", "rating": 4, "user_name": "Thomas Stroemquist", "user_url": "/user/show/32669562-thomas-stroemquist", "text": "\"Not the best book in the series (Walsh sisters that is) but Keyes writes beautifully and often funny while dealing with quite dark and heavy subjects. \"", "num_likes": 0, "sort_order": "default", "shelves": ["book-collection"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1535709742", "review_id": "1535709742", "date": "Feb 03, 2016", "rating": 5, "user_name": "Elizabeth Hughes", "user_url": "/user/show/51112973-elizabeth-hughes", "text": "Best book of the series. Could read it over and over again ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1687531924", "review_id": "1687531924", "date": "Jul 04, 2016", "rating": 5, "user_name": "Milan Vohra", "user_url": "/user/show/8814954-milan-vohra", "text": "Loved it. Marian Keyes can make me cry and laugh, often in the space of the same page.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1154971146", "review_id": "1154971146", "date": "Sep 17, 2017", "rating": 1, "user_name": "Zaina", "user_url": "/user/show/38730624-zaina", "text": "This was one of the most pointless books I've ever read. Had to push myself to finish it only because I had started.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2202046842", "review_id": "2202046842", "date": "Dec 02, 2017", "rating": 4, "user_name": "Sue", "user_url": "/user/show/2944037-sue", "text": "I love, Love, LOVE this book and have read/listened to it several times. I laughed, I cried. I feel like I know Anna Walsh and her entourage. 💋", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3725655779", "review_id": "3725655779", "date": "Mar 07, 2021", "rating": "", "user_name": "JaNel", "user_url": "/user/show/44237-janel", "text": "I usually wouldn’t think I’d enjoy a book about the stages of grief, but, this author is lol funny and the supporting characters are great.", "num_likes": 0, "sort_order": "default", "shelves": ["series", "summer-reading"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4046052722", "review_id": "4046052722", "date": "Jul 06, 2021", "rating": 3, "user_name": "Laurie", "user_url": "/user/show/80896777-laurie", "text": "It was long. It was sometimes poignant and sometimes quite silly. It had some entertainment value but I'm glad I'm finished it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2908652033", "review_id": "2908652033", "date": "Aug 10, 2019", "rating": 4, "user_name": "Tracy ", "user_url": "/user/show/3776886-tracy", "text": "I do love Marian Keyes. She's one of those authors who's taken the most painful parts of her life and used them to drive some fantastic writing--books that make us laugh, cry, and think. The reading trifecta.This is the fourth of five Walsh sister novels, and unfortunately for me, the last one for me to read (I'm going to reread the last one anyway, but I've read it before). I will miss the Walsh sisters. So this one is Anna's story, and boy does she have one. At the beginning of the novel, she's recuperating from health problems at home in Dublin with her family, but she misses her husband, Aiden, and wants to get back to her home in New York. While the chaos that comes with a family of five daughters, an overwhelmed father, and a bit of a whackadoodle mammy swirls around her, Anna is melancholy, wanting only to return to New York. Keyes takes her time (I've seen some reviewers say many of her books are too long, but I'm happy to have more time in her worlds), slowly watching Anna's memories reveal how she landed home in Dublin, and carefully letting the reader see how her past affects where she'll go next. Interestingly, she does this by staying in the present, in Anna's head, watching her thoughts as they happen, letter them drive her emotions and behaviors, and inevitably, helping us understand Anna by being with her instead of showing her to us. Keyes won't be hurried, and the end result is that we really know who Anna is, how she feels, and that even those with emotional issues (temporary or otherwise) can be okay. And we laughed with her and her family at the same time. (Her family, by the way, especially Mammy, is hilarious). I had one SMALL issue with this one. The Anna we meet here is not quite the same Anna that we've met in previous books. The Anna described in Claire, Rachel, and Maggie's stories is a little different, more carefree and spontaneous, perhaps flighty. I'd been looking forward to finding out just what was in that girl's head. But this novel takes place about 15 years after the first Walsh sister novel (Watermelon, Claire's story), and so as in real life, she's changed a bit. Anna even explains this a little, saying she used to be something of a space cadet, but she's changed as she got older. Since the differences aren't ignored, I can be okay with it, but I really did want to know what Anna was thinking back then.Great novel for those who enjoy watching women come out from their pain, mental health issues, difficult circumstances of all kinds and find a way to be happy, especially when they really want to experience it by knowing the characters well yet be encouraged to find humor at the same time. NOT for anyone who is impatient to see the end of that process come too fast.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1877096441", "review_id": "1877096441", "date": "Jan 12, 2017", "rating": 5, "user_name": "Linda Burson", "user_url": "/user/show/33763887-linda-burson", "text": "I'm not going to rehash the plot of the story here in my review like most readers do including critics, for two reasons: One, if you are trying to decide whether to read it, you can get the synopsis off the cover; Two, it gives away too much for those who definitely want to read it and are only looking for constructive criticism and/or ratings. However, I will tell you the book has three (3) parts. The first part was outstanding. It held my interest and I couldn't wait to find out what was happening. All is a little vague, initially. Then by the end of the first part, you understand what has occurred.Part 2 of the story, to me, felt a bit boring and it dragged on, because at this point, all I could concentrate on was the constant crying I was doing. Yes, I was obviously invested enough in the characters to feel this strong emotion. While I did plenty of out-loud laughing, it was also the same with the crying.Part 3 of the story was better than part 2, but still not as outstanding as the first part, but it was good. There were a lot of emails from home that I could've done without, and it wouldn't have hurt the length of the book. It is a long one.There is somewhat of a satisfying ending in my eyes; not the kind of ending I would like, but it ended on a happier note than it could have, I suppose.Yes, it's a good story; yes, the novel is well-written; yes it will make you laugh, but it will also make you cry unless you are a strong person who can sit there and say \"Eh, it's only a fiction story.\" This I cannot do. Maybe I'm not as strong as some, or maybe Marian Keyes is just that good at writing.I gave it five stars because I feel it deserves it especially for those that like these kinds of funny and teary-eyed stories. Personally, It left me feeling depressed. I'm spending the rest of my evening feeling drained and that's not how I like to spend my evenings. I don't mind crying and of course I love to laugh, but I don't want to feel emotionally distraught after reading a book. In my mind, life is difficult and emotional enough...why have it in my entertainment as well. For this reason, I most likely will not read another Marian Keyes novel--unless I read a review that tells me it isn't a tear-shedding kind of book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2957699653", "review_id": "2957699653", "date": "Jan 30, 2020", "rating": 4, "user_name": "Tess", "user_url": "/user/show/69005897-tess", "text": "My original rating was 3/5 stars but I've had a night to think about it and I've browsed some of the reviews and I've had to up it to 4/5 stars.See, I found myself getting oddly defensive about this book when I read some of the criticisms leveled at it. I mean, of course people can have their own opinions and this kind of book isn't for everyone. If you're looking for 'em there are plenty reasons why a person might not like it or finish it. I get that. The sense of humor isn't for everyone. Some people might not like the swearing or the sex stuff. For some people it might be just too sad. I bet there's a few folk out there that just don't like it because they think they're too smart for it. C'est la vie etc. etc. but to say that you didn't like it or couldn't finish it because if the physic stuff is a bit, well, weird since that was sort of the point of the book? The thing's called Anybody Out There? so... This is a book about a woman's grief. The desperation and the agony of grief. And do you know what people do when they're in that much pain? I'll tell you - they do anything and everything they can to try and make it better quicker. Of course the woman wants to go to a physic. Like I say, she'd do anything to get rid of the pain. Despite how illogical and strange it may seem to herself and others. Also, this is Anna Walsh of the other Walsh books so I don't get why people are surprised that she reverted back to the spiritualistic Anna we all got to know. Just saying.This book done all I wanted it to do and what I've come to expect from Marian Keyes (this is my 6th book by her). I had a good ol' chuckle, I had a fabulous little cry or two at my desk because I was sneakily reading it at work and I spent a bit of time not having to think about my actual life because I was spending time with the Walsh family again who are significantly more entertaining than my own.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2690434458", "review_id": "2690434458", "date": "Jan 26, 2019", "rating": 4, "user_name": "Chloe (Always Booked)", "user_url": "/user/show/7784852-chloe-always-booked", "text": "This one is my 2nd favorite of the series (behind Watermelon). This one is about Anna. She is one of the younger sisters. She's the rep for a glamorous make up line and lives in NYC. However, the story starts with her back at her parents house in Ireland badly injured. The story unfolds through memories mostly. She met and married Aidan then he got hit by a car to save her life (thus why she's injured) and he died. This is all revealed little by little throughout the book and you really get to watch their relationship grow through her memories. In the present, she's trying to go to different mediums and psychics to be able to talk to him but none are ever successful. We find out that he had a child that he conceived with his long time girlfriend shortly before he and Anna met. He found out about the kid the week he died and was going to tell Anna that night. Anna is really angry and bitter, but then she realizes that this kid is all she has left of him and in a weird way her and the ex become friends and she enjoys the kid. During the story, she starts going to grief counseling and meets a guy there. He lost his wife and they become friends because they have a shared understanding. In the very end of the book, Aiden comes to Anna and tells her its all okay and he loves her very much but wants her to move on. She will be happy with another man and its one she already knows. I'm assuming its the guy from grief counseling. Overall, I really liked this book. As with the others, I feel like it was longer than it needed to be, but I thought the story was engaging and relatable. I was emotionally invested in the characters in a way I wasn't in the others. You get a lot of Rachel in this story because they live in NYC too. She's marrying Luke, the guy from her novel, in this book.", "num_likes": 0, "sort_order": "default", "shelves": ["on-my-read-bookshelf"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1622935762", "review_id": "1622935762", "date": "May 16, 2020", "rating": 3, "user_name": "Sandrine", "user_url": "/user/show/27155528-sandrine", "text": "I went through a phase where I absolutely ADORED Marian Keyes and started to collect all of her books. However, this was never my favorite one of hers and I can't quite put my finger on it. Anyway, my tastes have changed over the years (no reflection upon the quality of literature) and I tend to go through phases in what I read, so I figured I'd try to clean out my bookshelves in order to make room for new books I've been forbidding myself to buy since we have no space for them. I therefore decided to pick this book up again in order to decide wether to put it in the \"keep\" or \"give away\" pile. It is one of Marian Keyes sadder books in my opinion. She usually has a nice way of making serious subjects or happenings into a \"feel-good novel\", yet this one left me feeling sad throughout. Many of the main characters are rather annoying and strange, even though I usually like strange, but it felt rather superficial, especially the parts concerning the main character's job. The first time I read it, I also felt that the main character's relationship with her husband seemed a bit unrealistic and annoying at times, but now that I am married I quite enjoyed that, even if it was \"layed on rather thickly\". Additionally, I struggled with the \"plot twist\" which happens in probably the first third of the book. I felt that both times I read the book I saw this twist coming and was a bit frustrated with this first third of the book.It is still a nice, easy read, but not her best work in my (humble) opinion. It still has her signature Irish references and Irish humor that I always enjoy. I look forward to picking up some of her other books soon.", "num_likes": 0, "sort_order": "default", "shelves": ["read-in-english", "writers-irish"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2727072217", "review_id": "2727072217", "date": "Feb 23, 2019", "rating": 4, "user_name": "Sandra", "user_url": "/user/show/35503288-sandra", "text": "This is NOT a clean, sweet romance, so if that is what you are looking for, this is not it; however, if you want a down-to-earth, gritty real-life worldly story which is life for many, this story will make you laugh and also make you cry. The author takes us through life for the Walsh family, with happiness, pain, suffering, grief, mourning, and death and shows us the unique and unusual way some people deal with loss in their lives, and their language is sometimes rather crude. I marked this section, where the one of the main characters, Anna, is thinking of saying good-bye to a person, and then meeting up with the same person a few moments later at the bus or train station. \"Then when the train or taxi or bus comes, you say good-bye once more and you try to make a laugh of it by saying gaily \"Good-bye, again,\" but it's nothing like as nice as the previous time and you're wondering if you should kiss them again, and if you do, it feels fake, and if you don't, you feel as if you've ended on a bad note. Like a souffle, a successful good-bye can really only be done once. A good-bye can't be reheated.\"This was my first read by Marian Keyes and I really didn't know what to expect. If one can overlook the crude language, the story is a page-turner.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3262075405", "review_id": "3262075405", "date": "Apr 07, 2020", "rating": 3, "user_name": "Sowmia", "user_url": "/user/show/25953182-sowmia", "text": " 3.5 stars. Book #4 in the Walsh family series centers around Anna. One thing I disliked is that the author seemed to have completely reinvented Anna’s character in this books. She was nothing like her character in the previous three novels. This was disappointing. The former Anna was unique, this Anna pretty much had the same narrative voice as the other sisters before her. The plot was interesting but the book felt like it dragged and I believe a lot could have parsed down without sacrificing main points on the story. There’s a twist toward the end that reveals a secret but I felt like the book didn’t need it and Anna’s reaction to the secret just didn’t make much sense to me. On the positive side, Marian Keyes’ humorous writing is still on point and that’s what makes me keep reading her novels. She also has a splendid way of making a book funny and heartbreaking at the same time, which is especially evident in this book. That’s not an easy thing to accomplish, but I could tell from reading Watermelon that she has a gift for it. I think this series really started out strong with the first two books, but the last two have been kind of a letdown. I’m keeping my fingers crossed that the last book will redeem the series. ", "num_likes": 0, "sort_order": "default", "shelves": ["2020"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3927663686", "review_id": "3927663686", "date": "Apr 05, 2021", "rating": 4, "user_name": "Susan", "user_url": "/user/show/6313653-susan", "text": "Anna Walsh is officially a wreck. Physically broken and emotionally shattered, she lies on her parents' Dublin sofa with only one thing on her mind: getting back to New York. New York means her best friends, The Most Fabulous Job In The World™ and above all, it means her husband, Aidan.But nothing in Anna's life is that simple anymore... Not only is her return to Manhattan complicated by her physical and emotional scars – but Aidan seems to have vanished. Is it time for Anna to move on? Is it even possible for her to move on? A motley group of misfits, an earth-shattering revelation, two births and one very weird wedding might help Anna find some answers – and change her life forever.I really loved this book, the depiction of grief is absolutely heart-rending! Although there are the same family characters as in Rachel's holiday Anna's view of them is so different from Rachel's. I loved them! But I suppose that must be Marian Keyes' great talent as a writer, that she can write about the same family from two points of view and make them seem entirely different.Almost 5-star!", "num_likes": 0, "sort_order": "default", "shelves": ["2021books"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2320534168", "review_id": "2320534168", "date": "Mar 07, 2018", "rating": 5, "user_name": "Mwongeli ", "user_url": "/user/show/72976859-mwongeli", "text": "This is a book I randomly picked up during a Sunday sale in the streets of Nairobi.I do not remember why I picked it up, seeing as I had never heard of the author. But I am so glad that I picked it up. I still have the book; a valuable part of my book collection. The book is very engaging, it had me laughing and almost crying. It was a definite page turner and still my favourite book by Marian Keyes and definitely my favourite from the Walsh Family series.I liked Anna's POV, in the state of mind of a person grieving; trying to come to terms with it. I like that the process was not sugar coated, it felt like it could actually happen.The ending was amazing! I like that there was a bit of mystery about it, even though I am certain that anyone who has read the book had picked a side in the choice that Anna was to make, if at all she wanted to make it. I also appreciate the sense of hope that Marian Keyes gives to others going through such an experience. That is all I can say without spoiling the book for those considering reading it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2627463809", "review_id": "2627463809", "date": "Aug 09, 2019", "rating": 4, "user_name": "Rori Rockman", "user_url": "/user/show/4843278-rori-rockman", "text": "I enjoyed the book, which was no surprise since I like everything I've read by the author. She has this wonderful gift about creating a story out of a very distressing situation, and making that story hilarious, marvelously entertaining, and compulsively readable while still being true to the human condition -- showing the full range of difficult emotions that characters are going through and handling tough subjects with sensitivity.Favorite quotes:\"I stared at the little piece of machinery: phones have always seemed magical to me, the way they pull off the unlikeliest, most geographically distant connections. I know there are perfectly good explanations of how it all works, but I've never stopped being amazed at the wondrousness of people on opposite sides of oceans being able to talk to each other.\" p.29\"Swirling, whirling past their radiant faces, I remembered something I hadn't known I'd forgotten: Aidan wasn't the only person I loved; I loved other people, too. I loved my sisters, I loved my mother, I loved my dad, I loved my nieces, I loved my nephews, I loved Jacqui. At that moment I loved everybody.\" p.429", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2727467948", "review_id": "2727467948", "date": "Jan 28, 2020", "rating": 5, "user_name": "Addie BookCrazyBlogger", "user_url": "/user/show/37135039-addie-bookcrazyblogger", "text": "Anybody Out There? is Marian Keyes at her absolute best. I love her books about the Walsh family, starring 5 Irish sisters and their parents, as they bumble along in life. This particular novel follows the second youngest, Anna, whose been seen in the previous novels as being flakey, scatterbrained and spiritual in a faux-hippie type of way. The novel opens with her recovering from an accident that led to incredible physical pain and her denial that her husband of less than a year is dead. The novel proceeds, in the most heartbreaking vein, to follow her as she works through the cycle of grief. I wasn’t expecting the twist towards the latter half of the novel which as a reader, is always enjoyable! What I loved most about this novel was how clearly Anna’s voice shown through. I physically felt her grief, her desperation, her anger, her sadness and her devastation. This was a fitting conclusion to the Walsh series. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3515770812", "review_id": "3515770812", "date": "Aug 26, 2020", "rating": 5, "user_name": "Wide Eyes, Big Ears!", "user_url": "/user/show/5151012-wide-eyes-big-ears", "text": "Anna, Irish ex-pat, works for a cosmetics company in NY where she falls for Aiden. After recuperating with her family in Ireland, she heads back to NY to find him. I enjoyed so much about this delightful story, the “Irishness” of the humour and expressions were heartwarming and great fun - the book was two thirds hilariously entertaining and one third incredibly moving. The story jumps back and forth in time and we aren’t privy to the reason Anna is recuperating until about half way through - I kept thinking I must have skipped some pages, but there’s a good reason for the slow reveals. As I’ve found with other Marian Keyes books, the resolutions are realistically slow and hard won, rather than quick. It’s a book I’d like to return to again and again. 🎧 I must seek out more narrations by Caroline Lennon, her Irish accent was pure joy, her comic timing was perfect, and all the Irish and American characters worked brilliantly. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2260758777", "review_id": "2260758777", "date": "Jan 16, 2018", "rating": 1, "user_name": "Leah Veritay", "user_url": "/user/show/47490007-leah-veritay", "text": "At last, my final Keyes with a final review. Why split a continuing plot into three parts, why?! By the time the \"big reveal\" appears of how Anna sustained her injuries, you pretty much know what went down. And again so many unnecessary sub-characters that somehow get a mention in the epilogue. And Mitch seems like he'll become this important element in Anna's life, but no, he just kind of slinks away. And Janie, whatta piece of work she must've been before Anna came into Aidan's life, geez. Oh yeah, she just casually keeps seeing, sorry, sleeping with her ex whilst dating another guy who ends up being her future husband, what?! And the whole dog poo thing, seriously?! What a useless addition to an already mediocre plot. Once again, a book that should've been cut down to less than 300 pages. But happy to say, this is the last Keyes that I will ever read. Ever.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2490501726", "review_id": "2490501726", "date": "Aug 11, 2018", "rating": 4, "user_name": "Wendy Jakob", "user_url": "/user/show/51686742-wendy-jakob", "text": "It's been a while since I read a Marian Keyes book so I didn't connect this one with Watermelon, however although it's about the same family this is Anna's story and can easily be read as a stand alone.It's chick lit at its best. Funny in places, sad in places but (mainly) credible. At the start of the story Anna is recuperating at her family home in Ireland after an accident. We don't immediately learn much about this accident or where her husband is. We don't even know Aiden is her husband. We're drip fed information and initially I wasn't sure I was going to be drawn in enough to keep me interested considering it's a long book - 592 pages. I wondered where it was going and then there's a revelation and I was hooked. Judging by the reviews you'll either love it or hate it but it's not a fluffy romantic read and I enjoyed it.", "num_likes": 0, "sort_order": "default", "shelves": ["family-relationships", "contemporary-fiction", "2018"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3571781289", "review_id": "3571781289", "date": "Oct 08, 2020", "rating": 3, "user_name": "Valerie", "user_url": "/user/show/35564798-valerie", "text": "I liked the story BUT I have to qualify that with some strong criticism. Verbal diarrhoea: The book is almost 600 pages when 400 would have been plenty. There is so much filler , including a whole chunk of boring emails into an unrelated side story. The overall book is unwieldy with so many named characters and descriptions and forays into their lives.Tediously quirky: Yes, it is witty and clever, but it wears thin and detracts from the serious passages.Lack of focus: See above. There's a lot of wading through mud just to get to the main story.This is the third Marian Keyes book I've read, and it will be the last. The author (who I have heard on podcasts) does not know how to edit or hone a story down to the gems. Instead every single thought that goes through her head is spewed straight onto the page. It's time for a diet.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3974834741", "review_id": "3974834741", "date": "Apr 30, 2021", "rating": 5, "user_name": "Piara Strainge", "user_url": "/user/show/28371717-piara-strainge", "text": "This is my second Marian Keyes this year. I find her writing utterly compelling and believable. Again, I'd say the tragicomedy genre I'm enjoying so much is growing, as I'd put this novel into that category.Anna has hit rock bottom and despite her large Irish family rallying around her, she just wants to be alone. Without giving anything away, I can relate to Anna's desperation and heartache and the impossible pain and having to drag your bum through another day that you can't bear to face. Throwing herself (and myself) into work. And mixed with the tragedy, there's the beautiful humour and the goings on of everyday life, as irritating as that is when you become obsessed with trying to get to the bottom of something and ordinary life is so tiresome and continuous.I think it's brilliant writing!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2954335814", "review_id": "2954335814", "date": "Aug 27, 2019", "rating": 2, "user_name": "Joseph Delcourt", "user_url": "/user/show/27467725-joseph-delcourt", "text": "This woman sure can write. Witty dialogs, good plot, great humour and vivid descriptions. Very lively. But all this for THAT? Nearly 600 pages for what? Could have done it in 300 and it would have been a great book.First part fine! We get into the plot (rather well driven) and the charaters'psychology.Humour catches on.We get into it. Preparing for a nice journey.Second part is such a bore! Endless, repetitive, humour nearly gone? I flipped through the pages searching for a place where to land. Knew what would come next.Third part is a slow recovery. Back to the plot in a hurry to be finished with it.Maybe I didn't get it, maybeMy mistake But 600 pages for heaven's sake! (So to speak)", "num_likes": 0, "sort_order": "default", "shelves": ["distrayabt"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3756438135", "review_id": "3756438135", "date": "Jan 14, 2021", "rating": 5, "user_name": "Joni Janice Mielke", "user_url": "/user/show/63575578-joni-janice-mielke", "text": "I really enjoyed this! For me, Angels was not as good as its predecessors - unless it's just that Maggie isn't my favourite Walsh sister - but this book seemed to recapture all of the magic and bitter-sweet life moments of Watermelon and Rachel's Holiday. Anna, from her own point of view, is not who I had expected and I felt a deep sympathy with her character. If her obstinate desire to achieve the impossible seemed a bit annoying, I needed to remind myself that each person has different coping mechanisms and these take time to work through. The narration was also excellent, and despite being a new voice in the series, Caroline Lennon captures Anna well and was an inspired choice for her story. A well-deserved 5 stars.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3768816364", "review_id": "3768816364", "date": "Jan 17, 2021", "rating": 5, "user_name": "Maria Groven", "user_url": "/user/show/114105500-maria-groven", "text": "This book entered my life at the exact right time. Reading has been going slow for me in the past few weeks. I've really missed the feeling of a book pulling me in to it's world. So THANK YOU Marian Keyes!!Even with all the sorrow and heartbreak and hysteric pursuits of that which was lost, Marian Keyes managed to make it a heart warming and light book. I loved it, and in my opinion this book is a very good place to start if you haven't read in a while and wish to pick it back up. Although it is a bit long, the pages just fly by and before you know it you're experiencing that all-to-familiar feeling of nostalgy that comes with saying goodbye to the world you got to live in on borrowed time. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3792668818", "review_id": "3792668818", "date": "Jan 24, 2021", "rating": 5, "user_name": "Lloyd", "user_url": "/user/show/118942074-lloyd", "text": "Definitely my 2nd favorite in the Walsh family series. It was absolutely heartbreaking and I avoid reading spoilers so once I reached Anna's realization I burst into tears. It was interesting to see how Anna's character developed from the young, aloof Walsh sister to a woman suffering an enormous tragedy. For such a heavy book, my favorite moments were Helen's hilarious emails to Anna detailing her escapades as a Private Detective. Anybody Out There is a powerful book about love and loss and it was hard to read at times but I was satisfied with the outcome. I also like how the love interest is left ambiguous and was thrilled to have some clarity in Helen's novel Mercy Close because I did not actually guess the correct love interest! Great book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2083517519", "review_id": "2083517519", "date": "Aug 05, 2017", "rating": 1, "user_name": "Maria", "user_url": "/user/show/62056066-maria", "text": "This book is classified as chick lit. It is not! Although it's well written and the author has great ability at conveying strong emotions, it's not the type of book I enjoy reading. When I started it, I was curious about what happened to the heroine, once I knew, I was so desperate to know what happened to her husband and instead, it kept dragging on and on about inconsequential things, until finally we get to know the tragic events that took place. It made me cry and so sad, I couldn't get past the part where she seeks the help of a psychic. I personally don't believe in that crap, so I gave up on the book.", "num_likes": 0, "sort_order": "default", "shelves": ["dnf", "no-sad-books-for-me"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2116615465", "review_id": "2116615465", "date": "Sep 07, 2017", "rating": 4, "user_name": "Lisa", "user_url": "/user/show/148710-lisa", "text": "Anna Walsh is officially a wreck. Physically broken and emotionally shattered, she lies on her parents' Dublin sofa with only one thing on her mind: getting back to New York. New York means her best friends, The Most Fabulous Job In The World™ and above all, it means her husband, Aidan.But nothing in Anna's life is that simple anymore... Not only is her return to Manhattan complicated by her physical and emotional scars – but Aidan seems to have vanished. Is it time for Anna to move on? Is it even possible for her to move on? A motley group of misfits, an earth-shattering revelation, two births and one very weird wedding might help Anna find some answers – and change her life forever", "num_likes": 0, "sort_order": "default", "shelves": ["read-library", "2017"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2260705608", "review_id": "2260705608", "date": "Jan 21, 2018", "rating": 4, "user_name": "Sara Brady", "user_url": "/user/show/63214704-sara-brady", "text": "I can see how the beginning of the book could annoy some impatient readers- and I admit I was one of them! Anna has extensive injuries from an unknown event but believe me, just wait until you find out! In my copy, it was about 1/5 of the way through the book. Many other reviewers talk about how emotional they were while reading but I found it rather peaceful, actually. As always, Marian's development of the characters creates a bond between the reader and the character, something a truly love about her writing style. I'd recommend reading this book in order of the Walsh Family books to help better develop that bond with the character.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2608577396", "review_id": "2608577396", "date": "Nov 28, 2018", "rating": 2, "user_name": "Ash", "user_url": "/user/show/51525757-ash", "text": "So I can't really muster up a lot of feelings for this book. I didn't even have a lot of feelings while reading it. But the one thing I have to say is that it kept me mildly interested. The writing wasn't bad and despite the length of the book it flowed well. The plot was good but it lacked impact in all categories. From the accident, acceptance, grief, sub-plots, without giving anything away it was all just okay. I found nothing to be remotely exciting or that kept me on tenterhooks for more. But it was reasonably okay too. I'm tired of bad writings and bad executions of plots so this fit in well in that regard.Pisss: Aidan was a sweetheart.", "num_likes": 0, "sort_order": "default", "shelves": ["meh"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3341204801", "review_id": "3341204801", "date": "May 26, 2020", "rating": 5, "user_name": "Vickie Taylor ", "user_url": "/user/show/49075369-vickie-taylor", "text": "I really liked it. People have reviewed on here that they didn’t like the plot twist of finding out that Aidan was dead. I don’t actually think it was meant to be a twist at all. I think it was written that way because Anna couldn’t admit to herself that he’d gone. The whole story was her finding her way through her grief, something which rang true for me. I like how the Walsh stories link but can be read in their own. Marian Keyes has an engaging way of writing, I’m not into make up or the kind of world that Anna lives in but I still found myself really wanting her to do well in her pitch for Formula 12. Worth a read. You might need a tissue though. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1677949779", "review_id": "1677949779", "date": "Aug 04, 2020", "rating": 4, "user_name": "Bridget Bailey", "user_url": "/user/show/3790332-bridget-bailey", "text": "I love this author so I have read a ton of her books. This was the last book in the series of the Walsh family that I had to read. I read them out of order which is not a big deal since the author fills you in on what happened and recaps everything. This Irish family is great and very entertaining. She packs a lot in her books and they are long but it doesn't feel like she fills them with a lot of description, she just packs a lot into her books. This was yet another book that was super enjoyable to read as you can see it was almost 500 pages that I finished in 4 days. Highly recommend this book and all of her books especially this series!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3551431955", "review_id": "3551431955", "date": "Oct 05, 2020", "rating": 5, "user_name": "Nonhlanhla Mbotini", "user_url": "/user/show/67626195-nonhlanhla-mbotini", "text": "I'm probably usually bias when it comes to Marian Keyes but I completely enjoyed this book. It wasn't what I'd expected but was so relatable. Grief, grief is something else... I cried my eyes out part 2 moving forward and it was so unexpected. 200 pages in moving forward I expected a happily ever after, a fairytale for Anna but it didn't happen as expected. I cried with her, felt her pain. Her heartache. Grief is something else 💔Mum Walsh and Helen were my fave... Completely enjoyed the email exchanges. The Mr Big case 😅 felt like a soap opera, something made up. I love Marian Keyes, enjoyed this book ❤️📚", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3669008816", "review_id": "3669008816", "date": "Nov 29, 2020", "rating": 4, "user_name": "Clare ", "user_url": "/user/show/64933784-clare", "text": "I think I probably read this about 15 years ago, but re-listening to the audiobook was a joy. Marian Keyes shows why she is the queen of warm and funny women's fiction. I loved her and secretly wanted to be Irish ever since I read Lucy Sullivan is Getting Married as an impressionable 12 year old. I love how she cloaks serious subjects with a deft touch. The only slightly weird thing is the character Anna in this book bears very little resemblance to how she's portrayed in the other sister's books (how do I remember that, I read them in the early 2000s). Still a cracking story.Now I want to listen to all her books being read in a lovely Irish accent.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/138494603", "review_id": "138494603", "date": "Jan 04, 2011", "rating": 4, "user_name": "Audrey", "user_url": "/user/show/202754-audrey", "text": "This is the 4th book in Walsh sisters series by Marian Keyes and of course I loved it. This is Anna Walsh's story and like the other books in this series the story of this Irish family and all their comings and goings is both hilarious and sometimes deeply sad.This book has a little bit of a twist to it that I caught onto pretty early on in the story but that didn't take away from the story.This book deals with death, some addictive behavior, infidelity, but most of all it is a story of love and how it appears in so many forms in each of our lives each day.I loved the book.", "num_likes": 0, "sort_order": "default", "shelves": ["4th-book-in-series", "4th-in-series", "families", "women"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2711239704", "review_id": "2711239704", "date": "Feb 20, 2019", "rating": 4, "user_name": "Rachael Hewison", "user_url": "/user/show/7085684-rachael-hewison", "text": "This was by far the best of the series so far.Anna is the most likeable of all the sisters so far. She is easy to identify with and her relationship with Aidan felt like the most realistic of all the romances so far. Her interactions with her sisters were great and it was nice for Rachel and Luke to play quite a big part in the story.The main weakness was definitely the side story of Helen and her private detective investigations. Although it added a bit of light relief if it had been stripped out the book would have been so much more effective.A really great and poignant book.", "num_likes": 0, "sort_order": "default", "shelves": ["chick-lit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2944580167", "review_id": "2944580167", "date": "Oct 26, 2019", "rating": 4, "user_name": "Donna Ann Sutcliffe", "user_url": "/user/show/18863742-donna-ann-sutcliffe", "text": "I found this book in a charity shop and as I have not read any by this author I thought I would give it a go. I did not realise it was book four of this zany Irish family. I started reading in my lunch time before I realised what was going on. Heart breaking half way through I did shed quite a few tears. This is a beautiful written book on grief and loss. The harsh reality that life goes on for everyone around you whilst life stands still for our main character. Sad and funny this book is a rollercoaster of emotions.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3308128938", "review_id": "3308128938", "date": "May 13, 2020", "rating": 4, "user_name": "Satoko", "user_url": "/user/show/111031750-satoko", "text": "Overall, the ratings were quite good and I read one of the reviews which said it was a 'pageturner' so out of curiosity I started reading it. Boom! Yeah it really was a pageturner. I agree. It was beyond my imagination putting myself in the protagonist's shoes though I would say this book taught me a life lesson. I didn't expect this book to be that thick so I wondered how long it'll take for me to finish it however now is the best time being absorbed in reading, and I suppose this book made me realise that. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3429826031", "review_id": "3429826031", "date": "Jul 12, 2020", "rating": 3, "user_name": "Traci", "user_url": "/user/show/1196956-traci", "text": "Ohhhhhh there’s so much I wanted to love about this book. It started off really engaging and endearing. And then it lost me with all the medium/psychic exploration. BUT, Anna’s grief and denial were palpable so the medium stuff was understandable, but not my thing. There were too many characters to keep up with (maybe I would have been familiar had I read the previous books?). A lot going on with the sisters and really too many subplots. There were some laugh out loud and fun moment, but overall too much going on. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3786538908", "review_id": "3786538908", "date": "Jan 21, 2021", "rating": 2, "user_name": "I R", "user_url": "/user/show/110320542-i-r", "text": "I really wanted to like this book because I grew fond of Anna in the previous book in the series 'Angels'. The first part of the story I initially enjoyed a great deal. Possibly because we were reinitroduced to the sisters from the first three books. Unlike others, I never guessed why Aiden didnt call Anna and never suspected the real reason. But by part two we all know why Aiden has not replied and this took the shine off part one for me because I found it so inplausible. I found part two so slow and tedious that I just could not be bothered to finish it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3905943592", "review_id": "3905943592", "date": "Mar 29, 2021", "rating": 3, "user_name": "Jillian Woolmer", "user_url": "/user/show/91234797-jillian-woolmer", "text": "Another enjoyable Marian Keyes book. I had not read any of the Walsh Family series and still found the book easy to follow. Some of the same County Clare characters with New Yorkers as well. Great to see Knockavoy still got a mention. Took me until half way through the book before I knew what the title really meant. I had thought that her husband had left her mysteriously - until then and that she had been attacked. I found the print size a bit of a challenge as it was so large. The book was quick to read though. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3972372769", "review_id": "3972372769", "date": "May 04, 2021", "rating": "", "user_name": "Tamsin Wort", "user_url": "/user/show/124324912-tamsin-wort", "text": "I cried a couple of times reading this book. Anna's angst every time she realised Aidan was dead really resonated with me. I mourned his death with her, felt her anger at Janie and Aidan and Aidan's mother Dianne and understood why she didn't want to speak to Kevin. I adored that she excelled at work and used her dealing with Aidan's death to (albeit unknowingly) better herself. She deserved the Forumla 12 account! She was incredible! I also loved that despite her pain, she supported Jaqui and thought the ending was super realistic but special. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4400096485", "review_id": "4400096485", "date": "Dec 29, 2021", "rating": 2, "user_name": "Nancy", "user_url": "/user/show/51198248-nancy", "text": "This book started out great, really had my attention....then I began to notice that each day for the main character was like groundhog day and I began to lose interest in her story. What really did me in were the e-mails she was receiving from her mother and sister(s) and I found myself asking \"why?\" I realize that this is book #4 in the Walsh Family, maybe if I had read the first 3 I might have enjoyed it more. I can't see myself reading those other books, unfortunately the Walsh Family just doesn't hold my attention. I would recommend to others that they start reading at #1.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2226175903", "review_id": "2226175903", "date": "Dec 25, 2017", "rating": 1, "user_name": "Jyotsna Agrawal", "user_url": "/user/show/15762207-jyotsna-agrawal", "text": "I liked the sample so i bought the book on sale. By reading reviews, i got to know that there is interesting twist around page 200. Although i had started losing interest by page 150 but kept going because of interest in twist. But when i got to know the twist , it was not good enough for my interest. After reading some more pages, i am getting bored now after page 300 so leaving it.I should have guessed the twist by book's name or some more reviews. My bad :(", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2293270136", "review_id": "2293270136", "date": "Sep 03, 2018", "rating": 5, "user_name": "SK", "user_url": "/user/show/77504070-sk", "text": "This book resonated so hard with me I had a tough time in some bits - where she describes the grief and the shock. She's humorous, her vernacular is great to read, the warmth in her characters comes through and you want to know more about the characters - she leaves you wanting more.The story with her mum warring with the woman with the poopy dog, her sister and her brush with the Mafia, and her own story with the cosmetic PR, all of these make for a delightful read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2600727683", "review_id": "2600727683", "date": "Nov 27, 2018", "rating": 5, "user_name": "Soph", "user_url": "/user/show/10981465-soph", "text": "Wow. What an emotional roller-coaster. Hilariously funny and heart breakingly sad. There were moments where I literally laughed out loud and other moments where I had tears in my eyes. I loved the Walsh family, particularly mum and Helen. Have loved Marian Keyes for a while but will definitely be on the look out for her books in the future. Would definitely recommend to anyone looking for an emotional roller-coaster. 9/10", "num_likes": 0, "sort_order": "default", "shelves": ["2018"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2719897501", "review_id": "2719897501", "date": "Feb 18, 2019", "rating": 4, "user_name": "Christin Natalia", "user_url": "/user/show/4563186-christin-natalia", "text": "I did not expect anything from this book, but it turned out to be a compelling read. It is written in easy-to-read style. At first, what kept me going was a curiosity as to what actually happened to Anna. As it progressed, it got deeper than that. I don't want to spoil anything so I'll leave it just that. It consists of mixture of humor, sweet love, sadness, despair, grief, success, just everything we find in daily life, each with the right portion.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2491183902", "review_id": "2491183902", "date": "Apr 14, 2019", "rating": 3, "user_name": "Juniper", "user_url": "/user/show/11557375-juniper", "text": "These days my thoughts wander and transform into scenarios involving my own life when I read novels, so naturally I wept a lot reading this because I imagined what it would be like for me, if what happened to Anna, happened to me. That is also why it took me such a long time to finish it - I could not bring myself to continue reading after the first 180 pages or so because it hurt too much. I picked it up again yesterday, and it feels good to have finished it today.", "num_likes": 0, "sort_order": "default", "shelves": ["chick-lit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3183794602", "review_id": "3183794602", "date": "Feb 09, 2020", "rating": 2, "user_name": "Pam Coll", "user_url": "/user/show/27986186-pam-coll", "text": "I started out loving this book but quickly tired of the manic circumstantial detail obscuring every movement of the story... So many love Marian Keyes books, and I think she is a very loveable person, having heard her in an interview. I may go back to this one day, but had to abandon it because it was too slow, too enigmatic, too \"teasing\" of things-t0-come... Sorry. I will try to read another title because she is so popular. ", "num_likes": 0, "sort_order": "default", "shelves": ["abandoned-it"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3185728764", "review_id": "3185728764", "date": "Feb 20, 2020", "rating": 3, "user_name": "Bethany Bloggs", "user_url": "/user/show/63336601-bethany-bloggs", "text": "I enjoyed this! It took me a while to properly get into it but In the end I enjoyed the story. The twist took me completely by surprise and changed the entire tone of the book. Definitely a product of the early 2000’s but still relevant enough for me to keep reading. When I first started, I didn’t think I would finish it, but now I’m thinking I’d like to read more about these crazy Walshes and see what else Marian Keyes has to offer ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3226585824", "review_id": "3226585824", "date": "Mar 17, 2020", "rating": 4, "user_name": "Joy Harris", "user_url": "/user/show/50152139-joy-harris", "text": "Very interesting - different than I usually read. The plot has quite surprising twists and the author is quite often burst-out-laughing hilarious. Though it is 593 pages, I flew through it because it's so interesting. The character descriptions are amazing and the plot sucks you right in. The off-colour language and mindset was at certain times disturbing, but over-all, I'm glad I read it. It is a brilliant education as we walk Anna's journey with her.", "num_likes": 0, "sort_order": "default", "shelves": ["fiction"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3281386603", "review_id": "3281386603", "date": "Apr 27, 2020", "rating": 3, "user_name": "Elizabeth", "user_url": "/user/show/52511471-elizabeth", "text": "While this was a great book, it just felt a little drawn out. There are five daughters in the Walsh family. This book focuses on Anna, but includes all the sisters and their current situations (which may be partly why the book is so long). Anna spends weeks recovering in her family home in Ireland; she then returns to her highly demanding job in NYC where she is forced to come to terms with recent events in her life. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3846471833", "review_id": "3846471833", "date": "Feb 18, 2021", "rating": 3, "user_name": "Trudy Roy", "user_url": "/user/show/110535444-trudy-roy", "text": "Follows Anna’s journey in the first year after her husband dies. For the first half of the book, since Anna doesn’t admit it, you don’t know it either. You think that he’s left her. Some insightful thoughts:- remember that the world is still full of people you love. - you don’t truly start to heal until you’ve lived a year and a day without them. - it’s not a life interrupted. It’s a life completed. - their life has ended. Yours has not. ", "num_likes": 0, "sort_order": "default", "shelves": ["2014"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3918487036", "review_id": "3918487036", "date": "May 30, 2021", "rating": 3, "user_name": "Mintzis", "user_url": "/user/show/2036256-mintzis", "text": "Chick lit with a twist. The thing about chick lit is that no issue is so bad it can’t be overcome in 350 pages or a year in the life of the characters. It is escape literature of the highest order. This held my interest. In writing this review, months after finishing the book I’ve forgotten much of the book. Nevertheless I remember being entertained. And I also found myself mixing Walsh up with Keyes. The conclusion: Now I have two authors to look for when I want reliable chick lit. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4164174945", "review_id": "4164174945", "date": "Aug 19, 2021", "rating": 5, "user_name": "Fleurine", "user_url": "/user/show/113282546-fleurine", "text": "This book felt like a warm mug of coffee in your hands. It was a beautiful tale of grief, of how life moves on even when you don't want it to. I like that Keyes managed to avoid the usual cliches of grief or have Anna find relief in someone else, in the end she found it in herself. There was such a natural progression through the stages of grieving someone and it is a book I shall definitely return to once I've finally stopped crying.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4262628044", "review_id": "4262628044", "date": "Sep 29, 2021", "rating": 4, "user_name": "Lucía Xochimitl", "user_url": "/user/show/130754981-luc-a-xochimitl", "text": "I just can´t believe all the things that happen to the Walsh girls. Is life really like that? Unpredictable, tragic, surprising and full of consequences? I guess it is, it may sound incredible, but every situation seems possible, and I sure there are a lot of families that at least have one of the problems that happen to them. Surprisingly, this is a nice collection of warm and really funny books. Kudos to Marian Keyes. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4339519406", "review_id": "4339519406", "date": "Nov 15, 2021", "rating": 4, "user_name": "Lyndsay Nattan", "user_url": "/user/show/100212036-lyndsay-nattan", "text": "I picked this up on what started to be a quiet night shift, somebody had left it in the tea room (we have take a book, leave a book thing going on) and I thought ahh it looks quite long for me, but I got through it really quick (for me) as I couldn’t put it down. I got lost a couple of times with all the characters but probably doesn’t help I haven’t read the other books about the Walsh family. Overall enjoyed it ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4437527244", "review_id": "4437527244", "date": "Jan 03, 2022", "rating": 4, "user_name": "Rose Moore", "user_url": "/user/show/38046727-rose-moore", "text": "When I picked this up, I wasn't actually aware that it was part of the same series as Rachel's Holiday, but I was thrilled to find that out! I love Keyes' books, they are charming, heartfelt, and deal with serious topics (beyond the usual rom-com stuff) that many books in the same style would avoid. The book has one big 'twist' - and it's something that is fairly easy to guess before it is revealed, but isn't obvious from the very start, which is actually quite satisfying! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2060813415", "review_id": "2060813415", "date": "Jul 24, 2017", "rating": 2, "user_name": "Munira", "user_url": "/user/show/33744726-munira", "text": "Yup, I'm only giving it two stars for the great sense of humor the author has. I laughed out loud while reading which is something I don't usually do!But, this book is a mess! (as a lot of reviewers said).I skipped most of part two. And the emails! It just adds unnecessary pages to the book. It took a lot of time to finish it since it's 420 pages long but there's no freaking story :) ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1913091102", "review_id": "1913091102", "date": "Sep 16, 2017", "rating": 2, "user_name": "Els", "user_url": "/user/show/6841949-els", "text": "Disappointing. Sad.I keep coming back to MK because I loved Sushi for Beginners, and Lucy Sullivan, but some of the others have been boring and disappointing and I haven't liked the characters or the supernatural fantasy themes. I'm hoping she'll bring out another one that I'll like, because when they're good, they're very good. But that's just my opinion...", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2149954817", "review_id": "2149954817", "date": "Oct 30, 2017", "rating": 1, "user_name": "Aimee", "user_url": "/user/show/58020105-aimee", "text": "I normally love Marian Keyes books. I first started reading them when I was a teen. I fell in love with her style of writing and her books. However I just couldn’t get into this book. It took to long to know what happened to Her partner. I gave it a good shot got up to 255 but I couldn’t go further. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2181857305", "review_id": "2181857305", "date": "Nov 15, 2017", "rating": 5, "user_name": "Judi Mckay", "user_url": "/user/show/31417652-judi-mckay", "text": " I had forgotten how much I love Marion Keyes. What a great book this was, a study of grief that was both poignant and funny at the same time and spot on. I loved how I never guessed what was going to happen at any point in the story and enjoyed all the email exchanges. I read this on holiday and sped through it. Brilliant.", "num_likes": 0, "sort_order": "default", "shelves": ["loft-reading"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2188897864", "review_id": "2188897864", "date": "Nov 19, 2017", "rating": 4, "user_name": "Plum-crazy", "user_url": "/user/show/30347735-plum-crazy", "text": "The Walsh sisters....& Mum...are back! This is Anna's tale & although it doesn't take long to work out what has happened to Aiden, it's a while before your suspicions are actually confirmed. It's funny (I found the emails from Helen especially amusing), it's heart warming & it's sad - a great book - just what I've come to expect from this author. ", "num_likes": 0, "sort_order": "default", "shelves": ["feelgood-fluff-a-touch-of-romance"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2258249911", "review_id": "2258249911", "date": "Feb 10, 2018", "rating": 3, "user_name": "Maria", "user_url": "/user/show/2753319-maria", "text": "Keyes did a wonderful job conveying the desperate grief of Anna. I rooted for her the entire (lengthy) book. The secondary stories of Anna's mother and sister kept the book from being too depressing. [Anna's mother's emails to Anna were a riot.] I was a little disappointed by the very, very end ... eye rolling stuff, in my opinion. But, overall, an enjoyable chick lit read with some heft. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2591138070", "review_id": "2591138070", "date": "Nov 16, 2018", "rating": 4, "user_name": "Danielle", "user_url": "/user/show/15981976-danielle", "text": "I don’t have a whole lot to say about this one. It was a decent, easy read about moving forward after tragedy and the stages of grieving. There didn’t seem to be any deep hidden messages which is typical of this type of book. Surprisingly for a book about death it was light and had an upbeat feel to it. Another easy read to add to my list. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2666746990", "review_id": "2666746990", "date": "Jan 09, 2019", "rating": 5, "user_name": "KylieAtkinson", "user_url": "/user/show/34132545-kylieatkinson", "text": "I forgot how much I love Marian Keyes. The Walshes - the crazy family who stick by each other and supply us with endless laughs. I’ve read all the previous books years ago and it all came back to me. I’m looking forward to the last daughters story (Helen the private investigator). Where this was a poignant story with a side order of funny, I’m sure the next one will be hilarious.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2761224148", "review_id": "2761224148", "date": "Apr 10, 2019", "rating": 5, "user_name": "Nancy Boyd", "user_url": "/user/show/5945477-nancy-boyd", "text": "This series just gets better and better. I'm amazed by Keyes' ability to weave a story that is hilarious, rolling on the floor one minute and poignant, between the eyes truth/real life that has me bawling my eyes out the next. 4 out of 5 books in, and my amazement hasn't worn off. Book 5 is on order. This series is a chick lit Must Read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2918542398", "review_id": "2918542398", "date": "Jul 31, 2019", "rating": 5, "user_name": "Pauline Pedley", "user_url": "/user/show/84629817-pauline-pedley", "text": "A MUST read. Although I loved this book (and I was given it) I didn’t realise until near the end that it’s part of a three book series - I’ll be buying the others. This one will have you crying then laughing then crying again. I’ll be reading more by this author.And YES it was a real life paper (with lots of pages) book - you know, one of the old fashioned things that sit on a shelf!!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2915325866", "review_id": "2915325866", "date": "Jul 31, 2019", "rating": 5, "user_name": "Natalie Liddle", "user_url": "/user/show/2715513-natalie-liddle", "text": "Emotional rollercoaster of a book. Sad, touching, heartwarming, everything all in one. I’ve laughed and cried at this book. Loved the style of writing and felt as if the author was talking to me and the characters wereVery vividly depicted and I loved them all. Ended in tears but happy tears. Very very lovely book ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2873066424", "review_id": "2873066424", "date": "Sep 24, 2019", "rating": 4, "user_name": "Louise", "user_url": "/user/show/5738322-louise", "text": "I always found Anna and Helen the more interesting of the sisters , although Rachel’s Holiday is still my favourite of the series. Very good plot although the ‘twist’ (can we even call it that) at the beginning was predictable , the one in part 3 was much more of a surprise. Very emotional reading . ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3124451476", "review_id": "3124451476", "date": "Jan 05, 2020", "rating": 5, "user_name": "Emma Bampton", "user_url": "/user/show/107006920-emma-bampton", "text": "Anna was always my favourite of the Walsh family, so I was super excited when I saw there was an ‘Anna’ book. Regarding the reveal half-way through, I knew something was coming. I didn’t expect it to be what it was and started crying on a packed tube on my way to work. It was just so simply revealed.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3089934371", "review_id": "3089934371", "date": "Jan 13, 2020", "rating": 5, "user_name": "Nu Suhaili", "user_url": "/user/show/43261045-nu-suhaili", "text": "Truth: when I found out about Aidan, I couldn't even touch the book for nearly a week. It was an awful thing to do after having us fall in love with the character. I get it, it made the book so much more compelling but I cursed the author a lot in that week. But being able to feel every moment with Anna was a wonderful journey and the ending couldn't be more lovely.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3197441286", "review_id": "3197441286", "date": "Feb 19, 2020", "rating": 5, "user_name": "Stephanie", "user_url": "/user/show/110336803-stephanie", "text": "I read this about 8 years ago and have read it at least once a year since. I adore this story. Emotionally I've never been so broken - this is a story that takes your heart in it's hands, pummels it and then slowly massages it back to health. I don't want to leave spoilers. I just want to say, please read this. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3886548816", "review_id": "3886548816", "date": "Mar 20, 2021", "rating": 4, "user_name": "Terry", "user_url": "/user/show/5873498-terry", "text": "For me, this was Ms. Keyes best one yet! I just love the trials and tales of the Walsh sisters. Quite honestly, this would have gotten a 5, but for a weird twist. Having said that, Ms. Keyes basically kept the drama going for the main story and several subplots – all a hoot considering the novels serious subject. Consider me a Fan Boy of M.s Keyes.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3905604350", "review_id": "3905604350", "date": "Mar 23, 2021", "rating": "", "user_name": "Julia", "user_url": "/user/show/8667625-julia", "text": "Didn't realize this was part of a series! I picked this up in a coffee shop book exchange expecting something light hearted, funny, and quirky. Even though this is a novel about death & despair, it still managed to be all 3 of those things! Marian had me laughing out loud at several parts, and tied it up nicely in the end. Not dying to read the rest of this series though. ", "num_likes": 0, "sort_order": "default", "shelves": ["read-2021"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3976409314", "review_id": "3976409314", "date": "May 22, 2021", "rating": 3, "user_name": "Deb", "user_url": "/user/show/26817182-deb", "text": "I read this book many years ago and liked this and all the other Walsh family stories enough to revisit this in audiobook format. Its better reading the actual book though. The Irish accent is good but the boston accent sounds like a bad caricature and the emails don't translate well into audiobook format.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4011679844", "review_id": "4011679844", "date": "May 24, 2021", "rating": 5, "user_name": "Carol Sandford", "user_url": "/user/show/41997883-carol-sandford", "text": "Wow! What an intense and absorbing story. I can't even imagine losing someone so close to me, but this book took you through every painful, heart wrenching moment of it. But it wasn't just about loss, it was about a madcap Irish family that was there to lighten the load. Brilliantly funny, sad and a down right good story.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4052085936", "review_id": "4052085936", "date": "Jun 14, 2021", "rating": 4, "user_name": "Jodi", "user_url": "/user/show/932702-jodi", "text": "It seems as I read more of Keyes books about the Walsh family, she has definitely grown as a writer. Her first few books were very \"fluffy,\" whereas this book even though it's classified as chick-lit to me, it had more meat. The reader doesn't know why Anna is so injured until halfway through the book and what has happened to her husband. So sad!!", "num_likes": 0, "sort_order": "default", "shelves": ["chick-lit", "books-in-a-series"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4361783416", "review_id": "4361783416", "date": "Nov 29, 2021", "rating": 4, "user_name": "Jamie Klingler", "user_url": "/user/show/23336937-jamie-klingler", "text": "Re-read the entire Walsh family series in anticipation of the newest book coming out in 2022. They are a calming force in my life. When lots of other things are spiralling, I can run and listen to these and laugh and cry with them. In this one, Anna's fear and grief are quite painful at points, but it's my favourite series for a reason...", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4547386074", "review_id": "4547386074", "date": "Feb 13, 2022", "rating": 5, "user_name": "Rachel Cohen", "user_url": "/user/show/135366462-rachel-cohen", "text": "This book lures you in with a false sense of what you think happened to what actually happened. When you think you have it figured out and have guarded your heart it rips it out and stomps it into a million pieces. This book makes you question love and if the worst thing happens imaginable, could you push yourself forward? ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2085252117", "review_id": "2085252117", "date": "Aug 07, 2017", "rating": 4, "user_name": "Mari", "user_url": "/user/show/1467875-mari", "text": "I didn't know where this story was going. We didn't find out how Anna was hurt and what happened to Aidan till about a third of the book! Then the story started to fall in place. It's sad, it's funny, romantic and long. Her mother is quite a unique character, as well as her sisters.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2365708111", "review_id": "2365708111", "date": "Apr 18, 2018", "rating": 3, "user_name": "Stacy", "user_url": "/user/show/349603-stacy", "text": "Haven't read any of her other Walsh Family books. I was ready for a beach read type book and came across this one. It did have an interesting twist in the middle, but felt too long and drawn out to be an easy read page turner.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2455079631", "review_id": "2455079631", "date": "Jul 12, 2018", "rating": 5, "user_name": "Maggie", "user_url": "/user/show/8012470-maggie", "text": " Anna Walsh feels like she is a wreck. Between her stressful job, her crazy family and even more crazy friends life is a total zoo for her. Her one great joy was meeting her husband Aidan.... until tragedy strikes. This book is both very funny and very sad but still a jolly good read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2477226138", "review_id": "2477226138", "date": "Jul 31, 2018", "rating": 4, "user_name": "Jill", "user_url": "/user/show/33334460-jill", "text": "This book was sad, and funny at the same time. Loved all the people in the book, and the emails between the sisters, and mother and daughter. I like the idea of the butterfly, and totally relate and believe. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2514904188", "review_id": "2514904188", "date": "Sep 01, 2018", "rating": 3, "user_name": "AB", "user_url": "/user/show/86161767-ab", "text": "Generally books always have kind of the same stories where as this one you think it's one of those books, but when you least expect it there is a big turning in the story that you could of actually knew from the beginning but that's what makes the writing of this book great!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2585846760", "review_id": "2585846760", "date": "Nov 18, 2018", "rating": 5, "user_name": "Lisa", "user_url": "/user/show/76944121-lisa", "text": "I absolutely loved this book...but, it was SO sad. I was not expecting a sad story at all, and then about 100 pages in, it gets SUPER tragic, and because I was already invested, I had to get through another 300+ pages of sad stuff...be warned, this book is sad. Powerful, funny, inspiring and sad.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2699765710", "review_id": "2699765710", "date": "Feb 06, 2019", "rating": 3, "user_name": "Anna", "user_url": "/user/show/91962514-anna", "text": "This is a lovely read. Yes, the genre could be considered ‘chick lit’ but the book still has some very poignant sections and made me think a lot about grief and how different people express it. Despite the subject matter it still made me chuckle at times and most of the characters I liked. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2679941819", "review_id": "2679941819", "date": "Mar 02, 2019", "rating": 4, "user_name": "Lynn", "user_url": "/user/show/92226406-lynn", "text": "Although I was very upset where Anna found Aiden, I could see myself having the same thoughts and doing some of the things she did to get him back.Marian you never disappoint,I can't wait to read Helen's story The Walsh family #5The Mystery of Mercy Close", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2773855903", "review_id": "2773855903", "date": "Apr 03, 2019", "rating": 3, "user_name": "Keri Chumbley", "user_url": "/user/show/3781928-keri-chumbley", "text": "I picked this up in the coffee shop of our resort in Mexico over Spring Break and enjoyed it way more than I thought I would. I had no idea it was the fourth book in a series. Anna was easy to like and I laughed out loud at some of the interactions with her family.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2813372469", "review_id": "2813372469", "date": "May 17, 2019", "rating": 2, "user_name": "Charlotte", "user_url": "/user/show/4203919-charlotte", "text": "Made it about halfway before abandoning. The plot felt like it was going nowhere fast and I wasn't intrigued enough to keep reading (I didn't realize it was a series which was an oversight on my behalf.)", "num_likes": 0, "sort_order": "default", "shelves": ["abandoned"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2855520754", "review_id": "2855520754", "date": "Jun 12, 2019", "rating": 5, "user_name": "Alice", "user_url": "/user/show/28974698-alice", "text": "A short read, very interesting about loss of a loved one. Like how Marian Keyes makes Anna main character and family and friends all become Anna's support group. Sad and funny too. Thanks Marian Keyes writing this story.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2872616609", "review_id": "2872616609", "date": "Jun 28, 2019", "rating": 3, "user_name": "Emma Dickens", "user_url": "/user/show/64513863-emma-dickens", "text": "I always enjoy Marian Keyes - guilty pleasure of mine. Not the best book ever written but I do enjoy the characters and find Mariana writing style engaging, humorous and, at least when it comes to the characters emotional reactions, believable.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2913996373", "review_id": "2913996373", "date": "Jul 28, 2019", "rating": 4, "user_name": "Eva", "user_url": "/user/show/80009113-eva", "text": "This book surprised me. I was scared it was going to be a sappy love-story, but it turned out to be both sad, funny and heartwarming. A very easy read, and a lovely story. Perfect for a summer holiday, when my attention span is shorter and I want something that is pure entertainment :)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2993778143", "review_id": "2993778143", "date": "Sep 28, 2019", "rating": 4, "user_name": "Ana Hantt", "user_url": "/user/show/101857524-ana-hantt", "text": "As always, Marian Keys rocks! I love her books and the adventures of the sisters Walsh. I can't say this is my favorite book of her because the main topic in this story doesn't speak to me personally, but she certainly has insightful and inspiring moments.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2942561169", "review_id": "2942561169", "date": "Nov 12, 2019", "rating": 5, "user_name": "Sammie", "user_url": "/user/show/101045644-sammie", "text": "Enjoy marian keyes books and have always loved Rachels holiday but this is alot better, very well written and extremely sad in parts but hilarious in others. Well worth a read especially if youve enjoyed her other books", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3139399100", "review_id": "3139399100", "date": "Jan 12, 2020", "rating": 5, "user_name": "Yelena L", "user_url": "/user/show/108638024-yelena-l", "text": "One of Marian Keyes more serious novels. As many contain humor and chic-flic style genre, this one really touches well on psychological factors and a true insight into one’s thoughts and feelings going through loss and grief. A wonderful suspenseful and also twisting must read! ", "num_likes": 0, "sort_order": "default", "shelves": ["favorites"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3139978519", "review_id": "3139978519", "date": "Jan 25, 2020", "rating": 4, "user_name": "Louise Borg", "user_url": "/user/show/24553875-louise-borg", "text": "Excellent book. I really enjoyed the way the main protagonist's character jumps out of the page. I loved the way the issue of grief was dealt with. The humour, the pace of the story and the ending. It was the first time I read Marian Keyes but will certainly be trying more of her books.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3165210510", "review_id": "3165210510", "date": "Jan 28, 2020", "rating": 5, "user_name": "Michelle", "user_url": "/user/show/19523103-michelle", "text": "I can't remember when I read this, but I know I did so I must mark it as such. I read a bit of the preview and what I do know is I could read all these books again and be just as entertained as the first time!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3282700913", "review_id": "3282700913", "date": "Apr 15, 2020", "rating": "", "user_name": "Sharon Falduto", "user_url": "/user/show/52901639-sharon-falduto", "text": "Anna has suffered through a terrible accident, and after some time recouperating with the boisterous Walsh clan in her homeland of Ireland, she is anxious to go back to New York City to find, though means including psychics, churches, and self help books, something important she has lost.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3344889992", "review_id": "3344889992", "date": "May 19, 2020", "rating": 3, "user_name": "Jill Jaracz", "user_url": "/user/show/22526674-jill-jaracz", "text": "Didn't read the previous 3 Walsh books, so I found it hard to keep track of everyone. Nicely structured--kept me wondering until the first reveal. Almost too many side stories (but maybe not if you'd read the others). Good read overall.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3375441796", "review_id": "3375441796", "date": "Jun 05, 2020", "rating": 4, "user_name": "Rachel Kleynhans", "user_url": "/user/show/38974295-rachel-kleynhans", "text": "Another great Marian Keyes book. I’m really enjoying this series. This book deals with overcoming grief, in a very emotional, but at times very funny way. I laughed, I teared up. It was all manor of emotions. I do love that Walsh family!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3332173318", "review_id": "3332173318", "date": "Jun 10, 2020", "rating": 4, "user_name": "Bethany", "user_url": "/user/show/2066403-bethany", "text": "By far my favorite Walsh family book yet. I guessed a couple of the twists, but I don't think they were meant to be super hidden, but also loved the tone and the pace and the fun workplace and the ending. Lovely.", "num_likes": 0, "sort_order": "default", "shelves": ["2020-read"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3334995347", "review_id": "3334995347", "date": "Jun 11, 2020", "rating": 4, "user_name": "Ann Rapice", "user_url": "/user/show/37778395-ann-rapice", "text": "This was the 4th book involving the Walsh sisters which I didn’t realize but I still really enjoyed it. Will definitely go back and read the others. I love the twists and turns. It was like a quirky mystery, beach read and story of friends and lovers with an English accent. Loved it!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3437975314", "review_id": "3437975314", "date": "Jul 21, 2020", "rating": 5, "user_name": "Katy", "user_url": "/user/show/8170707-katy", "text": "I love the whole Walsh family series, but having become a widow* just over a year ago, this one in particular resonated. The description of grief in the first few chapters of Part II is the best I've read. I love Anna. She's aces.(*We weren't married, so never sure whether that's the right term)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3564188128", "review_id": "3564188128", "date": "Sep 29, 2020", "rating": 5, "user_name": "Sophie Pentland", "user_url": "/user/show/96055875-sophie-pentland", "text": "I really enjoyed this book. I listened to the audiobook at any possible moment and was a bit sad when it ended! With recently loosing a loved one I felt a connection with Anna. I really enjoyed her life story as the book went on. Would recommend. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3603521101", "review_id": "3603521101", "date": "Oct 19, 2020", "rating": "", "user_name": "Kathrin Lake", "user_url": "/user/show/2778844-kathrin-lake", "text": "I adore all of Keyes books. Her sense of humour is a breath of fresh air and really laugh out loud funny, but she also tackles dark and scary subjects, in this case grief and guides us gently back to the light. Long live the Walsh sisters in all their F**d up glory. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3828299313", "review_id": "3828299313", "date": "Feb 09, 2021", "rating": 1, "user_name": "Bluestaremel", "user_url": "/user/show/90613278-bluestaremel", "text": "Long live the patriachate! At first I thought entertaining. Then I was confused, mhm women reduced to their looks. But after the main character was making fun policies against sexualized violence I got annoyed. So much for gender equality in the 21st century. Well done!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3810397847", "review_id": "3810397847", "date": "Feb 16, 2021", "rating": 4, "user_name": "Zeenat Patel", "user_url": "/user/show/51970151-zeenat-patel", "text": "Once again, Marian Keyes has stolen my heart. This book definitely ranks in the top 3 books by this amazing author. The writing style and character development is what I enjoy the most. The lead female character, Anna, feels like a close friend.This book focuses on loss, grief, the meaning of love in all definitions of the word and largely on acceptance.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2622812711", "review_id": "2622812711", "date": "May 03, 2021", "rating": 3, "user_name": "Charlotte", "user_url": "/user/show/10739132-charlotte", "text": "I was initially a bit put off by how long this book was. I did enjoy the story but it was drawn out and there was too much filler. Didn't see the point of the email bits, they were just adding unnecessary plots that didn't add to the main story, just made the book a lot longer than it needed to be.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4043062521", "review_id": "4043062521", "date": "Jun 05, 2021", "rating": 5, "user_name": "Alessandra Einecke", "user_url": "/user/show/125468496-alessandra-einecke", "text": "I read this book when I was 14, a little heavy for this age, but it definitely marked my life, romance is not my favorite genre, but this book made me feel in my skin, in my soul, in my heart, all the emotions of the characters, one of the best books I've ever read, just wonderful", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4131798916", "review_id": "4131798916", "date": "Jul 23, 2021", "rating": 4, "user_name": "eve ✨&#x1f493;", "user_url": "/user/show/138055250-eve-x1f493", "text": "I wanted to know what the feeling of loss is like, how would it be painted in the eyes of others, and I can say with full confidence that the author didn’t fail at describing or painting the picture in my head. Could she have done a better job? Yes. Am I satisfied with this? Yes. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4145090988", "review_id": "4145090988", "date": "Jul 30, 2021", "rating": 4, "user_name": "Sylvia", "user_url": "/user/show/6320112-sylvia", "text": "Marian Keyes books are always delightful. Funny, clever with great quirky characters and situations that are interesting and always resolve if not always the way you hope they will. This one didn’t disappoint. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4166426253", "review_id": "4166426253", "date": "Aug 10, 2021", "rating": 4, "user_name": "Michelle Mackenzie", "user_url": "/user/show/120309666-michelle-mackenzie", "text": "Loved this book, I never read the blurbs or any reviews for books prior to reading so this definitely left me guessing and full of surprises. A story so tragic still left me in firs of laughter and balling my eyes out at the end. It’s definitely a book that’s one of a kind. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4356514455", "review_id": "4356514455", "date": "Nov 25, 2021", "rating": 1, "user_name": "Michele Davis", "user_url": "/user/show/7532857-michele-davis", "text": "Read this out of order. Previously read Grown Ups, which I really enjoyed, surprisingly, as I didn’t think Marian Keyes was my cup of tea. When I reached the plot twist I knew it wasn’t my thing at all. Sigh! Onto something better! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4439800183", "review_id": "4439800183", "date": "Jan 02, 2022", "rating": 5, "user_name": "Tina", "user_url": "/user/show/107880207-tina", "text": "This is one of those books that stays with you long after the last word. just recently re-read this again abs loved it even more. The whole story from start to finish with the heart breaking trust was just genius writing. By far my favourite of the Walsh family too. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4516360548", "review_id": "4516360548", "date": "Feb 05, 2022", "rating": 5, "user_name": "Shirley Bennett", "user_url": "/user/show/143169264-shirley-bennett", "text": "I realized a few pages on that I had read this book quite a few years ago. I love Marian Keyes and I decided to read it again even though I have a stack of books to read for the first time. Very enjoyable, easy, fun read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/4562077605", "review_id": "4562077605", "date": "Feb 20, 2022", "rating": 5, "user_name": "Heather Lucy", "user_url": "/user/show/7582479-heather-lucy", "text": "Marian Keyes is the unparalleled queen of ‘chick lit’. That last bit is in quotes because she deals with far heavier themes than the average chick lit author. Her humour is always on point and I find myself thinking the voices of her characters - this book did that too. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/1964455262", "review_id": "1964455262", "date": "Apr 06, 2017", "rating": 5, "user_name": "Angie Renberg", "user_url": "/user/show/66677233-angie-renberg", "text": "Marian Keyes did it again! Is Anybody Out There is now at the top of my lis of all time favorites, and here I'd been thinking nothing could beat Rachels Holiday! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2003016552", "review_id": "2003016552", "date": "May 23, 2017", "rating": 3, "user_name": "Janine", "user_url": "/user/show/5731291-janine", "text": "This was an interesting read as I was never sure where it was headed but it was very long and I didn't connect emotionally with the characters.", "num_likes": 0, "sort_order": "default", "shelves": ["chick-lit"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2045640820", "review_id": "2045640820", "date": "Jun 30, 2017", "rating": 5, "user_name": "Shai", "user_url": "/user/show/3575857-shai", "text": "4.5 ratingsA fantastic combination of laughter and tears! ", "num_likes": 0, "sort_order": "default", "shelves": ["romance", "contemporary", "chick-lit", "fave-2017"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2058219130", "review_id": "2058219130", "date": "Jul 30, 2017", "rating": 4, "user_name": "Rebecca jones", "user_url": "/user/show/32280997-rebecca-jones", "text": "Loved Marian Keyes when I was in my 20's so I was worried that this wouldn't live up to my memories, but it exceeded my expectations. Sooo funny and so sad at the same time, absolutely loved it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2088175658", "review_id": "2088175658", "date": "Aug 10, 2017", "rating": 5, "user_name": "Dona.Stella", "user_url": "/user/show/69569653-dona-stella", "text": "I only read this book from Walsh family series and It can stand alone and this story is really beautiful and touching about Anna's journey to accept the truth and move on with her life .", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2018775991", "review_id": "2018775991", "date": "Aug 17, 2017", "rating": 5, "user_name": "Carrie-Ann Huelin", "user_url": "/user/show/65185513-carrie-ann-huelin", "text": "I really enjoyed this, connected with all the characters really well. Perfect mix of humour and more serious emotions throughout. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2131296563", "review_id": "2131296563", "date": "Sep 21, 2017", "rating": 5, "user_name": "Kim Barrett", "user_url": "/user/show/51690575-kim-barrett", "text": "An awesome book, didn't want to put it down ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2162528502", "review_id": "2162528502", "date": "Nov 04, 2017", "rating": 2, "user_name": "billie", "user_url": "/user/show/66474666-billie", "text": "I found myself reading it just to finish it. I didnt enjoy it at all. Too many boring side stories. Just not my style, wasnt into it. Couldnt wait to be done. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2190332032", "review_id": "2190332032", "date": "Nov 20, 2017", "rating": 4, "user_name": "Helen", "user_url": "/user/show/8721382-helen", "text": "Will surely read the other Walsh Family books. A horrible situation yet still lots of laughs - everyone's family has some crazy.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2317288696", "review_id": "2317288696", "date": "Mar 09, 2018", "rating": 2, "user_name": "M", "user_url": "/user/show/75774311-m", "text": "Got bored within the first few chapters as it was more like an advertisement for beauty products.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2341747583", "review_id": "2341747583", "date": "Mar 27, 2018", "rating": 5, "user_name": "Tara C", "user_url": "/user/show/13357570-tara-c", "text": "Good stuff.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2283288405", "review_id": "2283288405", "date": "Mar 30, 2018", "rating": 5, "user_name": "Caireen", "user_url": "/user/show/46760936-caireen", "text": "My absolute favourite of the Walsh Family books. Loved it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2361166771", "review_id": "2361166771", "date": "Apr 17, 2018", "rating": 4, "user_name": "Mo F", "user_url": "/user/show/3098168-mo-f", "text": "I expected to laugh a lot while reading this, and I did. What I hadn't expected was how much it would make me cry. I'd also forgotten how much I enjoyed the hectic adventures of the Walsh family.", "num_likes": 0, "sort_order": "default", "shelves": ["library", "kindle", "read-2018"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2376478722", "review_id": "2376478722", "date": "May 01, 2018", "rating": 5, "user_name": "Helen Palmer", "user_url": "/user/show/25126722-helen-palmer", "text": "This was a re-read - loved it, all over again :-) ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2380862332", "review_id": "2380862332", "date": "May 10, 2018", "rating": 4, "user_name": "Shannon", "user_url": "/user/show/24139132-shannon", "text": "Loved the writing style. The story was captivating as well.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2420745633", "review_id": "2420745633", "date": "Jun 11, 2018", "rating": 5, "user_name": "Jeanne", "user_url": "/user/show/20635772-jeanne", "text": "I LOVED this book. Funny and heart-rending.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2455972604", "review_id": "2455972604", "date": "Jul 13, 2018", "rating": 4, "user_name": "Caroline", "user_url": "/user/show/786370-caroline", "text": "4 stars. This is my favorite one by far.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2546141792", "review_id": "2546141792", "date": "Nov 16, 2018", "rating": 2, "user_name": "Laura Sewell", "user_url": "/user/show/46978795-laura-sewell", "text": "Boring", "num_likes": 0, "sort_order": "default", "shelves": ["comtemporary-fiction"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2618833563", "review_id": "2618833563", "date": "Dec 07, 2018", "rating": 3, "user_name": "Evelyn Denherder", "user_url": "/user/show/23735352-evelyn-denherder", "text": "The first third of this book was a 5. The remainder a 2.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2722473773", "review_id": "2722473773", "date": "Feb 19, 2019", "rating": 3, "user_name": "Judith Rathbone", "user_url": "/user/show/76592149-judith-rathbone", "text": "I like her quirky books but this was sad too.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2723056636", "review_id": "2723056636", "date": "Feb 20, 2019", "rating": 4, "user_name": "Lawanda", "user_url": "/user/show/1938563-lawanda", "text": "Audiobook performed by Terry Donnelly", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2742721395", "review_id": "2742721395", "date": "Mar 08, 2019", "rating": 1, "user_name": "Katie Nicholson", "user_url": "/user/show/64178063-katie-nicholson", "text": "Mega boring", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2329693711", "review_id": "2329693711", "date": "Mar 10, 2019", "rating": 5, "user_name": "Hilary", "user_url": "/user/show/8827029-hilary", "text": "Soooooo good!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2781771563", "review_id": "2781771563", "date": "Apr 10, 2019", "rating": 4, "user_name": "Katharine Klevinskas", "user_url": "/user/show/541293-katharine-klevinskas", "text": "Totally enjoyable and absolutely funny. Rarely do I find books to be funny. This is my second by Keyes; I guess I'll read them all.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2802813279", "review_id": "2802813279", "date": "Apr 29, 2019", "rating": 5, "user_name": "Annie", "user_url": "/user/show/43575592-annie", "text": "Classic Keyes, Walsh family again, so likeable.", "num_likes": 0, "sort_order": "default", "shelves": ["e-books-read"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2838039444", "review_id": "2838039444", "date": "May 28, 2019", "rating": 5, "user_name": "Maria", "user_url": "/user/show/97860730-maria", "text": "I really enjoyed this book - emotional but also funny. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2816265207", "review_id": "2816265207", "date": "May 31, 2019", "rating": 3, "user_name": "Paul Servini", "user_url": "/user/show/2708232-paul-servini", "text": "Quite a funny book but not always easy to follow where it was going. Sometimes a bit long winded, too.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2848985839", "review_id": "2848985839", "date": "Jun 09, 2019", "rating": 4, "user_name": "Kate", "user_url": "/user/show/189602-kate", "text": "It took me a little bit to love this book, but ultimately it was a lot of fun. I liked the characters, and it was glorious to not be able to guess all the twists. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2809424891", "review_id": "2809424891", "date": "Jul 21, 2019", "rating": 5, "user_name": "Jessie Beswick", "user_url": "/user/show/85343913-jessie-beswick", "text": "Best one yet! Emotional yet soooo funny! Anna is a dream. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2882374169", "review_id": "2882374169", "date": "Aug 10, 2019", "rating": 5, "user_name": "Stacielynn", "user_url": "/user/show/94180672-stacielynn", "text": "loved this book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2947189107", "review_id": "2947189107", "date": "Aug 21, 2019", "rating": 5, "user_name": "Mel", "user_url": "/user/show/93251772-mel", "text": "My new favourite book, the pacing is sensational and I love the way Marion has captured the emotional aspects", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2977103053", "review_id": "2977103053", "date": "Sep 14, 2019", "rating": 5, "user_name": "Susan", "user_url": "/user/show/66070187-susan", "text": "Excellent!", "num_likes": 0, "sort_order": "default", "shelves": ["books-i-own"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3015380897", "review_id": "3015380897", "date": "Oct 16, 2019", "rating": 3, "user_name": "Etiennee Myers Thake", "user_url": "/user/show/88435754-etiennee-myers-thake", "text": "Pop", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3021385789", "review_id": "3021385789", "date": "Oct 22, 2019", "rating": 5, "user_name": "Deebro Skellystrong", "user_url": "/user/show/104331490-deebro-skellystrong", "text": "This book was amazing. One of my all time favourites. About half way in it made me gasp out loud and was unputdownable.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3038779510", "review_id": "3038779510", "date": "Nov 06, 2019", "rating": 4, "user_name": "Bracha Simcha", "user_url": "/user/show/105032081-bracha-simcha", "text": "This had surprising depth to the story.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3059839563", "review_id": "3059839563", "date": "Nov 25, 2019", "rating": 5, "user_name": "When in doubt, go to the library. ", "user_url": "/user/show/63538426-when-in-doubt-go-to-the-library", "text": "I've read this four or five times now and it always gets me where it hurts. I howled like a child. Bravo, Marian.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3092555567", "review_id": "3092555567", "date": "Dec 22, 2019", "rating": 4, "user_name": "Malin", "user_url": "/user/show/107056647-malin", "text": "Pretty good, interesting story/s, very smooth read. A bit slow and confusing at times. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3113109546", "review_id": "3113109546", "date": "Jan 01, 2020", "rating": 5, "user_name": "Kathryn", "user_url": "/user/show/5352766-kathryn", "text": "The other contender for favourite with \"Rachel's Holiday\".HAS ALL THE SADS!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3114255362", "review_id": "3114255362", "date": "Jan 01, 2020", "rating": 4, "user_name": "Brandy", "user_url": "/user/show/7536014-brandy", "text": "This was Anna's story and was really good. It was sad though. And I wonder who she'll end up with? Maybe we'll find out in Helen's story.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3157506318", "review_id": "3157506318", "date": "Jan 23, 2020", "rating": 3, "user_name": "Danielle Mintzlaff", "user_url": "/user/show/95001064-danielle-mintzlaff", "text": "It was weird at the beginning but the ending is sweet.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3189850541", "review_id": "3189850541", "date": "Feb 13, 2020", "rating": 4, "user_name": "Teresa Mills-Clark", "user_url": "/user/show/14032030-teresa-mills-clark", "text": "I am thoroughly enjoying The Walsh Family series.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3205884278", "review_id": "3205884278", "date": "Feb 26, 2020", "rating": 4, "user_name": "Gina Way", "user_url": "/user/show/96734534-gina-way", "text": "Sweet and a little sad, but ultimately a story of human resilience", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3211490340", "review_id": "3211490340", "date": "Feb 29, 2020", "rating": 3, "user_name": "Kai Maciel", "user_url": "/user/show/64291209-kai-maciel", "text": "It was fine. The story completely changes after the second half reveal, and I can't say I was as interested like I was in the beginning. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3232224356", "review_id": "3232224356", "date": "Mar 15, 2020", "rating": "", "user_name": "Lynseyherbert", "user_url": "/user/show/111028389-lynseyherbert", "text": "Not going to lie this story moved me so much, I didn't catch on for quite a while into the story!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3234391809", "review_id": "3234391809", "date": "Mar 17, 2020", "rating": 5, "user_name": "Miranda Beer", "user_url": "/user/show/34933457-miranda-beer", "text": "Beautiful", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3241668679", "review_id": "3241668679", "date": "Mar 22, 2020", "rating": 3, "user_name": "Elaine", "user_url": "/user/show/75752252-elaine", "text": "It wasn’t boring but nothing much happened. It was just nice, quite short but nice.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3247593996", "review_id": "3247593996", "date": "Mar 27, 2020", "rating": 5, "user_name": "Emily Rennie", "user_url": "/user/show/18702500-emily-rennie", "text": "This is one of those books that I must have read AT LEAST six times and I never get bored of it. Such a wonderful portrayal of grief and loss with plenty of humour and good heart.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3267094244", "review_id": "3267094244", "date": "Apr 06, 2020", "rating": 4, "user_name": "Chris Meehan", "user_url": "/user/show/2099761-chris-meehan", "text": "A great isolation read with lots of laugh out loud.", "num_likes": 0, "sort_order": "default", "shelves": ["2020-challenge"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2934922779", "review_id": "2934922779", "date": "Apr 08, 2020", "rating": 3, "user_name": "Jess Demetrious", "user_url": "/user/show/99393815-jess-demetrious", "text": "Starts off red hot with suspense then peters out for the second half of the book. An easy, enjoyable read. An interesting and emotional exploration of grief and loss. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3295380089", "review_id": "3295380089", "date": "Apr 22, 2020", "rating": 3, "user_name": "Erin", "user_url": "/user/show/62262388-erin", "text": "First Keyes book that I've read. Really enjoyed. Very descriptive writing which is wonderful but yet can get a little unnecessary at times. Overall a great story line and really enjoyed it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3162891667", "review_id": "3162891667", "date": "Apr 26, 2020", "rating": 4, "user_name": "Elsia Yuanti", "user_url": "/user/show/77077476-elsia-yuanti", "text": "I thought I lost this book years ago since I bought it in 2007.This book is worth keeping. I enjoyed it and something I could repeatedly read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3334197482", "review_id": "3334197482", "date": "May 17, 2020", "rating": "", "user_name": "Emlyn", "user_url": "/user/show/51420960-emlyn", "text": "This was not the romance novel I signed up for.", "num_likes": 0, "sort_order": "default", "shelves": ["romance"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3370901842", "review_id": "3370901842", "date": "Jun 02, 2020", "rating": 4, "user_name": "Readerjems", "user_url": "/user/show/39002258-readerjems", "text": "Anna is stuck in Dublin and wants to get back to New York to her husband Aidan. Sad, fun...she never lets me down! Chick lit!! Recommended.", "num_likes": 0, "sort_order": "default", "shelves": ["2008"]}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3344714033", "review_id": "3344714033", "date": "Jun 12, 2020", "rating": 4, "user_name": "Mariana", "user_url": "/user/show/12476280-mariana", "text": "Finally finished. This took me a while (had a lot on my plate recently getting back into the swing of things) but it was good. Another solid, classic read from Marian Keyes.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3362916594", "review_id": "3362916594", "date": "Jun 14, 2020", "rating": 5, "user_name": "Maria Burgess", "user_url": "/user/show/107559568-maria-burgess", "text": "Another brilliant read ! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/2726589430", "review_id": "2726589430", "date": "Jun 17, 2020", "rating": 4, "user_name": "Melitchko", "user_url": "/user/show/6614432-melitchko", "text": "4.5 stars. Funny in spots. Nice story", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3371290350", "review_id": "3371290350", "date": "Jun 17, 2020", "rating": 3, "user_name": "Camille", "user_url": "/user/show/1558375-camille", "text": "Nothing too deep, but a decent mental getaway. I reviewed it on my blog: https://wineandhistory.wordpress.com/...", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3423524841", "review_id": "3423524841", "date": "Jul 03, 2020", "rating": 4, "user_name": "Petra Weston", "user_url": "/user/show/117833200-petra-weston", "text": "Moving and beautiful and hearbreaking ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3466090252", "review_id": "3466090252", "date": "Aug 01, 2020", "rating": 4, "user_name": "Louise", "user_url": "/user/show/119017249-louise", "text": "Although it can be quite informal and dated to read in some places, an overall very beautiful book on grief and coming to terms with it. A plot twist too. Would highly recommend. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3512690084", "review_id": "3512690084", "date": "Aug 24, 2020", "rating": 4, "user_name": "Jamilah", "user_url": "/user/show/116330853-jamilah", "text": "A very slow paced book, unlike the other books about the sisters of the Walsh family. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3509429967", "review_id": "3509429967", "date": "Sep 05, 2020", "rating": 5, "user_name": "Summer", "user_url": "/user/show/101037723-summer", "text": "My first book by Marian Keyes and I absolutely love it, can't wait to dig into the rest I have. Great characters and great story line.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3542908935", "review_id": "3542908935", "date": "Sep 11, 2020", "rating": 4, "user_name": "Nadia", "user_url": "/user/show/8908207-nadia", "text": "Enjoyable read", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3546139458", "review_id": "3546139458", "date": "Sep 13, 2020", "rating": 3, "user_name": "Lynda Watts", "user_url": "/user/show/90101373-lynda-watts", "text": "A slow book, enchanting, rather than quick and pacy. Glad I got to the end!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3582324518", "review_id": "3582324518", "date": "Oct 11, 2020", "rating": 3, "user_name": "Sandra Mallett", "user_url": "/user/show/114288448-sandra-mallett", "text": "Nice light read. The side story did not make much sense so not really sure what it’s purpose was. This was my first Marian Keyes novel and I look forward to another one day. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3568585773", "review_id": "3568585773", "date": "Oct 27, 2020", "rating": 4, "user_name": "EMA", "user_url": "/user/show/1512925-ema", "text": "This is a very kind and funny book about bereavement. Extremely readable and cozy. I could've done with less of the emails from Helen, however.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3649699320", "review_id": "3649699320", "date": "Nov 25, 2020", "rating": 5, "user_name": "Dawn Kidd", "user_url": "/user/show/108560263-dawn-kidd", "text": "Really enjoyed this book and Anna's journey through the acceptance of her husband's death x", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3677029993", "review_id": "3677029993", "date": "Dec 04, 2020", "rating": 5, "user_name": "Tab Mcclelland", "user_url": "/user/show/12106215-tab-mcclelland", "text": "Delightful, funny, sad and beautiful.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3689121583", "review_id": "3689121583", "date": "Dec 11, 2020", "rating": 3, "user_name": "Ruth Gates", "user_url": "/user/show/82815106-ruth-gates", "text": "Whimsical, funny and yes, romantic.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3699586951", "review_id": "3699586951", "date": "Dec 16, 2020", "rating": 1, "user_name": "Navya", "user_url": "/user/show/94583062-navya", "text": "This was my first novel and i thoroughly regret reading it .", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3734318355", "review_id": "3734318355", "date": "Jan 04, 2021", "rating": 5, "user_name": "Linda", "user_url": "/user/show/39158547-linda", "text": "I think I enjoyed most of all her books ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3752252734", "review_id": "3752252734", "date": "Jan 06, 2021", "rating": 4, "user_name": "Melinda Wilde", "user_url": "/user/show/61972978-melinda-wilde", "text": "Interest look at griefSome times too predictable, but otherwise interesting look at grieving process. Heavy but not too. Nice writing style. Keeps the reader wanting more.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "165030.Anybody_Out_There_", "book_id": "165030", "book_title": "Anybody Out There?", "review_url": "https://www.goodreads.com/review/show/3811243279", "review_id": "3811243279", "date": "Feb 09, 2021", "rating": 4, "user_name": "Mariana", "user_url": "/user/show/9255795-mariana", "text": "I really wanted to love this book. But the second part was dragging for me. The first and third part are great though, I really loved Anna.", "num_likes": 0, "sort_order": "default", "shelves": []}]