[{"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/19440490", "review_id": "19440490", "date": "Apr 04, 2008", "rating": 5, "user_name": "maricar", "user_url": "/user/show/750368-maricar", "text": "don't read this in public..especially if you're by yourself...this book has been on my wishlist for years (apparently it was earning rave reviews from readers online) and yet everytime i come across this at bookstores i'd tell myself to postpone buying it since it had many copies on shelf. i never even bothered leafing through it. but one day i just decided to actually read its back cover and see what all the hoopla's about.and then i saw the line, \" Secrets she wouldn't share with anyone in the world: I have no idea what NATO stands for. Or even what it is. \" and honest to god, i just grinned like an idiot. i had to read it. i actually went to a nearby cafe right after buying this from the store just so that i could begin.which turned out to be a bad idea cos it was literally difficult to keep a straight face once i read the first few chapters.you ever had that experience when something is really really funny but you can't laugh outright or even smile cos people around you will start getting wary? this book is deadly. you have to read it on some secluded (preferably enclosed [okay make it enclosed and sound-proof]) place so you can laugh without being hampered.this book may even be funnier than her shopaholic series. there's just something so natural and so human about the insecurities and then the delusions of Emma. and though this might be a comic story first, this was a very cheeky romantic romp for me. and is it just me or was Jack sexy?? i just wanted to skip on the next scene where he'll appear--i can't wait what next secret he'll be dangling for Emma to squirm over.it's not even your run-of-the-mill chick-lit cos there were some parts that became serious they were heartbreaking. all in all, this is a highly recommended, feel good story. you'll never want to put it down (even when you know that someone soon will approach you and politely ask you to leave their premises cos you're scaring some people...)", "num_likes": 605, "sort_order": "default", "shelves": ["romance", "fiction-for-women", "favorites", "contemporary"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/274336363", "review_id": "274336363", "date": "Feb 08, 2012", "rating": 1, "user_name": "Anzu The Great Destroyer", "user_url": "/user/show/2278800-anzu-the-great-destroyer", "text": "Goal: Read a light book and laugh my ass off.Result: Read a stupid book that made me want to cut it into little pieces.Overall Goal: Happiness.Overall Result: A sh*tty headache.All my friends gave Can You Keep A Secret? a high score, all of them loved it, all of them asked me to read it.So I did.Yep. And I ended up having a headache. Literally. Mrs. Kinsella you owe me a pack of meds and a nice foot massage.So why did all my friends love this book and I didn’t? I have no idea, to tell you the truth. I just know this: Emma is an idiot. A shallow clownish stupid boring insecure clueless loser. She’s the reason why I hated the book.\n”'Please promote me,' I say desperately. 'Please. I have to get a promotion to impress my family. It's the only thing I want in the whole world, and I'll work so hard, I promise, I'll come in at weekends, and I'll … I'll wear smart suits.”\nFacepalm compilation in321        And btw, wtf is this Panther Cola crap? Is it cola that panthers drink or cola made out of panthers?", "num_likes": 263, "sort_order": "default", "shelves": ["fat-kitty-judges-you", "big-fucking-nope", "facepalm", "i-deserved-it", "stabby-stabby", "is-it-just-me-goddammit", "oh-you-so-funny", "the-hate-it-burns", "cheesetacular", "chicklit"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/158264165", "review_id": "158264165", "date": "Apr 01, 2011", "rating": 3, "user_name": "Stacia (the 2010 club)", "user_url": "/user/show/4013351-stacia-the-2010-club", "text": "So...I really wanted to dislike this book. I was determined not to allow myself to be one of \"those girls.\" You know...the ones who plan ladies night out to watch Sex and the City. I've never had a desire to read Bridget Jones' Diary or The Devil Wears Prada (although I do hate to admit that I actually liked Devil as a movie) I mean, it's Chick Lit. Fluff without the smut. What fun is that?Turns out, it's more fun than I was expecting. The book started out in such a way that I was expecting to give up before making it past a few chapters. I practically sighed with exasperation over the flighty, bumbling, office girl who embarrasses herself in front of her boss without knowing who he is. The thoughts in my head were practically burning a hole in the Nook. No, I don't care about what crappy fashion you're wearing to the office. No, I don't care that you're really a size 12 but tell people you're an 8. No, I don't care that you have a lame ass boyfriend who listens to jazz and likes bad movies.Just as I was about to hit \"delete\" and ditch the book from my ereader, something happened. I started laughing. A LOT. Not the polite little giggly \"oh that's cute\" type of laughter. The snorting, choking, oh-my-god I'm dying laughter. My husband even looked up from his zombie like trance mid-video-game to give me a wtf? look.It took several chapters for me to warm up to the book and truth be told, if I hadn't promised myself that I wanted to finish at least one chick lit book just to say that I had given the genre a shot, I would have quit out before getting to the part where it started to get good. Once I got past the mediocre parts revolving around the main character's office and family life, and got into the part where she was spending most of her time trying to figure out how to make a relationship with her boss work, I was along for the ride. It was quite the fun ride, too. I was pleasantly surprised.Will I continue to read chick lit after this? Hmmm...I don't know. This book was fun and I'm completely glad that I read it, but I still am not fond of the office girl/modern day girl formula that seems to be pretty big in this genre. Even with as funny as this book was, I've browsed some reviews for the author's books and it looks like she tends to stick with a similar subject matter for most of her books.", "num_likes": 252, "sort_order": "default", "shelves": ["contemporary-romance", "adult", "made-me-laugh", "chick-lit"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2885149646", "review_id": "2885149646", "date": "Jul 06, 2019", "rating": 5, "user_name": "KAS", "user_url": "/user/show/20691061-kas", "text": "How hard is it to keep your deepest, darkest secrets, especially if you think you are about to die? Well for poor Emma, it seems to be quite hard. Emma is in an airplane which is being tossed about in heavy turbulence, and when pure panic seizes her, she bursts out to the stranger sitting beside her ... \n”...We’re not going to make it. I know we’re not. This is it. I’m twenty-five years old. I’m not ready. I haven’t achieved anything. I’ve never had children, I’ve never saved a life ... I haven’t gotten a tattoo. I don’t even know if I have a G spot ... ”I’m sorry?” says the man, sounding taken aback. ”My career’s a complete joke. I’m not a top businesswoman at all. I haven’t got a team. I’m just a crappy assistant and I just had my first ever big meeting and it was a complete disaster. Half the time I haven’t a clue what people are talking about, I don’t know what logistical means, I’m never going to get promoted, and I owe my dad four thousand quid, and I’ve never really been in love...”\nThe above quotes are only a sampling of the litany of hilarious confessions and secrets she spills, but unbeknownst to Emma, she had a meltdown in front of Jack Harper, who happens to be the co-founder of the marketing company she works for in London. Jack had just flown in from America to visit with his employees. Three days later when they meet face to face once again, this time in her office, Emma is mortified and hopes upon hope he doesn’t remember her from the plane flight, but no such luck. He not only remembers her but also every intimate thought and personal secret she uttered.Let the embarrassment begin ;))This is my second Sophie Kinsella audiobook, and I am having the best time. The British narrator’s snappy and crisp voice made this rom-com even more FUN-tastic!!", "num_likes": 121, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1267303589", "review_id": "1267303589", "date": "Apr 29, 2015", "rating": 4, "user_name": "Zoë", "user_url": "/user/show/9303625-zo", "text": "This was such a fun and entertaining book! I laughed out loud multiple times and I also cringed several times because of how embarrassed I was for Emma.My only problem with this book is that I felt like it could have been longer! It felt rushed at times and I wished there was more of an ending. I wanted to know how it all came together and like, for example, how Kerry was doing (terribly, I hope).Nevertheless, I really enjoyed reading this book and I can't wait to read more of her novels in the future!", "num_likes": 114, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3050673200", "review_id": "3050673200", "date": "Nov 15, 2019", "rating": 4, "user_name": "Ahmad Sharabiani", "user_url": "/user/show/614778-ahmad-sharabiani", "text": "Can You Keep a Secret?, Sophie KinsellaEmma Corrigan is a young woman in London, England. She is in a stable, but dull, relationship with the \"perfect\" man, and is currently attempting to climb the corporate ladder at Panther Cola, a multi-national cola company headquartered in London. Satisfied with life, she is thrown off-kilter when she mistakenly blurts out all of her inner secrets to a complete stranger on a plane when it hits turbulence and she believes she is going to die. Emma believes that she is in the clear when she leaves the plane, as she is confident that she will never see that stranger again. However, when he shows up at work, and turns out to be the company's founder, she is forced to come face-to-face with the man, her secrets, and the desire for her life to change. ...تاریخ نخستین خوانش: روز شانزدهم ماه نوامبر سال 2007میلادی؛عنوان: رازم‌ را ن‍گ‍ه‌ دار؛ نویسنده: سوف‍ی‌ ک‍ی‍ن‍زلا (کینسلا)؛ م‍ت‍رج‍م‌: ن‍ف‍ی‍س‍ه‌ م‍ع‍ت‍ک‍ف‌؛ ت‍ه‍ران‌ ل‍ی‍وس‍ا‏‫، 1385؛ در 454ص؛ شابک ایکس-964563461؛ چاپ دوم 1388؛ چاپ سوم 1390؛ چاپ چهارم 1392؛ چاپ پنجم 1394؛ چاپ ششم 1397؛ شابک 9789645634610؛ موضوع: داستانهای نویسندگان بریتانیایی - سده 21منقل از متن کتاب از کتاب «رازم را نگه دار»: (یک: البته من هم رازهایی دارم؛ همه ی آدمها رازهایی دارند؛ کاملاً طبیعی است؛ منظورم رازهای مهم و خانمان برانداز نیست؛ مثلاً اینکه رئیس جمهور خیال دارد ژاپن را بمباران کند، یا فقط ویل اسمیت میتواند دنیا را نجات دهد، بلکه رازهای عادی و پیش پا افتاده ی روزمره است؛ به عنوان مثال، چند نمونه از رازهای جورواجوری که به ذهنم رسیده، از این قرار است: 1 ـ مارک کیت اسپید کیف من قلابی است؛ 2 ـ من عاشق شراب اسپانیایی هستم، گندترین مشروب عالم؛ 3 ـ روحم ابدا خبر ندارد که ناتو به چه درد میخورد و اصولاً چه معنایی دارد؛ 4 ـ من 58کیلو هستم و البته نامزدم کانر تصور میکند من 53کیلو ام؛ بعد از این دروغی که به او گفتم، خیال داشتم رژیم بگیرم و وزن کم کنم؛ 5 ـ همیشه نظرم این بود که کانر شبیه کن است؛ 6 ـ گاهی من و کانر در بحبوبه ی عشقی آتشین هستیم که یکدفعه من از خنده ریسه میروم؛ 7 ـ پنهان از پدرم، شرابی را که گفته بود باید مدت بیست سال نگهداری شود، سر کشیدم؛ 8 ـ سامی، ماهی قرمز، همانی نیست که پدر و مادرم موقع سفر مصر به من دادند تا ازش مراقبت کنم؛ 9 ـ هر وقت همکارم آرتمس حسابی اعصابم را خرد میکند، من آب پرتقال پای گلدانش میریزم، که تقریبا کار هر روزم است؛ 10 ـ لباس زیرم از شدت تنگی کلافه ام میکند؛ 11 ـ همیشه به نوعی یقین داشتم که من با بقیه ی مردم فرق میکنم و زندگی تازه ی پر هیجان و شگفت آوری در انتظارم است؛ 12 ـ اصلاً یک کلمه هم از حرفهای آن آقایی که کت و شلوار خاکستری پوشیده بود، سر در نمیآوردم؛ 13 ـ تازه، اسمش هم یادم رفته بود؛ تازه ده دقیقه بود که با آن آقا آشنا شده بودم؛ او با صدای تو دماغی گفت: «ما به ائتلاف تکوینی مدیریتی چند جانبه ای اعتقاد داریم، که در راس اموره.»؛ من هم فوری جواب دادم: «البته، فرمایش شما صحیحه.» ائتلاف تکوینی مدیریتی چند جانبه؟ یعنی چه؟ من که نفهمیدم چه گفت؛ وای خدا جون، اگه از من سئوال کنه چی؟ «اِما»، احمق نباش؛ اونا یهو معنی ائتلاف تکوینی مدیریتی چند جانبه رو ازت نمیپرسن؛ من فقط دنباله رو حرفه ی بازاریابی هستم، مگه نه؟ معلومه که راجع به بازاریابی چیزهایی میدونم؛ به هرحال، اگه اونا در این مورد حرفی بزنن، من فوری بحث رو عوض میکنم؛ اصل مطلب این بود که بایستی خودم را با اعتماد به نفس و تاجرمآب نشان میدادم؛ میتوانستم این کار را بکنم؛ فرصتی عالی برایم پیش آمده بود و دلم نمیخواست آن را از دست بدهم؛ من در دفتر اداره ی مرکزی گلن اویل در گلاسکو نشسته بودم؛ با دیدن تصویر خودم در شیشه ی اتاق، متوجه شدم عین تاجرهای درست و حسابی هستم؛ پس از نیم ساعت ور رفتن با سشوار و استفاده از ژلهای جورواجور، موهایم را که بلندی آن تا سر شانه میرسید، صاف و خوش حالت کردم؛ گوشواره ی حلقه ی طلایم را انداختم و کت و دامن چهارخانه ی شیک جدیدی هم به تن کردم؛ «البته بگویم آن قدرها هم نو نبود، چون آن را از فروشگاه کنسر ریسرچ خریده بودم، یک دکمه اش هم افتاده بود که خودم آن را دوختم. البته اصلاً معلوم نبود.»؛ من به نمایندگی از شرکت پنتر، در آنجا حضور داشتم؛ هدف از برگزاری جلسه، تکمیل امور تبلیغاتی مربوط به نوشابه ی انرژی زای جدید پنتر پریم با طعم تمشک بین شرکتهای گلن اویل و پنتر بود؛ صبح همان روز، من مخصوصا برای همین کار از لندن پرواز کرده و به آنجا رفته بودم؛ وقتی رسیدم، دو بازاریاب شرکت گلن اویل راجع به اینکه چه کسی بیشتر به واشنگتن سفر کرده و کارت طول پرواز او امتیاز بیشتری دارد، با هم حرف میزدند و پز میدادند، البته من هم به آنها بلوف زدم و گفتم زیاد به سفر میروم، اما حقیقت این بود که این اولین ماموریت من بود؛ خوب، راستش این اولین جلسه ی تجاری من بود که بتنهایی در آن حضور پیدا میکردم؛ مدت یازده ماه بود که به عنوان دستیار بازاریاب که پایینترین رده ی شغلی در بخش ما بود، در شرکت پنتر کار میکردم؛ کار من در اوایل تایپ نامه، خرید ساندویچ و گرفتن لباسهای رئیسم، پل، از خشکشویی بود؛ بعد از چند ماه، به من اجازه ی تطبیق رونوشتها هم داده شد؛ از چند ماه پیش به بعد هم مسئولیت نوشتن آگهی تبلیغاتی برای پودر ماشین لباسشویی به من محول شد؛ خدایا، چقدر ذوق زده بودم! اول، کتاب راهنمای تبلیغات خلاقانه را خریدم و با استفاده از آن دو روز آخر هفته را صرف نوشتن تبلیغات کردم؛ هر چند پل نظری اجمالی به آن انداخت و طوری گفت «خوبه» که انگار منظورش این بود که راجع به آنچه نوشته بودم با کسی حرفی نزنم، خودم حسابی از نتیجه ی کارم راضی بودم؛ از آنموقع به بعد، چند تا آگهی تبلیغاتی دیگر نوشتم، و بابت آنها یکی دو جلسه ی مشورتی هم با پل داشتم. به هر حال خیال میکردم دارم از نردبان ترقی بالا میروم، و این احساس را داشتم، که از بسیاری جهات واقعا مدیرعامل بازاریابی هستم! با این تفاوت که مثل سابق، کلی کار تایپ انجام میدادم، ساندویچ میخریدم و از خشکشویی لباس میگرفتم؛ علاوه بر این کارها، یک سری کار دیگر هم انجام میدادم، مخصوصا از چند هفته پیش که منشی بخش ما، گلوریا، رفته و هنوز کسی جای او نیامده بود؛ به هر حال مطمئن بودم روزی همه چیز تغییر خواهد کرد؛ آن جلسه میتوانست باعث دگرگونی عظیمی برای من باشد؛ حالا اولین فرصت برایم پیش آمده بود تا به پل نشان بدهم چقدر باعرضه هستم؛ آن قدر به پل التماس کرده بودم تا بالاخره اجازه ی رفتن به جلسه را به من داده بود؛ بگذریم، سابقا، شرکتهای گلن اویل و پنتر یک سری معاملات تجاری با هم انجام میدادند، پس همکاری آنها اصلاً تعجب آور نبود؛ البته خودم میدانستم من به نمایندگی از شرکت پنتر در آنجا هستم صرفا چون من در دفتر پل بودم که او متوجه شد همزمان با تشکیل این جلسه، یک قرار مهم ناهار توام با اعطای جوایز که بیشتر کارمندان بخش هم در آن حضور داشتند، دارد؛ و از آنجا که نمیتوانست آن را لغو کند، مرا به آن جلسه فرستاد. از صمیم قلب امیدوار بودم جلسه ی آن روز خوب از آب در بیاید و من ارتقای مقام بگیرم؛ در آگهی استخدامی نوشته شده بود: «احتمالاً پس از یک سال ترفیع مقام...» تقریبا یک سال شده بود و روز دوشنبه جلسه ی ارزیابی شغلی داشتم؛ در دفترچه ی استخدامی کارمندان در مورد عبارت «ارزیابی شغلی» توضیح داده شده بود: «فرصتی مناسب برای بحث در مورد امکانات ارتقای مقام.»؛ ترفیع مقام؛ چقدر دلم برای این کلمه غنج میزد؛ میتوانستم به پدرم بگویم که دیگر من بازنده ی تمام عیار نیستم، و همین طور به مادر و کری؛ چه میشد به خانه میرفتم و میگفتم: «راستی، من ارتقای مقام پیدا کردم و مدیر عامل بازاریابی شدم.» «اِما کریگن»، مدیرعامل بازاریابی؛ «اِما کریگن»، معاون ارشد بازاریابی؛ تا حالا همه چیز بخوبی پیش رفته و طبق گفته ی پل بخش مهم معامله انجام شده بود و تنها کاری که لازم بود من انجام بدهم، در حقیقت مطرح کردن زمان تبلیغات بود و بایستی از عهده ی این کار برمیآمدم؛ حدس میزدم همه چیز به خیر و خوشی تمام خواهد شد؛ آره، درست بود، من از چند اصطلاح رایج اصلاً سر درنمیآوردم؛ اما سابق بر این هم با اینکه یک سری اصطلاحات زبان فرانسوی را بلد نبودم، به هرحال نمره ی ب را میگرفتم. «اسم گذاری مجدد کالا، تجزیه و تحلیل...؛ سودآوری...»؛ آقایی که کت و شلوار خاکستری به تن داشت، هنوز هم وراجی میکرد و...؛ دستم را دراز کردم و کارت ویزیت او را کمی جلوتر آوردم تا بتوانم اسم روی آن را بخوانم؛ دگ همیلتن؛ بسیار خوب، یادم میماند؛ دوگ؛ دگ؛ آسان بود؛ در ذهنم یک بیل را تصور کردم با یک تکه گوشت خوک؛ ای بابا، ول کن؛ همین حالا اسمش رو یادداشت میکنم؛ توی دفترم یادداشت کردم «دگ همیلتن» و «اسم گذاری مجدد»؛ چی شده انقدر وول میخورم؛ خداوندا، زیر شلواریم کلافه ام کرده بود؛ هیچ وقت لباسهای زیرم تا این حد مرا اذیت نکرده بود؛ دلیلش هم این بود که دو سایز کوچکتر بود؛ وقتی کانر آنها را برایم میخرید، به فروشنده گفته بود من 53کیلو هستم: و فروشنده هم حدس زده بود حتما سایزم چهار است؛ سایز چهار! شب کریسمس بود؛ من و کانر هدایا را رد و بدل کردیم؛ او به من یک دست لباس زیر ابریشمی صورتی هدیه داد؛ سایز چهار! به طور کلی دو راه داشتم: الف ـ اعتراف به حقیقت: «میدونی چیه؟ این واسه ی من خیلی تنگه؛ آخه سایز من هشته؛ راستش وزنم 53کیلو نیست؛ ب: به هر بدبختی خودم را توی لباس زیر میچپاندم؛ به هرحال چه میشد کرد؛ کسی که متوجه خطوط قرمز روی پوستم نمیشد؛ بایستی سریع تمام برچسبهای لباسهایم را که روی آنها سایز هشت نوشته شده بود، میکندم تا کانر متوجه نشود؛ از آن موقع به بعد، کمتر از آن لباس زیر استفاده میکردم؛ گهگاهی در کشو چشمم به آن میافتاد که با وجود قشنگی و گرانقیمت بودنش در گوشه ای خاک میخورد؛ حتی تصمیم گرفتم که برای خاطر آن هم شده، رژیم بگیرم و وزن کم کنم. عجب آدم خنگی بودم؛ «متاسفانه، از موقع اسم گذاری مجدد کالا، و تجدیدنظر اساسی، لازمه راههای موجود اشتراک مساعی رو مد نظر...»؛ تا آن لحظه من فقط نشسته بودم و سرم را تکان میدادم و در این فکر بودم که آن جلسه ی تجاری چقدر بی دردسر است؛ اما یکدفعه صدای دگ همیلتن مانند چکشی به ذهنم ضربه زد، چه میگفت؟ ای بابا؛ «دگرگونی دو محصول تولیدی...؛ حالتهای متناقض...»؛ چه چیزی متناقض بود؟ منظورش از تجدید نظر اساسی چه بود؟ احساس کردم ضربه ای روحی به من وارد شده است؛ دگ همیلتن میگفت: «ما از اشتراک مساعی مفید شرکتهای پنتر و گلن اویل که در گذشته باعث رضایت خاطرمون بوده، قدردانی میکنیم؛ حالا شما باید متوجه این نکته ی مهم باشین که هر دو شرکت خط مشیهای مختلفی در پیش گرفته ن.»؛ خط مشی مختلف؟ احساس کردم دل آشوبه دارم؛ او نمیتوانست...؛ آیا او میخواست با این حرف معامله را فسخ کند؟ با لحنی بسیار آرام گفتم: «معذرت میخوام، دگ، تا اینجا متوجه تمام مطالبی که گفتین، شدم.»؛ لبخندی بسیار حرفه ای و دوستانه به او زدم؛ «اما اگه شما صرفا بتونین...؛ به اختصار وضعیت...» ولی حرفهای دلم را سر زبان نیاوردم؛ دگ همیلتن و آن مرد دیگر نگاههایی با هم رد و بدل کردند؛ دگ همیلتن گفت: «مرغوبیت جنس مارک دار شما کمی ناراحتمون کرده.»؛ من هاج و واج گفتم: «مرغوبیت جنس مارکدار من؟»، او نگاهی عجیب و غریب به من کرد و گفت: «منظورم مرغوبیت محصوله؛ همونطور که توضیح دادم، ما در شرکت گلن اویل سعی میکنیم روند اسم گذاری مجدد محصول رو دنبال کنیم و تصور ما از این اسم گذاری بیشتر به جنبه ی مواد نفتی مربوط میشه، که دقیقا علامت گل نرگس شرکتمون چنین چیزی رو اثبات میکنه؛ ما احساس میکنیم نوشابه ی پنتر پریم با تاکیدش بر روی ورزش و رقابت، صرفا حالت تحمیلی داره.»؛ ...)؛ پایان نقلتاریخ بهنگام رسانی 15/03/1400هجری خورشیدی؛ ا. شربیانی", "num_likes": 110, "sort_order": "default", "shelves": ["romance", "21th-century", "fiction", "humor", "british", "literature"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1794001849", "review_id": "1794001849", "date": "Oct 25, 2016", "rating": 4, "user_name": "Michelle", "user_url": "/user/show/8836060-michelle", "text": "Have you ever been on a plane ride through hell and you got so scared, you thought it was better to say what you have been dying to say all your life before you crash? I feel that way every time, honestly! Although I wouldn’t go into so much detail as Emma did in “Can You Keep A Secret?”Once again Sophie Kinsella delivers a heroine that we want to cheer for and chastise at the same time! Emma is a lovable neurotic dreamer that I feel protective of. Spilling your deepest secrets, only to have them resurface at a very inopportune and public moment is a shame beyond measure. Yet she endures -- and triumphs. Kinsella builds these characters that we want to see succeed, although we hope they do learn a lesson or two along the way. The story is a big mouthful of pink cotton candy -- a light and fluffy romance. Fearing a plane crash, The heroine spills all her deepest secrets to a total stranger. Fortunately, their plane didn’t crash. Unfortunately, the total stranger turned out to be the CEO of her company. (view spoiler)[ Worse, he manages to spill all her secrets on national television. Of course he didn't use her name, but she gave it away by her behavior.  (hide spoiler)] This is a delicious book!There were some very hilarious moments in this story. Emma is absolutely engaging – she’s an adorable mess! It would be a delight to be around such a woman, although she has the morals of an alley cat. She's a \"self-made career girl\" and a future marketing executive. All in her head of course. So it's no wonder she gets herself into such tangles. She lives in her head! I think everyone knows people like this and can't help laughing at them when they get into trouble. I love the fact that she gets herself into constant binds, but good things invariably end up happening to her in the end. I think we all like a lovable loser, don't we?Not much I can say about the hero, just another closed-mouth guy, but he did come through in the end. He eventually learns that communicating with someone you are interested in is the key to trust and a lasting relationship. A couple of snarky characters, and an imbecile ex-boyfriend made for good story telling. Only wish the ending was longer. Lots of buildup and ends in a few pages, and epilogue was not informative enough. Nevertheless, I was completely hooked on this book, and was immensely entertained. This story was so funny and so far-fetched that I could actually imagine it happening to me. I will never ever spill my guts to a perfect stranger on an airplane no matter where I am going or under what circumstances. Was it Maurice Switzer who said “It is better to remain silent at the risk of being thought a fool, than to talk and remove all doubt of it?” Wise man. Very wise....", "num_likes": 108, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1549844379", "review_id": "1549844379", "date": "Feb 15, 2016", "rating": 2, "user_name": "Aj the Ravenous Reader", "user_url": "/user/show/30248594-aj-the-ravenous-reader", "text": " Two point five-ish stars ^^Quirky, hilarious read about a 25 year old clumsy, silly, awkward Emma who is always caught in the most embarrassing situations and thinking she’s probably not yet embarrassed enough, spewed out every single one of her deepest, darkest most embarrassing secrets to a stranger on a plane when she thought they were going to die during a violent turbulence. The horrific result: strange man isn’t a stranger after all. LMAO!While I wasn’t a fan of Emma (and of any other character in the story for that matter) and thought she was awful and ridiculous with every single decision she made (She says it’s good when it’s bad, okay when it’s not, yes when she means no, in short she lies all the time), the hilarity of her story and predictability of the more than slightly rubbish plot are entertaining. It’s my first Sophie Kinsella read and although it wasn’t completely successful, I have a feeling I’ll enjoy her YA novel, Finding Audrey more. Here’s my lovely friend’s, Alice’s review of said YA book.^^ Happy birthday, my Dear Alice. Despite the few stars, I enjoyed the read so it’s all good. I’ll certainly give Ms. Kinsella another chance. I hope you’re having the time of your life on your very special day. Love you, girl! <3", "num_likes": 101, "sort_order": "default", "shelves": ["lol", "definitely-not-young-adult", "easy-read"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2517729248", "review_id": "2517729248", "date": "Oct 04, 2018", "rating": 4, "user_name": "Anne", "user_url": "/user/show/1720620-anne", "text": "I'm not really 100% into Chick-Lit, but this is one of those books that I've seen pop up over and over again on all the Best Of lists over the years, and I've grown quite curious.No, seriously. True story. Anyway. I've been on the hunt for really funny fluff this past month and finally decided to pull the trigger on my first Sophia Kinsella book. Supposedly, this was a HI-LARIOUS rom-com, and I was in the market for exactly that.However.Sometimes what makes me smile doesn't match up with everyone else in the room...So was it funny?Yes. No. Kinda?I mean, it wasn't the sort of humor that had me doubled over, gasping for breath, but there were cute moments. It was the kind of jokey stuff that would have done well with a laugh track or something. <--if that makes sense?BUT.Even though this wasn't exactly what I was initially looking for, I still had a reallyreallyreally good time reading it! It was just a super cute romance-y little story about a young woman in the middle of getting serious about her career path, finding a man she loves, and simultaneously growing a set of balls. I've noticed that I never really find the resolutions to the assy family and/or assy friend drama in Chick-lit to me sufficiently, um...resolved, I guess? And this one was no different. The ending felt sort of rushed as everything gets kinda built up to this crazy-dramatic showdown, then everyone whistle-farts away into a Happily Ever After. <--I've come to expect that, it's not even a deal breaker anymore.There was quite a bit of the ridiculous in this as far as nonsensical plot stuff goes, but I don't read this genre to get a glimpse of realism. So, a lot of the nuttier aspects of the story, (view spoiler)[like the way her co-workers figured out he was talking about her on television (hide spoiler)], get a pass from me.If you're looking for something fluffy to get you through the week, I would say Can You Keep a Secret? is a great choice.", "num_likes": 100, "sort_order": "default", "shelves": ["kindle", "chick-lit", "read-in-2018", "romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1567306964", "review_id": "1567306964", "date": "Mar 02, 2016", "rating": 5, "user_name": "Beverly", "user_url": "/user/show/13095060-beverly", "text": "OMG, this book is laugh out loud funny, like sitting in my cubicle at work just giggling to myself. In the days, I spent reading this one I told numerous people about it because I was just so excited and happy to find a book that made me actual loud out loud. Some of my best friends raved about this book during our girls weekend last year and I was repeatedly told, you have to read this!Emma Corrigan is a typical girl, just like us or me at least. She is awkward, inappropriate and just trying to prove herself. Emma is flying back from a business trip, that of course went horribly bad. During the flight, there is some extreme turbulence and she thinks she is going to die. During her freak out she precedes to unload all her secrets on everyone around her. Monday morning comes with a big surprise, one of the passengers is the owner of Emma’s company and he remember everything. All her secrets are out, some as small as hating g-strings and the coffee at work, to her insecurities with her family and lesbian dream she had about her best friend. This story is so freaking perfect. It’s so funny, it's freaking cute as shit and the love stories is so sweet. This is my first book by Sophie Kinsella, but it will not be my last. The audiobook is absolutely fantastic and made me believe the narrator was Emma. Teaser created by me with stock images purchased from depositphotos.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "num_likes": 81, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/27331347", "review_id": "27331347", "date": "Jul 15, 2008", "rating": 1, "user_name": "Cecily", "user_url": "/user/show/1199525-cecily", "text": "My first - and almost certainly last - foray into chick lit. Very shallow, contrived and implausible, albeit in a self-conscious (\"ironic\"?) way. Although the \"plot\" may excuse the improbable co-incidences, there is no justification for the ludicrously artificial dialogue. I find all the \"poor fluffy little me struggling to bluff it in the big bad grown up world\" nauseating. Not as funny as it thinks because the humour, such as it is, is entirely reliant on very cliched stereotypes. If it were written by a man, people would be outraged at how sexist it is. Even if Kinsella was once ahead of the game by writing in this way, its startling unoriginality is just another annoyance. I expected a juice bar/coffee shop rather than Heston Blumenthal's molecular gastronomy, but I ended up with soggy fluorescent candy floss.", "num_likes": 78, "sort_order": "default", "shelves": ["did-not-finish", "overrated"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1581338333", "review_id": "1581338333", "date": "Jan 14, 2017", "rating": 3, "user_name": "♛ may", "user_url": "/user/show/49148508-may", "text": "Gosh, this books was so much fun!!!Often times when I’m told a book is  funny,  I usually find that it turns out being more painful to read than anything. But damn, is Sophie Kinsella hilarious!  Can You Keep a Secret  follows the charismatic tale of Emma Corrigan. This woman is a hoot, let me tell you. She’s hilariously paranoid and completely outrageous. She is the  “ordinary, nothing-special sort of girl”  but oh, does she have her secrets. Secrets that she probably shouldn’t have blurted out while clutching onto the arm of a strange during a rocky flight. But, oh well, can’t do anything about that now, can we?  “Oh God. I'm losing it. Everyone knows this is how criminals get caught. They add too many details and trip themselves up.”  ^^That’s basically Emma’s entire existence. So this book was adorable and sweet and really really charming in a lot of ways. It was such an easy read and really brought on that little bits of glee that usually accompany a great book. Oh, and I really love Jack!! What a little darling. But there were parts of the book that I found excessive. For example the fact that Emma seemed to face problem after problem after problem. It’s not a  HUGE  deal but I just found it tiring because here we are, smiling and happy for a single sentence and then BAM, another problem takes place.Kinda excessive if ya ask me. :p Anywho. . .I was never a huge fan of chick-lit but after reading this one, I’m definitely not done with this genre or this author!   “I've always had this deep-down conviction that I'm not like everybody else, and there's an amazingly exciting new life waiting for me just around the corner.”  3.5 stars!!~~~~~~~~~~~~~~~~~~~~~~~~Need cute and fluffy and I need to binge read Sophie Kinsella, so, here I gooooooooooo!!!", "num_likes": 69, "sort_order": "default", "shelves": ["hilarious", "audiobook", "love-triangle-ugh", "super-cute", "contemporary", "300-pgs", "standalones"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/272053126", "review_id": "272053126", "date": "Feb 03, 2012", "rating": 4, "user_name": "Dija", "user_url": "/user/show/2857113-dija", "text": "Rating Breakdown:Enjoyment - 5 starsStory - 3 starsEmma - 3.5 starsJack - 2 starsSide characters - 5 starsEnding - 2.5 starsThe average is 3.5 stars, but since enjoyment is my number one reason for reading in the first place, I'll round it up to 4 stars. This book is, hands-down, the funniest book I've ever read. I laughed so hard, I had tears in my eyes and cramps in my tummy throughout. This book should come with a warning label, something like, Can You Keep a Secret?... AKA The Sole Cause of Death by Laughter World-Wide! It's nearly impossible to hate a book after it makes you feel so warm and fuzzy inside.Most of this book is solid 5-star material. There's humor, romance, lesbian fantasies, drama, and good decision-making, along with some of the most outrageously hilarious characters ever to be created (yes, I mean you, Jemima). Unfortunately, the ending sorely lacks closure, and is the main reason why I didn't give this a higher rating. All my other problems mainly stem from this one issue. The ending left me entirely unsatisfied and highly doubtful about the future of Emma and Jack, as a couple and otherwise. Basically, it didn't feel like an ending. It was rushed and anti-climactic, in addition to being slightly unrealistic. It would have been the perfect ending had this been a series, but since it's a stand-alone novel, I got the distinct impression that there were still several chapters left, and they were simply missing from the version of the book I read. Not the greatest feeling to have after finishing a book, to be sure. Emma is a lot better at confrontations and standing up for herself than the other two heroines of Kinsella's I've read, namely Poppy from I've Got Your Number: A Novel and Lexi from Remember Me? I'm sure most female readers can relate to her in one aspect or the other. I really loved Jack too, until he (view spoiler)[betrayed Emma (hide spoiler)]. I never truly accepted his excuse, nor did I entirely forgive him for it. After everything that happened between Emma and Jack, especially the whole deal with their respective secrets, I would have really liked to see more of them as a couple, to genuinely believe they had anything lasting going on. These are two individuals from vastly different backgrounds, and let's face it: the man's a multimillionaire, and the girl's his employee. In real life, these kind of relationships hardly ever work out, and I would have liked Kinsella to prove me wrong by actually showing Emma and Jack in a stable relationship, one where they both learn to talk their problems out instead of jumping to conclusions. We never really get to know Jack as someone besides \"Jack Harper, the man who founded the Panther Corporation\", and the trust between Emma and him seems too delicate and fragile for anything but a temporary affair.I guess I was simply expecting more from this book, and while it was one of the best light reads I've read in a while, that annoying feeling I got, the one where I really don't feel the ending did justice to the story, sort of ruined it for me. That aside, this is truly a fantastic book, one of the rare ones I'll certainly be re-reading in the years to come. THANK YOU to everyone who urged me to read this book ASAP! I am forever indebted to you. ♥♥♥For more reviews, visit my blog. ", "num_likes": 65, "sort_order": "default", "shelves": ["cotton-candy-fluff", "cr", "authors-i-stalk", "lollercoaster", "my-reviews", "read-in-2012", "before-2007"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1452537998", "review_id": "1452537998", "date": "Nov 26, 2015", "rating": 4, "user_name": "Pang", "user_url": "/user/show/10517119-pang", "text": "“Can You Keep A Secret?” Are you serious?!!??!? NO! I’m gonna spill all your secrets to my friends, Emma. You cannot trust me on this! I’m a bitch, I know. hahaha1st secret: Guys.. this clumsy lady, Emma Corrigan is so damn lucky! She not that have much money, but she met an sweet-angel air-hostess so this sweetie air-hostess invite Emma to sit on the plane in Business class!!! She cheat!!! Without anyone else know! so she pretends to be businesswoman. See what she did!BUT HAHAHAHAAAAAAA….2rd secret: The plane got turbulence so she thinks she gonna die!!! There is guy sit next to her.. She hold his hand tightly Oops and spill all her secrets blah blah blah.. to that guy like a naked girl. O.OIt became she not die! OKay her life is go on.. One day, she go to work..Someone BIG visit her work place..OMG Is that guy??? Yess the guy she unintentionally spill all her ( top ) secrets to is her CEO.……………………………………………………..This book is funny! This Emma Corrigan kinda reminds me of Meg Cabot’s heroine, Idk. Hahaha She is clumsy, whinny, and funny that made me laugh so hard until having face palms for her. Whatever, this like a modern fairy-tale! An ordinary girl is interested by a handsome wealthy dreamy man. That’s why Kinsella’ story kinda my cuppa tea, I think. Nahh… I just want something like this happen real to my life! Why it has to be only in fiction? *sobs*Not just it’s funny, there is drama, too. Sometimes secrets are shameful, right? That’s why we all have secrets to keep. Anytime Emma’s secrets reveal, I laugh so hard! ( My dad even say \"Pang gone crazy!\" *damn* ) But sometimes the situation made me hurt, too. I can feel how hurt and embarrassed she is. Like.. I don’t want it happen to me, too.Not just Emma, but also Jack ( our hero ) who is so mysterious with something he not gonna tell anyone..I will let you know by yourself! Xoxo Pang.", "num_likes": 62, "sort_order": "default", "shelves": ["bad-ass-alpha-hero", "business-tycoon", "i-wish-this-happen-real-to-me", "couple-i-love-bc-of-hero", "enigmatic-complicated-hero", "my-book-big-brother", "laugh-a-lot-read"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/498571618", "review_id": "498571618", "date": "Jan 07, 2013", "rating": 1, "user_name": "Lady Gabriella of Awesomeness (SLOW)", "user_url": "/user/show/15586682-lady-gabriella-of-awesomeness-slow", "text": "I swear the moment I was done with this book...I was just so..soo..\nSO DAMN FRUSTRATED\nThe ending seemed so...lacking? Disappointing? Hell ! Fr the first time,in my history of reading books.I actually ended up hating the hero Jack,(view spoiler)[(who spilled all her secrets on NATIONAL TELEVISION ),  (hide spoiler)] instead of the heroine,along with her cousin Kerry (who basically STOLE THE HEROINE'S ENTIRE CHILDHOOD) and her fashion/mommy obsessed roommate Jemima (who basically spent the whole book determined to expose jack's supposedly BIG SECRET )...I'm mean seriously you guys,I wish I could say I loved this as much as I enjoyed this author's I've Got Your Number but sadly this didn't even score half of it's rating...DISSAPOINTMENT :( ", "num_likes": 62, "sort_order": "default", "shelves": ["read-n-reviewed", "skimmed-paragraphs", "office-romance", "shoot-me", "soft-n-fluffy"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/4129678348", "review_id": "4129678348", "date": "Jul 22, 2021", "rating": 5, "user_name": "♥️Dev♥️ ~ Dark & Depraved Old Soul", "user_url": "/user/show/126131750-dev-dark-depraved-old-soul", "text": "Review to come", "num_likes": 64, "sort_order": "default", "shelves": ["genre-contemporary-romance", "5-stars", "reviews-to-come"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2940561739", "review_id": "2940561739", "date": "Aug 18, 2019", "rating": 2, "user_name": "demi. ♡", "user_url": "/user/show/96515924-demi", "text": "❥ 2 / 5 starsWhat should I say about this book? It was hilarious. Yes. It made me laugh. Yes. But the problem is... the plot itself made absolutely no sense to me. It made no sense since Emma (the protagonist of the book) told all her secrets to a complete stranger. Err.. Who’s gonna do that in real life? Even if someone is in the same situation as her, I don’t think he/she will do that, right? OK. It must be my fault that I thought I would enjoy this one despite nonsensical things in the book because I trust Sophie Kinsella’s writing. But oh, I was so wrong. Sophie Kinsella’s writing didn’t help me with this one and I did not like it. A lot of things in the book frustrated me. Like, didn’t you think there were too many problems occurring in Emma’s life? The first problem passed, the second problem came. The second problem passed, The third problem came. The third problem passed, the fourth problem came. It was like a cycle and it gave me big big headaches.🤦🏻‍♀️ (There were much more than this but I’m afraid it would be a spoiler, so Iet’s leave at that.)Anyway, I need to take a break from this kind of story for a while.", "num_likes": 58, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1291165598", "review_id": "1291165598", "date": "May 27, 2015", "rating": 2, "user_name": "Ferdy", "user_url": "/user/show/4596358-ferdy", "text": "2.5 stars - SpoilersThis was kind of fun but also kind of awful, as expected the heroine was an utter idiot and the plot was beyond silly, but I have to admit that there were some funny moments and the story despite being nonsensical was easy to get through and somewhat entertaining.-Who the hell would reveal ALL their secrets to a total stranger? The heroine (Emma) blurted out every little detail of her life to some random guy sitting next to her just because the plane she was on was going through some turbulence. Naturally, the random guy turned out to be her sexy, bazillionaire boss who used her secrets against her the first chance he got (never mind professionalism and good work ethic). -All the female characters were men obsessed idiots, their only goal in life was getting married and having babies. Nothing else was important, career and family didn't matter, it was all about landing a man. That was the ultimate achievement. Ugh. -Why did Emma keep banging on about getting a promotion at work when she hadn't been there long enough or proved herself or done anything worthy? She was seriously deluded. -Why did Emma keep saying Jack was in love with her? Not once did he tell her he loved her and there was nothing in his actions that suggested he was. They'd had two dates and one night of sex and that somehow made Emma think Jack was in love with her. What a stupid cow.-Why didn't Emma ever stick up for herself? Why are all of Kinsella's heroines such doormats? Emma was on a whole other level of doormat, she just smiled and kept her mouth shut whenever her family or someone else bitched at her. It was beyond infuriating to read the POV of someone who was so unable to stand up for themselves. -Emma's parents were such dicks, they treated her like crap and never showed her any love or support. They saved all that for their niece (Kerry), and treated her better than their own daughter. Emma was the one who needed love and emotional support, not Kerry. When her jerk parents finally realised how they'd been favouring Kerry over their only child for years, all they did was give a lame apology and act mildly remorseful. And silly cow Emma immediately accepted their apology and was over the top grateful for them finally acting like half decent parents. Yea, as fucking if. A halfhearted apology doesn't erase years of rubbish parenting, Emma's reaction was so unrealistic. In reality she would have still been hurt and bitter about how unloved she'd felt growing up, I didn't expect her to rant and rage at them but some real emotions would have been appreciated. Instead she went on like they were the best parents in the world, and magically forgot their douchey behaviour after a sentence or two of mild remorse. Yea right.-There was more passion and emotion from Jack and his dead friend than Jack/Emma. The way Jack talked about him, it was like they had an epic love affair or something. I ended up wanting to read about them instead of Jack/Emma's relationship.-Jack spilling all of Emma's secrets on TV was a dick move. And then him acting like it was unintentional was beyond ridiculous, he revealed every little thing about her and then he was all 'duh, it was an accident. I'm sowwy.' The whole thing was ridiculous, and Emma was bonkers to let him off the hook. They were both such idiots.-Really liked Emma's friendships with Liss and Jemima, it was the highlight of the book.A ridiculous read, but it was still quite funny and entertaining in a cheesy, predictable, cliched, silly sort of way.", "num_likes": 48, "sort_order": "default", "shelves": ["romancey", "contemporary", "cringey", "fluff", "tstl-heroine", "blah-romance", "nonsensical", "chick-lit"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/976018123", "review_id": "976018123", "date": "Sep 28, 2018", "rating": 4, "user_name": "Trina (Between Chapters)", "user_url": "/user/show/9323164-trina-between-chapters", "text": "This was SO enjoyable to me! It delivered on the premise. I felt like the meme of eating popcorn while reveling in the drama.Cautions:-The whole thing revolves around an entry level employee and the CEO of her company knowing inappropriate things about her. I didn't feel like this story used a power imbalance to manipulate a relationship or employment status, but if boss/employee relationships are a dealbreaker for you, heads up.-A few chapters make a big hubbub about the MC having a romantic dream about her female friend and all the side characters start making lesbian jokes to her. This was published in 2003 and this type of 'humor' was unfortunately part of that time. Full disclosure - I'm straight so don't take only my word on if this is truly harmful, but it did make me want to facepalm and I think I would have rated this higher without it.", "num_likes": 48, "sort_order": "default", "shelves": ["romance", "2018", "adult", "audiobooks", "standalones"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1890932395", "review_id": "1890932395", "date": "Jan 24, 2017", "rating": 4, "user_name": "Brittney ~ Reverie and Ink", "user_url": "/user/show/50044222-brittney-reverie-and-ink", "text": "This was really cute and funny! A great lighthearted read. Review to come!", "num_likes": 47, "sort_order": "default", "shelves": ["contemporary"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2951747970", "review_id": "2951747970", "date": "Aug 25, 2019", "rating": 4, "user_name": "EmBibliophile [hiatus]", "user_url": "/user/show/62566585-embibliophile-hiatus", "text": "3.75 starsThat was such a fun quirky entertaining book!Emma ,who is kinda scared of flying, was on an airplane when a turbulence occur. Thinking she’s going to die, she started to panic and spilled all of her secrets to the guy setting next to her. Everything turns out to be okay. Emma goes home. Days later, the boss/owner of the company where she works comes to visit, and he’s none other than the stranger who she was supposed to never see again, but now he’s here and he knows all of her embarrassing secrets.This was one of those “ridiculously good” books, you can’t help but enjoy and you don’t even know why. This was my first book by Sophie Kinsella and I decided to read it after reading the review of my dear friend KAS, so thank you. This book made me grin, a lot. And I really felt embarrassed for Emma. This girl is a mess. Overall, it was entertaining.Song recommendation:Do you want to know a secret by The Beatles", "num_likes": 43, "sort_order": "default", "shelves": ["4-stars"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/223051959", "review_id": "223051959", "date": "Oct 13, 2011", "rating": 4, "user_name": "Megs ♥", "user_url": "/user/show/5691412-megs", "text": "First of all thank you, Jasprit, for insisting I read this one. A couple of days ago I was sick and in bed all day. I had just finished another book and was wondering which book to start next. I saw this on my Nook and remembered you said it's her best book. This book really made me feel better when I was under the weather.Emma is 25 and has been through many jobs. She has had a job in marketing for over a year now, and although she does okay, she's not exactly moving up the corporate ladder. She lives with her bff Lissy and has a boyfriend that she thinks is almost too cute and perfect. One day on a terrifying plane crash she turns to the man next to her and starts blabbering every random secret she has to the stranger next to her. She tells him everything including several things that could get her in trouble at work. A few days later when this stranger walks in her workplace and she's made aware that he is the founder of her company she is mortified. Can he keep her secrets?I've gotten to the point where I feel like if you have reviewed one Sophie Kinsella book you have reviewed them all. The same things always apply. Laugh out loud humor, a loveable but usually quite clueless heroine, some barely there romance, and a picture perfect ending. They also usually include a subtle message from which the character learns something important about life. The fact that you know what you're getting when you go into one of her books can be a good thing or a bad thing. For me I like it. I know what to expect and she never lets me down. Note: I have read a few of her singles, but still haven't gotten to the Shopaholic series, so don't hold me to that.My only complaint and reason for giving this 4 stars instead of 5 is because of the predictability. See how I said it could go both ways? I like knowing what to expect, but I would also like a bit of surprise with the ending. This one had a formula that seemed so similar to \"I've got Your Number\" in regards to the boyfriend factor. Why bother giving the heroines a boyfriend at the start of the book? We always know how that's going to end. I know Sophie Kinsella has it in her to write something more original and unique for the chick-lit genre and when she does that's when I will give her my 5 stars.Fans of Kinsella will not be disappointed with this one, and I agree with Jasprit. This is her best that I've read so far.", "num_likes": 36, "sort_order": "default", "shelves": ["e-books", "z-2012-reads", "lollerskates"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/958563910", "review_id": "958563910", "date": "Jun 05, 2014", "rating": 5, "user_name": "Sara", "user_url": "/user/show/32014561-sara", "text": "This book was hilarious. The basic idea is, imagine what would happen if in a moment of panic you were to spill all your darkest secrets to a perfect stranger and of course that stranger was extremely attractive and turned out to be a new big shot at your company, genius uh? When Emma spills it all out it makes you want to cover your eyes with your hands and tell her:The fun, as always with Kinsella standalone novels, is guaranteed and the romance is just witty and cute.(view spoiler)[ The cousin was so bad!!! In the final retribution moment I was yeah! I actually pictured myself kicking her in the derriere a couple of times!! (hide spoiler)]", "num_likes": 36, "sort_order": "default", "shelves": ["contemporary", "5-star-chick-lit", "chick-lit", "favorites", "pink-cover"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3980711550", "review_id": "3980711550", "date": "May 06, 2021", "rating": 4, "user_name": "Kat", "user_url": "/user/show/54835325-kat", "text": "Emma has always kept everything a secret, never really living the truest version of herself. Then one day she’s on a flight from Scotland and her plane has trouble in the air. She confesses everything to her seatmate, Jack… who turns out to be her boss. As usual with a Sophia Kinsella book, this had adorable, quirky characters, a heroine you just wanted to root for, and a fun story we got to watch slowly unfold as Emma (view spoiler)[ stopped standing in her own way and figured out how to live her best life.  (hide spoiler)] I always enjoy books by this author. The family was delightfully terrible in this one! Please excuse typos/name misspellings. Entered on screen reader.", "num_likes": 34, "sort_order": "default", "shelves": ["library-4"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2670858174", "review_id": "2670858174", "date": "Jan 12, 2019", "rating": 4, "user_name": "Salma Mattar", "user_url": "/user/show/63754353-salma-mattar", "text": "a real funny and light novel, one of my favorite chic lits. this is my 3rd re read of this novel and it never fails to make me laugh :D", "num_likes": 33, "sort_order": "default", "shelves": ["owned"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1821578623", "review_id": "1821578623", "date": "Nov 25, 2016", "rating": 2, "user_name": "Sophia", "user_url": "/user/show/3766576-sophia", "text": "2.5 stars\"it was ok\" is seriously such an accurate description of this book. good job, description-that-hovers-over-the-2-star-rating!emma, our main character, is monumentally irritating. she compulsively lies about things that she shouldn't have to lie about, and is so horrendously unprofessional in her workplace, it's a wonder that she's maintained her job for as long as she has. and yet, somehow, she's an interesting and genuine person in the eyes of a multimillionaire. ok. i think there's a marked improvement in the book's storytelling and humor past the halfway mark, which is quite a commitment tbh. but there are a few lines where i laughed out loud. it takes a while for the humor to be funny, but when it gets there, it's great. ", "num_likes": 31, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1398095628", "review_id": "1398095628", "date": "Apr 11, 2018", "rating": 5, "user_name": "Fafa's Book Corner", "user_url": "/user/show/7366569-fafa-s-book-corner", "text": " Review posted on Fafa's Book Corner! Beware spoilers ahead!I have been a fan of Kinsella's since Finding Audrey. Naturally I went through all of her books and tried to decide which one to read. Can You Keep a Secret? stood out the most. I am happy to say that I loved it!Emma has gone to represent her company Panther Cooperation in a meeting. As per Kinsella books the meeting turns into a disaster whilst Emma spilling a product on one of the other company's worker. Emma goes back in a bad mood and has quite a bit to drink. The plane she is on experiences turbulence. Out of panic (and she's drunk) Emma tells all her secrets to another passenger. All's fine until Emma goes to work on Monday to find out that the passenger is the CEO of Panther Cooperation.Can You Keep a Secret? was so funny and relatable! The writing tense is in first person all from Emma's point of view. There are numbers for the chapters. As well as emails and notes. I related to a lot of Emma's work woes. It's really hard to prove yourself in a workplace that doesn't appreciate you. Emma's co-workers like Artemis reminded me off some of my co-workers. There's always that one person that's just fake. On the bright side Katie was fun to read about! She was actually really sweet and a good friend to Emma.Emma lived in an apartment with two flatmates. Lissy and Jemima. Lissy has been Emma's best friend since they were 7. Lissy and Emma constantly support each other throughout Can You Keep a Secret? There friendship was absolutely adorable! I'm a bit conflicted about Jemima. She definitely thought she was helping. But Jemima's suggestions were terrible. And didn't really make sense. I do have to give Jemima props for trying to help.Emma's family play a huge part in Can You Keep a Secret? Emma feels that she's disappointed her parents. Her cousin Kerry always tries (and succeeds) to one up Emma. Nev (Kerry's husband) also pokes at Emma about her career changes. Emma is able to sort everything out with her family.Prior to Can You Keep a Secret? Emma begins dating a co-worker named Connor. Connor works in another division at Panther Cooperation. During the plane ride Emma realizes that she doesn't really have feelings for Connor anymore. Emma is in denial about this. She breaks up with him much later on.I personally found Connor to be annoying! Emma asks Connor to keep their break-up to himself for the time being. Seeing as they work together. Instead at a party (while drunk) announces their break-up. Their office blames the whole situation on Emma as she is the one to dump him. And he doesn't even apologize! It didn't help that the co-workers didn't bother to see it from Emma' point of view.Connor also tries multiple times to confront Emma about who she is dating. He acts like a martyr and always has a way of patronizing Emma. I also found him to be totally inconsiderate. To try and look professional during a staff meeting Connor shuts down Emma's point. Just because Jack Harper was present. I honestly don't understand why Emma blamed herself for everything. Connor has a brain too. He can realize himself that not all women keep secrets.As far as Emma's secrets go I didn't find them that bad. Some of them were really dumb while the others hilarious! What was troubling is how easy it was for Emma to lie. And she did so constantly. Emma did develop and started actually admitting the truth. She even started to stand up for herself! Emma stood up to Kerry and Paul (her boss). I especially liked how she handled Paul. And in the end it paid off as she got promoted.I really liked Emma and Jack's relationship! When Jack appears in at the Panther Cooperation, he spends quite a bit of time poking fun at Emma's secrets. It was honestly so assuming! Through their relationship they grew. Jack learned to become more open. And Emma learned to stand up for herself and be honest. They made a really good couple. Also Jack's actually American. Can You Keep a Secret? takes place in London.I didn't have any problems. Expect for Connor but I think it was well handled. And blissfully she broke up with him early enough. Overall I loved Can You Keep a Secret?! I highly recommend it.     ", "num_likes": 30, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/224220211", "review_id": "224220211", "date": "Oct 16, 2011", "rating": 5, "user_name": "Natalie Monroe", "user_url": "/user/show/6688207-natalie-monroe", "text": "Can You Keep a Secret is possibly my favorite Kinsella standalone.It follows the story of Emma, an ordinary, slightly ditzy girl (think Anna from Anna and the French Kiss) who accidentally spills all her secrets to a stranger on the plane. And that stranger later turns out to be her boss. In honor of this book—and because I absolutely suck at writing reviews for books I love, I am going to spill to you, strangers of the Internet, all of my secrets. Okay, not all, but five.1. I used to be majorly obsessed with Seventeen magazine.  Back then, I begged my parents numerous times over the dinner table to buy me a subscription (all the savings!), but they always refused. In hindsight, that was probably a good thing because I soon got tired of all the high-definition pages of clothes, shoes, and make-up. The real sustenance was located in the back and only covered 4-5 pages. I'm proud to say that nowadays I blow my money on more worthy things, like badly-written YA novels that induce headaches.2. That's a biggie.3. I'm a huge fan of Taylor Swift, even though liking her is an extremely uncool thing these days. Her lyrics are prose spun into music, that's all the reason I need.4. I sometimes think The Book Thief is better than the Harry Potter series. Then I make a pro-vs-con list in my head and all is right in the world once more.5. I love Kinsella's work. A lot of people hate them and I get it. Her heroines are essentially recycled book to book. The love interest is usually American and a logical businessman compared to the scatterbrained MC. They're filled with first-world problems and limited character growth. The problems work themselves out most of the time and the MC and Mr. Businessman go home happy and schmooze.But at the same time, they're also fun, compulsively readable, and keep me up reading til 2am on a school night because I can't stop flipping the pages. They remind me that reading is indeed a hobby and something I look forward to after a long day, unlike some books I could mention *cough*The Death Cure*cough* So the next time someone asks me who my favorite authors are, I'll say: \"Stephen King, J. K Rowling, George R.R. Martin, Julie Kagawa, Markus Zusak, Meg Cabot, Sophie Kinsella—Yes, Sophie Kinsella.\"", "num_likes": 31, "sort_order": "default", "shelves": ["sugar-spice-n-everything-nice", "favorites", "guilty-pleasures", "fabulous-five-stars", "reread-for-the-nth-time"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/193731321", "review_id": "193731321", "date": "Aug 02, 2011", "rating": 2, "user_name": "valee", "user_url": "/user/show/2320890-valee", "text": "Worst book I have read in a LONG, long time. Seriously, How could so many of you like this book? Now I remember why I hate chick-lit so much. After having read and adored Something Borrowed and Something Blue I thought I wasn't giving enough credit to this genre, I thought there were some good books on it out there. Because of this, I went to a list with the best chick-lit books and added them to my TBR pile. This is the first one I try and I completely abhorred it. I found this read and most of the characters absolutely shallow. The only character I did like was the Hero and we never really get to know him. The rest of the characters are vain, arrogant and egocentric. Book's most discussed topics: Shoes, bags and celebrities. OMG, I just can't believe there are so many books discussing these things. And I can't understand how someone can enjoy this type of reads. Seriously, if what you are looking for are funny, quick and entreating reads, you must search for contemporary romance. Just don't read more books in this genre... they can't be good for people's IQ. I just know there must be better books on this genre because those 2 I mentioned at the beginning of this review were great and I enjoyed them big time... I was expecting much more of everything form this book. I can't think of a thing I liked about it. I'll try another book of this author because I just can't believe everybody likes her so much and I enjoyed this book so little, maybe it was just the topic. ", "num_likes": 29, "sort_order": "default", "shelves": ["cont-romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/90268108", "review_id": "90268108", "date": "Sep 28, 2017", "rating": "", "user_name": "Elizabeth", "user_url": "/user/show/1762033-elizabeth", "text": "Emma Corrigan is intolerably stupid. She lives with intolerably stupid flatmates, and has an intolerably stupid boyfriend whom she doesn't actually love but is determined to stay with because he is handsome.Emma works for an intolerably stupid company (Panther Cola) and reports to tiny men with big egos that speak to her as though she is the biggest inconvenience in their day (my favourite lines are \"Emma, please get your arse in gear\" and \"Emma, please get the fuck out of my office\").Instead of handing in her notice as any self-respecting woman would and going to work in a more positive environment, Emma desperately seeks to move up the ladder so she can impress her intolerably stupid family who make fun of her because she isn't a CEO yet (she's only 25) by doing what's expected of her in her marketing assistant role and then pleading with her boss to promote her after one year even though she hasn't a clue in hell what she's doing.I've just reached the part where the CEO presses the emergency button in the elevator, thus trapping them inside together, and proceeds to tell her what kind of man she needs.No. Fucking. Thank you.", "num_likes": 28, "sort_order": "default", "shelves": ["so-very-british", "terrible-influence", "extremely-annoying-main-character", "cringe-worthy", "chick-lit", "vomitrocious", "nope"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2566669675", "review_id": "2566669675", "date": "Oct 18, 2018", "rating": 2, "user_name": "Suzanne", "user_url": "/user/show/11889829-suzanne", "text": "Are all of Sophie Kinsella's books this formulaic? Every day gal, coming across a handsome, eligible, scrumptious boss? This installment we have Emma, working in marketing come across the CEO. Will it be a happy ever after, who knows?! Kooky flatmates, the tube, bitchy office workers, there's a bit of the usual here.These suite the purpose though, as I always say. Easy reading to the extreme. ", "num_likes": 27, "sort_order": "default", "shelves": ["library-wsu", "overdrive-browser"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1454295310", "review_id": "1454295310", "date": "Nov 28, 2015", "rating": 3, "user_name": "Anu", "user_url": "/user/show/48159983-anu", "text": "3.5 starsAlright, I've been reading romance novels off late. It's one of those phases. And this is one of my favourites. Did Emma get on my nerves by whining too much? Sure. Was Jack way, way out of her league? Sure. But thing is, this woman knows how to pen chick-lit. She gets you right in the feelers and doesn't let go until you're sucked dry. Emma, who I'm sure suffers from some form of anxiety, spills all her secrets to the gorgeous American sitting next to her. What transpires next is a series of misadventures as she finds out he's none other than her boss. Like the boss man, boss; he owns the company she works for. Emma is your run of the mill, regular, working class girl. She takes the bus and hates her colleagues. She's a chronic underachiever, all thanks to her cousin Kerry. She loves her gramps, and is in one of those relationships. She has a best friend, she has a frenemy. And she has secrets. Lots of them. Jack on the other hand, oh Jack. He's smart, hot, and a little bit of an asshole. He kinda wears his heart on his sleeve, and fucks up majorly. But yeah, like every chick-lit books, they beat the odds together. Still, you know, this makes for a pleasing read. ", "num_likes": 25, "sort_order": "default", "shelves": ["all-the-feels", "favourites", "drama-drama-drama", "men-i-fell-in-love-with", "romance", "i-think-it-s-funny", "chick-lit", "fucking-cheater", "contemporary-romance", "laughed-till-i-cried"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1600154059", "review_id": "1600154059", "date": "Jul 23, 2017", "rating": 4, "user_name": "Zain Otoom", "user_url": "/user/show/45136398-zain-otoom", "text": "BR WITH AKIRA! Bo this was fun!I really liked this book! It was hilarious and Despite the second hand embarrassment it was very funny! Emma herself as a character is very flawed and might make you face-palm every other page or so, but nonetheless, she's very likeable. I enjoyed the romance very much! Jack is a sweetheart. The only thing that bothered me a bit is how every fucking time when shit seems to go smoothly a problem arises. And it's more annoying because you already know what kind of ending this will have, but still, you need to suffer along through many problems and conflicts. But overall it was a really fun read!", "num_likes": 22, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/976344548", "review_id": "976344548", "date": "Jun 24, 2014", "rating": 4, "user_name": "Paige  Bookdragon", "user_url": "/user/show/15550986-paige-bookdragon", "text": " What to say about this book?  I remember when my friends and I went to Cebu (another BIG island next to ours. Philippines is composed of of 7,107 islands..) We went to a supermarket before going to our campsite to buy some basic stuffs.One of my friends, Jeffrey was with me.(I don't know why he keeps on tagging along with me)I know my period is just around the corner so I was looking for some tampons. Now, tell me ladies. Can you buy a tampon with a straight face if one of your very male, very virile friend is with you? Even if he is the kind of friend who I share a single lollipop without having second thoughts, I tell you, NO. Bad: the store is SO big I can't find where they put the fucking tampons and I'm having a hard time looking for it. The freaking sales ladies were not around at that times so there's no one to ask.The time came when he noticed I'm not buying anything, just strolling around. He asked me if there's something I'm looking for and I'm too embarrassed to tell him I'm looking for a you know what. I just can't tell him to leave me alone because he'll know I'm hiding something. (In his universe, the only reason I'll send him away is when I'm planning to buy chocolates and I'm not planning to give him anything.)Worse: Jeff is the type of guy who won't stop badgering you if he knows you are hiding something so I just can't send him away. I'm getting antsy because we only have a limited time in the store and I still can't find the tampons, so no other choice, I whispered:\"Quiet you, I'm looking for some tampons.\"To which he replied: OH YOU'RE LOOKING FOR A TAMPON?! WHY DIDN'T YOU SAY SO?! LET'S LOOK FOR YOUR TAMPONS! HOW MANY TAMPONS DO YOU NEED? Did I mention that he keeps on saying-excuse me- shouting the word TAMPON? I was so mortified because a group of guys were looking at us and some high-school girls were laughing. I wanted to punch the son-of-a-gun and maybe cripple him a little but I can't because he was one of the people I love so much and no matter how embarrassing that scenario was, my fondness for him was bigger than the mortification. Same with this bloody book. It was embarrassing in a way that I was embarrassed for the heroine when she found her self in those certain situations. I died a little when the secret was out in her workplace. But no matter what, I just can't hate or put the book down because I learned to love it. I love it and it was worth it. Now, why did I keep on remembering that scene with me, Jeff and the tampon? Hell, I don't know. Maybe because I miss the jerk and it's been a while since we last saw each other.Now excuse me while I call the big guy.*fades away...*", "num_likes": 21, "sort_order": "default", "shelves": ["adult", "contemporary-romance", "favorite-author", "favorites", "lurrrve", "humor", "love-the-hero", "naughty-hottie", "contemporary", "tear-jerker"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/168376088", "review_id": "168376088", "date": "Aug 16, 2019", "rating": 3, "user_name": "Mlpmom (Book Reviewer)", "user_url": "/user/show/3829694-mlpmom-book-reviewer", "text": "I usually love her books but for some reason I just didn't connect with this one. I guess it's bound to happen every once in awhile but it's always sad when it does. ", "num_likes": 20, "sort_order": "default", "shelves": ["kindle-books"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1572999455", "review_id": "1572999455", "date": "Mar 07, 2016", "rating": 4, "user_name": "Muse-ic ♬", "user_url": "/user/show/36574090-muse-ic", "text": "Emma doesn't like airplanes.In fact, she's terrified of them.One day she's on a flight when the airplane hits turbulance.Emma being Emma freaks out and begins to babble, thinking it was her last moment of life, she spilled all of her secrets to the stranger next to her.Her darkest secrets.Her deepest fears.Her most intimate thoughts.But it's not such a big deal, because she's never going to see him again, right??LOL!!!It was a fun book for the most part. There were times when I was annoyed with Emma's attitude. Sophie Kinsella's characters tend to have that effect on me.But then it got better and I especially loved the way Emma matured throughout the book and stood up for herself often.When they were on their first date and Jack was ordering everything for Emma and basically controlling everything, Emma started yelling at him for it, I was like you go girl! Tell him!I was impressed that she told him to quite choosing for her because she told him what her favorite meal was on the plain or whatever. Like, what if she wasn't in the mood for champagne? Anyways, everything (view spoiler)[worked out great (hide spoiler)] in the end, and I was happy :DI also loved the way Jack's mindset grew and developed after associating and spending time with Emma! It was a wonderful development!I would recommend this one if you are at least somewhat patient! ", "num_likes": 20, "sort_order": "default", "shelves": ["audiobook"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1433019712", "review_id": "1433019712", "date": "Nov 03, 2015", "rating": 4, "user_name": "Shannon (kitchandpages)", "user_url": "/user/show/10961933-shannon-kitchandpages", "text": "*full review to come*", "num_likes": 20, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1977425415", "review_id": "1977425415", "date": "Apr 29, 2017", "rating": 2, "user_name": "Emilia Barnes", "user_url": "/user/show/32845594-emilia-barnes", "text": "This was funny, and I liked the premise and the heroine, especially how she grew more assertive and outspoken. However, I couldn't stand the love interest, and was disappointed she forgave him. ***Spoilers ahead***As soon as he started talking about her on TV I had a sinking feeling in my stomach, because by then it was too late to introduce another romantic interest, and Connor had already been revealed as a foil for Jack, so there was no hope that she wouldn't end up with Jack, and what he did was, to my mind, close to unforgivable. Of course, Emma is pissed off at this interview and the humiliation she suffers as a result, and that made me hopeful that at least there'll be some decent levels of grovelling to beg for her forgiveness. But when she's given the opportunity to confront him, she doesn't. She wusses out. Eventually, she just sort of complains that she doesn't know anything about him, which annoyed me because she wasn't sticking to the point and was letting him get away with major arseholery. But Jack, making sure we know he's an unchastened arsehole from start to finish, tells her that his secrets are more important than hers. AFTER AIRING ALL HER SECRETS ON TV. At that point he crossed the line firmly into irredeemable wanker. Not that he isn't obnoxious and horrible from the start. I'm not a fan of romances, where the disparity between the partners is as big as it is here. He's her boss, he's extremely wealthy, he holds all the information. She's poor, she's his employee and she knows nothing about him. It's a pretty terrible set up for a romance, if you ask me. But anyway, Jack does absolutely nothing to mitigate these circumstances.He, a super-rich man who owns the company in which Emma works, uses every opportunity to mock her for things she spilled out to him in a moment of panic when they were on a plane together and she thought they were falling to their deaths. Then he invites her out on a date, during which he ORDERS ALL OF HER FUCKING FOOD. That was cringeworthy in the extreme, and I was waiting for it to be revealed that he has some sort of social disorder, maybe he's autistic or on the autism-aspergers spectrum, which would have excuse such complete tone-deafness as to normal date behaviour. But no, there's no hint of that. He's just your ordinary, garden-variety arsehole. Then, when he won't speak to her, at their date, and she asks him if he's all right, he actually tells her to \"quit it.\" And when she wants to leave, he won't let her. He pays the bus driver to drive her to her door. Which again, is done without her consent or knowledge. Shortly after this, he meddles in her family affairs, completely without her consent, too. And then, of course the TV interview happens. So, yeah, he's pretty terrible. In fact, besides being rich and handsome and good at his job, he lacks any other admirable qualities, which makes me think that Emma must be a shallow fortune-hunter, just like Jemima. Except Jemima is at least open and up front about it. In the end, when he thinks that Emma has spoken to a journalist about him and he walks off in a huff even after she swore to him she hadn't spoken to the journalist at all, I was so furious with him I was hoping for a car crash in which he was the only victim. AFTER TELLING THE WHOLE WORLD ALL OF HER SECRETS ON LIVE TV HE DARES GET HIS KNICKERS IN A TWIST BECAUSE HE THINKS SHE MIGHT HAVE SPOKEN TO A JOURNALIST?!? AND WON'T EVEN LISTEN TO HER EXPLANATION? So yeah, when they got together in the end, I felt pretty horrified. Not exactly what you wish for in a romance :/", "num_likes": 19, "sort_order": "default", "shelves": ["hero-arsehole", "period-contemporary", "genre-romance", "star-rating-2", "rated-funny"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2783202999", "review_id": "2783202999", "date": "Apr 12, 2019", "rating": 5, "user_name": "Shelby", "user_url": "/user/show/21676298-shelby", "text": "Emma, a 20-something marketing assistant, is on her first solo business trip. She’s hoping that this will be her big break and she’ll go from “assistant” to “executive.” But the meeting doesn’t go as planned and Emma downs one-too-many vodka tonics before her flight. Feeling a little inebriated, Emma strikes up conversation with the handsome man sitting next to her, Jack. She divulges her deepest, most embarrassing secrets to him—about her job, love life, friends, etc. Sometimes it feels good to let it all out to a stranger, especially when you never have to see them again. But unfortunately things don’t go according to plan for Emma. It turns out she spilled her guts to not just any stranger, but the CEO of the company she works for—yikes! Surely, she’s screwed, but instead of reprimanding her, Jack strikes up flirtatious banter with her. And now every time they run into each other, he’s finding clever ways to remind Emma of all the secrets she divulged to him. Emma and Jack have a connection and Emma can’t help but develop feelings for Jack. But she’s only the marketing assistant, while he’s her boss, and that makes things more than just a little complicated...Can You Keep a Secret? by Sophie Kinsella is a Whitt, laugh-out-loud read that you can’t help yourself from loving. This was my first Sophie Kinsella read over 5 years ago and I just re-read it for the second time. I loved it equally as much and I found the characters to be likable. Kinsella is always a win in my book when I want a feel-good read. 5/5 stars. ", "num_likes": 19, "sort_order": "default", "shelves": ["romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/355230124", "review_id": "355230124", "date": "Jun 25, 2012", "rating": 1, "user_name": "missEvi [can't commit to a book]", "user_url": "/user/show/5623788-missevi-can-t-commit-to-a-book", "text": "Wait, wait.. oops another of my brain cells just committed suicide... I have to say this is the first time I've read a Kinsella book. I also have to admit that I am not very into chick-lit. But, I have read enough to know that it is not acceptable to base a book on a totally stupid, ignorant and \"fake\" character! Don't get me wrong, I am not trying to compare this with any \"serious literature\". I knew what I got myself into. But honestly, there has to be a bottom line to \"light read\". Many authors like Susan Elizabeth Phillips or Julie James write easy romance novels but none of them have ever made me feel bad being a woman. Emma is beyond words. I can get behind a fat, an ugly, a poor, a mistreated, a bitch etc heroine but I can not support a character that simply isn't trying for anything! It is so disturbing that I couldn't even laugh at many funny moments. I won't say anything else. I have a sudden urge to study my applied econometrics book.. Jeez, I don't know why...", "num_likes": 20, "sort_order": "default", "shelves": ["torturing-myself", "in-need-of-junk-food"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/38750321", "review_id": "38750321", "date": "Nov 27, 2008", "rating": 3, "user_name": "Kate", "user_url": "/user/show/339414-kate", "text": "I completely forgot I read this book until I saw some reference to Sophie Kinsella and thought, \"Wait, didn't I read something by her?\" That's exactly what this book was: mildly entertaining and completely forgettable. ", "num_likes": 19, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1643382498", "review_id": "1643382498", "date": "Sep 12, 2017", "rating": 2, "user_name": "Irene Sim", "user_url": "/user/show/31914348-irene-sim", "text": "I din't like this story. I think it was a bad choice for me to start reading this author with this one. The characters all seemed like caricatures, the dialogues were ludicrous in their attempt to be funny and the plot.... well the plot was like Bridget Jone's ugly cousin.", "num_likes": 19, "sort_order": "default", "shelves": ["contemporary-fiction", "2017-read", "romance", "audio"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1209762184", "review_id": "1209762184", "date": "Feb 23, 2015", "rating": 4, "user_name": "Arlene", "user_url": "/user/show/1746727-arlene", "text": "\nAbsolutely hilarious and entertaining!\nCan You Keep a Secret is the type of novel you pick up to relax your imagination and enjoy the ride. I laughed throughout this entire book as Emma Corrigan stumbled through life tripping on mishap after mishap! She was an absolute delightful disaster!In this novel, Emma Corrigan has high hopes for herself. She’s given an opportunity to represent her corporation in an important client campaign meeting. When the meeting falls apart, that’s only the beginning of her troubles. Now that she sees her chances of a promotion slipping away, she can’t stop the downward spiral. She takes a flight back home and the airplane hits turbulence causing the passengers and herself to panic. In sheer terror of a possible crash, Emma turns to the handsome stranger sitting next to her and spills her secrets in a mindless ramble. When she lands safely and returns to work the next day, she realizes the stranger that sat next to her and heard her dramatic soliloquy is the corporate owner of her company! Well, it goes without saying things just keep getting more and more complicated, but in the truest form of hilarious entertainment.I absolutely adored Emma Corrigan’s narration. Everything she confessed, all of her wild musings, her irrational decisions were pure delight. Jack Harper was a nice compliment to this story, and I was absolutely impressed that he remembered all of her confessions. There were times that I appreciated his protective manner to right some of the wrongs Emma had shared, but there was one moment when Jack crossed the line. I’m happy with how he handled his indiscretion, and I believed he was remorseful, so that all worked out well.Overall, Can You Keep a Secret was filled with laugh out loud moments, cringing, guffawing and all sorts of reactions that shouldn’t be displayed in public. Yes, this is definitely a story you should read in a secluded corner! Waves of Fiction 2015 Reading Challenge  - A book you shouldn't read in public.", "num_likes": 18, "sort_order": "default", "shelves": ["overdrive-audio", "read-2015", "romance", "adult"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2141514300", "review_id": "2141514300", "date": "May 03, 2020", "rating": 4, "user_name": "enqi ♡ (taylor's version)", "user_url": "/user/show/41427900-enqi-taylor-s-version", "text": "  “Your mother told you this?” says Lissy. “Yes!” says Jemima. “It was rather sweet, actually. On my eighteenth birthday she sat me down and said we should have a little chat about men and women—” Lissy is staring at her incredulously. “In which she instructed you to rub chili oil into men’s genitals?”  This book was full of moments like this,   “I’ll fire him, too.” Jack thinks for a moment. “How about this: anyone who teased you, I’ll fire.” This time I can’t help giggling out loud. “You won’t have a company left.” “So be it. That’ll teach me. That’ll teach me to be so thoughtless.”  but also moments like this.What can I say?  Can You Keep A Secret?  was everything it promised to be. It was hilarious, lighthearted and riveting; the perfect laugh-out-loud read that I needed during this pandemic. While Emma was a little naive, Sophie Kinsella managed to make her come across as adorable and endearing instead of shallow and dumb; and as for Jack, I couldn't find anything that I particularly loved about him, but nothing that really threw me off either. Emma keeps secrets from everyone because she's insecure and worries about others' judgments; but her character development at the end of the book was fulfilling to read about, even if it felt a little rushed.  He draws breath and gazes at me, his eyes so dark they’re almost black. “I met a girl on a plane. And … my whole life changed as a result.”  I first read this book in 2017 and absolutely loved it. However on my reread I find the premise was just a little far-fetched, and the storyline and characters were completely ordinary (except for Lissy, she was honestly amazing); but because of its sheer feel-good quality and because of the number of times I actually laughed out loud reading this book, I'm going to give it a fairly high rating. Whenever I next feel down during this lockdown, I'll definitely look up another Sophie Kinsella book!", "num_likes": 19, "sort_order": "default", "shelves": ["will-read-this-authors-grocery-list"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2590500874", "review_id": "2590500874", "date": "Dec 18, 2019", "rating": 3, "user_name": "Meags", "user_url": "/user/show/8542123-meags", "text": "3 StarsThis should have been a sure-fire hit — one full of relatable female characters, a dreamy but attainable hero, and loads of laugh-out-loud situations. To some (or many), I’m sure that’s exactly what this story was, and it was for me, too, for the most part, at least for the first half or so... until it wasn’t. In the beginning, I was totally in and totally charmed by heroine Emma Corrigan and her predicament of blurting all her deepest (mostly silly) secrets to her plane-mate on a rocky flight — a man by the name of Jack Harper, who serendipitously turns out to be the CEO of the company Emma works for.For 200 pages or so I was enjoying myself, zipping through the pages at lightning speed. Even though I found Emma to be a bit flighty and immature as the story progressed, I was still having fun, enjoying her awkward interactions with Jack, who held promise of being a truly memorable romcom hero. Honestly, I’m not really sure where it went wrong for me. Perhaps it was around the time Emma (and I) lost trust in Jack — trust that Emma gave back out to Jack after a good solid portion of the story was lost to melodrama and silliness. I guess I’m just an unforgiving sort because I actually found what Jack did (view spoiler)[divulging all of Emma’s secrets on television (hide spoiler)] to be reprehensible, and certainly not something I would have ever forgiven myself — hot millionaire or not!But it wasn’t even Jack’s folly that ruined this for me, it was the sheer craziness of Emma’s behaviour, along with the outrageous actions of her roommate Jemima (a character who singlehandedly took this story from a possible 5 star read to a borderline 3 star read for me). And that’s not to mention Emma’s mindless family and her co-workers, the majority of whom were straight-up bullies and should have been whacked over the face with workplace harassment. Truly, the secondary cast here were just super extreme and highly unlikeable, which was a shame because I’m definitely one who finds enhanced joy in my reads when the story features a great cast of support characters.So, besides the fact that I felt the last 100 pages were one big clusterf*ck of nonsense and frustration, I can still admit that I really enjoyed myself during most of the first half, to the point that, even when things turned sour for me, I still ate it all up like my life depended on it. It just bugs me something fierce when you think you’re reading your new favourite romcom, but it devolves quickly into the same silly, OTT melodrama that led me away from M/F romance reading (and firmly over to M/M reading) in the first place. Le sigh. Putting my too rational, possibly a tad too cynical brain aside, I’m trying my best to accept this for what it was, which was a light and amusing read — one with a fun, albeit far-fetched little set-up for an office romance, which many readers will enjoy.", "num_likes": 25, "sort_order": "default", "shelves": ["borrowbox", "tstl", "mf", "romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/27845768", "review_id": "27845768", "date": "Jul 21, 2008", "rating": 5, "user_name": "Serena", "user_url": "/user/show/1349220-serena", "text": "Sophie Kinsella's \"Can You Keep a Secret?\" blew me away with its wit and humor. There were times when I roared out loud with laughter and there was a time near the end of the book where I wanted to weep. This book surpassed my expectations. After reading the Undomestic Goddess, I was expecting a book that was similarly amusing, but Emma is a much funnier character.***Spoiler Alert***When we meet Emma Corrigan she totally messes up a \"slam-dunk\" business meeting and is headed back to London from Scotland on a flight that gets rather turbulent in more ways than one. In some ways, the turbulent plane ride becomes a metaphor for her life throughout much of the book after meeting a fellow business executive, who turns out to be her firm's founding owner--Jack Harper.Emma spills all of her secrets to this stranger on the flight while others on the flight are praying that they will land safely in London. These secrets range from her hatred of crochet to her attempts to kill a co-worker's plant with orange juice. She thinks nothing much of it at the time because he is a mere stranger on the plane. However, she soon gets back to the office to discover that the man on the plane is none other than Jack Harper, the partial owner of Panther Corporation.The banter between Emma and Jack sets the stage for the ultimate betrayal. Emma runs the gamut of emotions in this book from pleased with herself that she and the CEO have a secret understanding to head-over-heels in love to disappointment, embarrassment, and betrayal.***End Spoiler Alert***This books examines relationships in their many forms: love, romance, friendship, family. Emma learns a lot about her familial relationships and that even the best of friends have secrets from one another. She learns that honesty may be the hardest option in some cases, but it generally is the best road to undertake. Her evolution throughout the novel is fantastic and well-paced. I enjoyed Emma's struggles, which often reflect many of the struggles other women have in balancing the many relationships we have.It begs the question, who do you trust you secrets to? I for one spread them around to various people. I have to keep everyone guessing at some point, don't I? It also makes me wonder, how many of my secrets have been passed along to others in the heat of the moment.That's a question for readers...Have you told a secret to one person and not another, and why? And have you ever blurted out someone's secret accidentally without meaning to harm the person entrusting you with that secret? ", "num_likes": 17, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2319922789", "review_id": "2319922789", "date": "Mar 08, 2018", "rating": 5, "user_name": "rowanthorn ✨", "user_url": "/user/show/57830341-rowanthorn", "text": "1000/5 STARSI honestly believe that Sophie Kinsella got up in the morning and sat down to write Can You Keep a Secret and was like:Well, Ms Kinsella, to that I say...This book was AWESOME. I haven't laughed so hard over a book since... ever? And I'm not talking chuckling to yourself, or a smile here and there. I broke down into uncontrollable laughter and had to go into another room since my boyfriend was trying to sleep. THIS BOOK MADE ME LAUGH UNTIL I WAS IN HYSTERICS.Emma Corrigan is one of the most relatable protagonists ever, and since the book is told in first person, it's like being inside the head of a best friend. She is quirky, real, and down to earth, and is honestly one of my new favorite protagonists of all time. Dear Emma Corrigan:The plot was fast-paced and so full of hilarity and twists and turns that I stayed up until 2 AM to finish because I just HAD to know what happened. RECAP: HILARITY. SECRETS. UBER-RELATABLE PROTAGONIST. ROMANCE. SARCASM. BEST FRIENDS. PLOT TWISTS. RECAP PART II: 10/10 WOULD RECOMMEND!!!!  ", "num_likes": 17, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/570652286", "review_id": "570652286", "date": "Mar 25, 2013", "rating": 4, "user_name": "Jamie-leigh Haughn", "user_url": "/user/show/17182207-jamie-leigh-haughn", "text": "Another fun book from Sophie Kinsella! I always have such a great time with her books, they always put a smile on my face and make me chuckle, and this book is no exception!I loved the premise of this story, telling a complete stranger all your secrets in a moment of panic, thinking your secrets are safe then BOOM that stranger isn't a stranger anymore! I think it such a fun idea and as always I really enjoyed the characters. I found I could relate with Emma and I enjoyed hearing her story and thinking about all the little secrets I have as well!If your looking for a cute funny book, I recommend this one for sure!", "num_likes": 17, "sort_order": "default", "shelves": ["books-i-own"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/273739724", "review_id": "273739724", "date": "Feb 07, 2012", "rating": 5, "user_name": "Yodamom", "user_url": "/user/show/2905141-yodamom", "text": "Audio-I was not expecting to laugh myself to tears, not even expecting to really even finish this book. I read it looking to expand my reading pool after a friends fantastic recommendation. it was the funniest book I think I've ever read. I was laughing so hard at time I got loads of weird looks from people while walking my dogs. Oh, well I am the crazy laughing women. The narrator for this book has a dream voice.Emma, a sweet young women working her way up in a corporation. She tries so hard really, she deserves a promotion. Only her bosses and coworkers don't see it that way. She get a chance to prove herself. There is a vey important client she is to meet with, simple. No, she drifts into her mind-scape of dreams and loses focus. When she realizes what happening she bumbles and has to fly home with another blow to her ego and her career. Oh, god she has to fly, she is terrified to fly. She drinks to calm her nerves before the flight and is feeling it. A turn of luck ups her flight status and puts her in business class where they serve more drinks. This flight changes her life- snow ball down the hill. She spills her life's secrets to a stranger, every little intimate detail. Yes, everyone ! but it's okay right ? She'll never see him again. LOL sure, right, yep.", "num_likes": 16, "sort_order": "default", "shelves": ["audio", "romance", "favorite", "fun-fluff"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/27084671", "review_id": "27084671", "date": "Jul 12, 2008", "rating": 1, "user_name": "Nikki", "user_url": "/user/show/1317215-nikki", "text": "Ok, so the 1 star might be a little misleading. I actually really liked this book. I don't believe I have ever laughed so hard. Unfortunately I won't read it again because of the blatant, and totally unnecessary sex scene in the middle. Not to mention all the crass language throughout. My personal rant obviously, but is it really that necessary. Personally I think not. Otherwise I love the premise of the book, tell all your secrets, even the most embarassing ones to a complete stranger, who isn't, and see them all come back to haunt you. the style is light-hearted yet you still feel for the main character (misplaced her name somewhere), and hope that her family pulls their act together and remember that she is the daughter. No matter what her perfect cousin has done. ", "num_likes": 16, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1179385580", "review_id": "1179385580", "date": "Jan 24, 2015", "rating": 1, "user_name": "Cee (The Mistress Case)", "user_url": "/user/show/37784247-cee-the-mistress-case", "text": "\nPlease refrain from reading. This might be one of my worst reviews in history. Review contains spoilers.\nDNF @ 94%That’s right. I didn’t finish because this is how much I hate this book.Fuck it. Just fuck it.Say hello to little miss sunshine. Emma knows the world doesn’t revolve around but she wants it to. The pressure of being “perfect” and “ideal” caves down on her every day and she tries too hard to impress everyone around her. She’s desperate to impress her bosses at work because she needs her family’s approval of her. She wants to be the best, or at least better than her successful and happy cousin, who her parents never fails to dote on. She lies to her boyfriend and pretends to be into activities she doesn’t care about because she wants to be the picture-perfect girl and couple. She practically lies to everyone and doesn’t know how to be herself. She’s so busy trying to get people to like her that she lost sight of whom she was or who she can be.Bottom line: she’s way too hard on herself.Honestly, at first I didn’t mind that Emma was so pathetic, naïve, and obnoxious, but enough was enough!She’s not a woman. No. She acts, talks, and thinks like an immature and timid fucking teenager and needs to get her shit straight. She's one of the most melodramatic and boring characters I've ever encountered.There is not a single moment of peace in her life. I’m dead serious. She spends the ENTIRE book either panicking, feeling mortified, or wanting to cry when something doesn’t go her way.“I feel like crying with disappointment. I just don’t understand it. It was going so well.”“I almost want to cry. My beautiful flattering dress is lying in a calico bag, ready for the collection at the end of the day.”“Suddenly I want to burst into tears. I want to sink down on the pavement and bury my head in my hands and sob.”“I was so totally mortified. I never told anyone. Especially not Mum and Dad.”\"I have never felt so mortified in my entire life. Ever.\"\"I can barely talk. I am beyond embarrassment. I just want to disappear into the rug and never be seen again.\"\"Every time anyone walks into the department I feel a little spasm of panic.\"\"A wave of panic overcomes me.\"\"I look up and down the street, trying not to panic.\"\"Outwardly, I’m still quite calm. But inside I’m starting to panic.\"\"I all but run down the stairs, and only begin to relax when I’m safely on the other side of the big glass doors.\"\"Shit. He's coming down the stairs. There's nowhere to hide! Without thinking twice I almost run to the glass doors, push them open, and hurry out of the building. I scuttle down the steps, run about a hundred yards down the road and stop, panting. This is not going well.\"\"Without quite meaning to, I find myself running back down the steps and along the street again.\"\". . . that I’m really sorry, that basically I want to die . . .\"\"I want to die. I want to die right here, right now.\"\"OK, now I want to die. Someone please kill me.\"\"I don't know why I'm in such a jumpy, irritable mood. Because although I nearly died of embarrassment yesterday, things are pretty good.\"\"I finish, and look around the gob smacked picnic rug, breathing hard. I have a horrible feeling I might burst into tears, any moment.\"Oh, I'm not nearly done yet.\"'Please promote me,' I say desperately. 'Please. I have to get a promotion to impress my family. It's the only thing I want in the whole world, and I'll work so hard, I promise, I'll come in at weekends, and I'll - I'll wear smart suits.'”Fucking boohoo. Go ahead and cry and beg and kick and scream and pout, Emma, because you are one fucking sore loser. You boring, insecure, shallow, clueless excuse of a woman who thinks she knows what hard work is. Your pathetic self can't evoke any sympathy from me.At first, Emma's thoughts were funny, but they got old really quick. (Not to mention: the stupid first person pretense sense.)The upside: I almost stopped at 59% but good thing I kept going to see Emma (final-fucking-ly) tell Kerry (her cousin) off. She finally did something right. Technically, it was the second reasonable action she took. The first was when she broke up with Connor. All outsiders ever said about this couple was “You two seemed so perfect.”Not “You two seemed so happy.”But “perfect.”Connor is stupid.Emma is stupid.Everybody in this book is stupid and I don’t have the energy to rampage their characters.Another thing! After Emma was “betrayed” on TV, she forgets the lesson (the one she was taught mere hours earlier) about not revealing her secrets and inner thoughts to strangers because what does she do?She goes on crying in the streets and blabbers her feelings to some guy she hardly knows!Yeah, way to go, Emma. You don't fucking make a lick of sense.And you pick your friends so well. Not. Your flatmate is a man-eater.The only thing I can appreciate about Emma's character is she starts to be more honest with her colleagues, friends, and family. That's about it.Oh, and Jack, don't think I forgot about you.Go to your room and stay there.Can You Keep a Secret? is one of the worst chick lit I’ve ever read. Take my fucking one star and show it to the whole world. It’s not a secret.Because of how specially stupid this book is, I created a new shelf on Goodreads: \"bloody hell you're all bonkers.\"", "num_likes": 15, "sort_order": "default", "shelves": ["waving-at-you-in-my-rearview-mirror", "bloody-hell-youre-all-bonkers", "the-anatomy-of-too-stupid-to-live"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1606029971", "review_id": "1606029971", "date": "Apr 10, 2016", "rating": 2, "user_name": "Nenia ✨ I yeet my books back and forth ✨ Campbell", "user_url": "/user/show/2190064-nenia-i-yeet-my-books-back-and-forth-campbell", "text": "\n\nInstagram || Twitter || Facebook || Amazon || PinterestThe thing about Sophie Kinsella is that she only really writes one type of heroine - a socially awkward, passive-aggresive flake, whose proclivity for white lies borders on the pathological, and who ends up making you wince when you know that you ought to be laughing.Sometimes this works. For example, I really enjoyed THE UNDOMESTIC GODDESS, REMEMBER ME? and TWENTIES GIRL (in that order). The first Shopaholic book was okay, but the second made me very angry, because in it, the main character quickly devolved back into her own habits, neatly erasing any character development that occurred in the first book, and making me wonder, \"Why am I supposed to give a f*ck, again?\"CAN YOU KEEP A SECRET? is about Emma Corrigan, a girl with lots of \"secrets.\" Secrets is in quotes, because most of her secrets are actually lies. Here are a few samples of Emma's secrets: Emma steals her roommate's expensive designer clothes & then lies about it. Emma tells her work friend that she loves the crochet she makes for her, when in actuality she hates them & throws them away (bitch). Emma wears a size four thong that is super uncomfortable because she lied to her boyfriend about her weight. And so on, and so forth.One day, she gets on a plane that goes through some severe turbulence. Thinking she's about to die, she confesses all of her \"secrets\" to her seatmate. Spoiler alert: the plane doesn't crash, and Emma lives to lie another day. She thinks this embarrassing but seemingly harmless incident is behind her, until she sees her seatmate/confessor again...and realizes that he is the man who owns the company where she works. In other words, he's her boss's boss's boss, Jack Harper.I actually really liked Jack. I thought it was hilarious, how he tortured Emma about her secrets. I laughed out loud at some of these passages. Later on the book, he does something that is, admittedly, rather insensitive, but since I had already decided that I didn't like Emma, it didn't bother me - especially since it triggered another chain of hilarity (at Emma's expense, even better). I also loved Emma's roommate, Jemima (the one Emma steals clothes from). I think I was supposed to dislike her, but dear lord, she was funny, and so much more interesting than Emma. And her \"Mummy\"! I loved Jemima's Mummy's advice about men - she is so deliciously evil. It kind of bothered me how casual Emma and Lissy were about breaking into Jemima's room and stealing her stuff, even though she told them not to; I wouldn't want anyone using my things, either. And since this was an act of stealth, they obviously weren't washing them after! Gross and a total invasion of privacy.That's actually the meat and potatoes of my dislike for this book - Emma was not a sympathetic protagonist. I could understand if she was meant to be unsympathetic or if she was the \"before\" to a redemption arc (Marian Keyes does this to great effect), but no, we're supposed to embrace and relate to Emma as the every girl. She was very whiny and self-centered and immature, and I could not relate to her, at all! I mean her reason for why she should get a promotion is \"I'll wear smart suits!\"As if the author knows how dislikable Emma is, the villains in this book are almost cartoonish caricatures of villany designed to make the protagonist seem sympathetic in comparison. Take Kerry, Emma's cousin, and family favorite, who is so oily and repulsive that you would probably see her picture under the dictionary definition of \"smug.\" Or Artemis, who is basically Jemima, without the sagacious \"mean girl\" wisdom. She's just a mean girl without the subtlety.CAN YOU KEEP A SECRET? is not the worst Sophie Kinsella book I've read (SHOPAHOLIC TAKES MANHATTAN receives that honor), but it is far from being the best. The three books I mentioned in the second paragraph of this review are all much, much better. If you're new to this author I'd recommend starting with them.1.5 to 2 stars.", "num_likes": 45, "sort_order": "default", "shelves": ["kissing-books", "chick-lit"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2445240891", "review_id": "2445240891", "date": "Jul 06, 2018", "rating": 1, "user_name": "Melissasfandomworld", "user_url": "/user/show/34871171-melissasfandomworld", "text": "I can’t get over the fact how I annoyed I am with nearly every character that I came across in this book.. let me tell you some more on why I gave this book a 1 star rating. - minor spoilers ahead -I hate how our main character is such a pathological liar. At first, I could excuse her a couple of times because she really was being set back by her family and she did just have a lot of terrible people around her and what not. So I could comprehend it that she was scared to let them see the real her but when the story continues her behavior only gets worse I think and that’s what bugging me most. Even with small things she just almost never told anyone the truth. Her first reaction to everything is her telling the exact opposite of what she thinks and it just annoyed me so much. And aside from that, I just couldn’t care for most of the other characters. Most of them were so incredibly mean and fake and I know the real world can be a hard place to be but being surrounded by THAT many wrong-doing people is laying it on a bit too thick I think. The way her parents ignored her and at the end they turned around completely because of 1 thing said about Kerry, her cousin, and all is forgiven then? One of her roommates Jamima was just cringeworthy and annoyed me so much, lol. Everything that came out of her mouth was hateful and condescending and I can’t believe she had quite a large part being a minor character. Lissy, on the other hand, was one of the few likable characters and she was a great friend. She and Jack were the most likable characters to me. The only reason I finished the book is because I was just curious to see if things would progress and to see how it all ended but well.. I just wasn’t impressed with it all to say the least, unfortunately. The romance wasn’t quite believable as well I think. I feel bad for Connor -her boyfriend at the beginning of the book- because he believed her to be this person who had a lot of the same interests as her, not knowing most of their interests are really a world apart and she’s just ‘lying’ to him to make him happy of some sorts - this had been going on for years, ever since they started dating. And then the way they ended was just so sad for him I think, when she bombards him with the truth all of a sudden and he gets really insecure because of that - which I can understand when you’ve been played and lied to like that. The main character was so unstable. She was running hot and cold within seconds. One moment there’s an extreme outburst of truth out of the blue and the next there’s a sh*tload of lies coming out of her mouth again. And then there’s Jack, one of the two characters I did like. but even he couldn’t seem to get things right by her. She told him about how her perfect first date would look like and he rearranges it all for her as a surprise and it was really sweet and then she’s like ‘well, why don’t I get a choice in the matter of what to eat and such and I would’ve liked that a whole lot more then everything you did to surprise me..’Ugh, my review is all over the place, lol. But it just comes down to this: I did not like this book :(", "num_likes": 15, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/935525744", "review_id": "935525744", "date": "May 12, 2014", "rating": 5, "user_name": "Natasha Polis", "user_url": "/user/show/19208239-natasha-polis", "text": "Such a quick read! BUT THIS BOOK WAS SO MUCH FUN!!!! The main character is hilarious, and Sophie Kinsella had me rolling, cringing, snorting, and crying all through this! An author has never elicited such outward emotions from me before! Definitely one of my favorites!", "num_likes": 15, "sort_order": "default", "shelves": ["favorites"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1149661902", "review_id": "1149661902", "date": "Jan 01, 2015", "rating": 4, "user_name": "Jillian ", "user_url": "/user/show/3101094-jillian", "text": "Adorable and charming!", "num_likes": 15, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2078640499", "review_id": "2078640499", "date": "Oct 19, 2018", "rating": 4, "user_name": "Beth", "user_url": "/user/show/44125660-beth", "text": "3.5 Stars!Super quick Review because I'm about to leave for the weekend!It was really funny, light and also kinda cute!A nice fluffy read, I don't know why I'm loving Contemporary so much, but this has just urged me on further!", "num_likes": 14, "sort_order": "default", "shelves": ["chick-lit", "2018-reads", "audiobook", "4-stars", "stand-alone"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1361964587", "review_id": "1361964587", "date": "Aug 12, 2015", "rating": 5, "user_name": "Michelle", "user_url": "/user/show/22195799-michelle", "text": "\"It's just like Julie Andrews said. When the dog bites, when the bee stings...I simply remember I have a boyfriend - and suddenly things don't seem quite so completely shit.Or however she put it.\"This is my first Sophie Kinsella read. At least her fiction works. I read Finding Audrey last year and loved it so I thought I would definitely give her other books a try. I need to say this book was hilarious. I was hysterical with laughter. I don't read many books that make me laugh quite as hard or as much as this one did. So Emma Corrigan is on her way home from a business trip when the flight gets a little rocky. She doesn't handle flying well so when the plane hits some turbulence she thinks she is going to die and ends up spilling all her secrets to the man sitting next to her. When she doesn't actually die, she eventually learns the man who knows all her dark secrets, is actual is one of the founders of the company she works for and is headed back into the company spotlight. Of course, she is totally screwed and it makes a fantastic read and hilarity ensues. I totally loved how Emma would not just shut up sometimes or how she tried to do something right but then it ended up totally wrong. I love how the relationship builds between her and Jack. How because he knows her secrets there is something easy in their building relationship. It is like he gets her even before he really knows her (if that makes any sense). The other characters are great. Lissy is a wonderful friend and Jemima is totally crazy but in a good way. There were many times when I felt embarrassed for Emma. She put herself in a horrible situation, but it became worth it in the end. I will definitely be reading more of Sophie Kinsella's books. I love being able to laugh while reading. I don't read many funny books like this one. I would recommend this to a slightly more mature audiences because there is cursing, sex, and some more adult appropriate topics mentioned. I'm still laughing as I reflect on this book. It's funny, sweet, embarrassing, and not one to miss. Overall: 5 starsRecommendation: Yes! So funny, I'm still laughing. ", "num_likes": 14, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1480514880", "review_id": "1480514880", "date": "Dec 26, 2015", "rating": 4, "user_name": "Alaina", "user_url": "/user/show/50620706-alaina", "text": "I am a very happy person after reading Can You Keep a Secret? by Sophie Kinsella. I enjoyed it so much because it was so funny. Ever since I reread her shopaholic series I've been itching to dive into more of her books. I want to know how she comes up with such hilarious characters that will have you laughing throughout the entire book. Pretty sure I had some tears falling down my cheeks from laughing so hard. Now we all have been in a moment where we or someone else has over shared. It will always happen no matter who you are or where you are. Well, Emma sure did and I loved her for it. I have no idea how I would have reacted if I was in Jack's shoes hearing what Emma had to dish out. But he did it gracefully and I fell in love with him then too.Also, Emma and Jack were just so refreshing. I don't think I would have been able to handle them together if their relationship was written differently. You fall in love with the both of them around the same time. Other than them, I freaking loved Lizzie. I need a friendship like Emma and Lizzie!!I have nothing bad to say about this book - I just loved everything about it. I can totally see myself rereading it over and over again. Especially after a terrible book. Totally recommendable and enjoyable.", "num_likes": 14, "sort_order": "default", "shelves": ["january-challenge-2018", "contemporary", "humor", "chick-lit", "fiction", "romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1817705285", "review_id": "1817705285", "date": "Dec 14, 2016", "rating": 2, "user_name": "Mebarka", "user_url": "/user/show/15477029-mebarka", "text": "it was a quick fun read .So there is this nothing-special girl Emma ,who doesn't like air planes.One day and during a flight, the plane hits a turbulence ,Emma thought she's gonna die ,so she spilled all her most embarrassing,intimate secrets to the stranger sitting next her.there is no possible way Emma gonna meet that man again right??Unfortunately ,No!It was a fun read for the most part or at least for the first half ,i felt sorry,embarrassed and even annoyed with Emma's attitude. My problem is that there was no climax ,it just kept going with same flow ,which got me bored .But overall it was a fun.", "num_likes": 14, "sort_order": "default", "shelves": ["contemporary"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1304482449", "review_id": "1304482449", "date": "Feb 27, 2018", "rating": 4, "user_name": "Anja H.", "user_url": "/user/show/6054186-anja-h", "text": "*3.75 SECRETIVE STARS*\n“If you can't be honest with your friends and colleagues and loved ones, then what is life all about?” \nOkay, it’s official. I need to read more Sophie Kinsella books!This was a light and funny romance novel and exactly what I needed right now! Even though I was pretty annoyed with Emma most of the time, especially the first half, this was so funny that I didn’t even care.", "num_likes": 14, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/171509156", "review_id": "171509156", "date": "May 27, 2011", "rating": 1, "user_name": "Huma Rashid", "user_url": "/user/show/2845065-huma-rashid", "text": "Oh, God, this book is so wretchedly dumb. I had high hopes - high enough hopes - because my mom's BFF loves Sophie Kinsella. This one looked cute so I figured I'd start off with it. No. Just...no.Where to begin? Contrived plot. The characters are basically in love after a week. A WEEK. The female protagonist is sympathetic enough, though. The bits about fashion left me scratching my head - these must be some of the most oddly dressed girls in the world. Those parts really took me out of the book (stupid and shallow, I know). Another thing - weird word usage. Things like the male protagonist hit himself in the head with his fist after he said someone's name wrong. You may slap yourself on the head (open-palm-like, I mean). You may just kind of touch yourself on the forehead with your fist, but seeing that he 'hit himself in the head with his fist' just made me blink. There are lots of other examples of strange word usage like that.Also, the main male character is supposed to be American, but often uses British-isms. \"Eight nines.\" No, in America, it would have been \"eight times nine.\" Also, he says \"zowee.\" What kind of man says zowee, unless he's eight? Stupid little things like that really took me out of the book, because I pay attention to stupid little details, it seems, and am easily distracted. But still. Ugh. Basically, it was just dumb. Not charming or adorable. There were plenty of parts in there that felt so unnecessary, so frivolous, so ... unrelated to the main plot. It didn't seem like a 'tight' book, like most of the other chick-lit books I've read. Granted, I haven't read that many chick-lit books/romance books, and also, I hate calling them chick-lit because that phrase is just a way to diminish women's writing (Oh, yeah, it's *just* chicklit, or it's *just* romance, it can't sit on this shelf with all the srs bzns fiction), but the similar books I have read have been tight. I'm thinking specifically of Julia Quinn's books, which I LOVE. Every single damn one is just so tight. There's not even a frivolous sentence in there, and that's why it's so engaging: because on some level, you can just tell that every scene matters, every sentence matters, so there's no time for you to get bored and zone out while reading and start wool-gathering. This book was not at all like that. I read this as kind of a palate cleanser. I always read a fun little novel when I've read several long, 'srs bzns' books about politics or history or gender theory or whatever, and that was what I read this as. And now I want three hours of my freaking life back. Ugh. Never again.", "num_likes": 9, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/293597807", "review_id": "293597807", "date": "Mar 13, 2012", "rating": 5, "user_name": "Kajal Nehra", "user_url": "/user/show/7253942-kajal-nehra", "text": "AHHH! This book was... It was... I'm out of words! It was that good.\n'… knight in shining armour is not a realistic option. But there's a part of me that wants a huge, amazing romance. I want passion. I want to be swept off my feet. I want an earthquake, or a … I don't know, a huge whirlwind … something exciting. Sometimes I feel as if there's this whole new, thrilling life waiting for me out there, and if I can just—'\nOh god I enjoyed this book trememndously! It was a roller-coaster ride of emotions for me. One minute I was cracking the hell up laughing out loud so bad, and the next minute I was crying or was at least on the verge of tears.Emma was a superb and such a funny character! God, I gotta love her. I think one of the words to describe her could be ambitious. Yes that's it. From the beginning I felt that's what she was. And did mention funny? Funny she was.There were a few scenes which rocked my world! I love Jack Harper so much for them! In one of them I was all: SEE!? Who the hell understands the words Strategic and Logistical and Competencies and Rebranding and Pro-ceramides!? While the perfectly simple common layman english can be used, why do some people just have to use these. Bloody-show offs!I swear this book brought out all sorts of emotions in me and I absolutely love it when a book is capable of doing such a thing.As an afterthought I'd like to add the fact that Jemima was a total bitch! I quite fervently hated her and there-but-not-really-there Mummy! And also Kerry! She was a big-time bitch! Why couldn't they just leave the sweetheart Emma alone!?LOVELY STORY! READ IT READ IT READ IT! GOOOOOOO! :*", "num_likes": 9, "sort_order": "default", "shelves": ["favorites", "made-me-cry", "so-sweet-that-i-might-be-a-diabetic", "funny-as-hell"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1676087841", "review_id": "1676087841", "date": "Jun 22, 2016", "rating": 5, "user_name": "Linda Dobinson", "user_url": "/user/show/32368211-linda-dobinson", "text": "This book, like the other Kinsella standalone novels I have read, is a joy.When nervous flier Emma Corrigan thinks they are going to crash, her little corner of the plane becomes a confessional as she spills all of her little secrets to the random bloke sat next to her. Emma expects never to see him again so when he appears in her life she is mortified, he however,is intrigued.I loved Emma from the moment see opened her mouth. She is ''just an ordinary, nothing special girl''(p257). Except she isn't. Emma is bright (so what if she doesn't know what NATO stands for), funny, resourceful, ambitious (but not ruthless), and kind - well it is Artemis' plant she is trying to annihilate not Artemis herself. I was rooting for her and I was happy when she wiped the smile off her cousin's face.I found her relationship with her parents really sad, but unfortunately it does happen, parents do sometimes compare their child to a cousin and find that child wanting. I was surprised she forgave them so easily.Maybe I am wrong to do so, but I loved bad girl Jemima and the lengths she goes to to protect her expensive items from Emma and Lissy. I think a love-to-hate character adds colour to a story.I loved Jack Harper. I loved the way he toyed with Emma, letting her know in not too subtle ways that he remembered her secrets one after another, and letting her worry that there would be consequences . My only grumble was him calling her a ''nothing-special girl''. In Emma's shoes I am not sure I could forgive those three words...well it would take lots of sparkly things.I agree with Emma's last words at the end, that it is normal to have a few secrets. I am glad this book is not a secret and I recommend it.", "num_likes": 9, "sort_order": "default", "shelves": ["favourite-contemporary"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3201273121", "review_id": "3201273121", "date": "Feb 22, 2020", "rating": 2, "user_name": "Melissa H", "user_url": "/user/show/58213322-melissa-h", "text": "This book was a cute rom-com office romance. I liked the premise of this book: after having a terrible meeting for work, Emma boards a plane & during some severe turbulence she gushes out all her secrets to some random man next to her. Turns out he is actually her boss, as in the owner of Panther Cola, a millionaire who has been absent for about a year. This book was set up for success, but I felt like the love interest, Jack, was just hard to get a read on. He basically had no personality and you literally only learn who he is in the last 2 pages of the book. I just felt no connection to Jack, she literally had more interaction with Paul, her immediate boss.I wanted to like this book more than I did. Unfortunately, it just fell quite flat. Emma was an interesting character with family issues that seemed halfway resolved at the end of the book. I just felt like this book was extremely surface level and I didn’t understand why she dated Jack over anyone else. This book was written in 2004 and there are some aspects of this book that date it for example: referencing that Prince William is too young for one of Emma’s roommates.I read this book super quickly in less than 24 hours. But I was always waiting for there to be more… sadly it didn’t happen.", "num_likes": 9, "sort_order": "default", "shelves": ["disappointed", "romance", "new-adult", "standalone", "rom-com", "contemporary", "office-romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/209293776", "review_id": "209293776", "date": "Sep 16, 2011", "rating": 5, "user_name": "Aly is so frigging bored", "user_url": "/user/show/4290492-aly-is-so-frigging-bored", "text": "Gender: Chick LitHero: Jack HarperHeroine: Emma CorriganRating: 5* Wow I so didn't expect to like this book. But I did!!!I was putting this off for 2 or 3 weeks since my good friend Madu told me about it. And today I decided to take it with me on the train. It was a blessing and a curse: I loved it! I had so much fun reading it and I was so happy that there are other goofy people out there :D. That was the blessing, the bad thing was: I read it on a frigging train and I wanted to laugh and I couldn't and when I did I tried to cover it, but lets face it, how many times can you cough until people start looking alarmed that maybe you have some infectious disease. Emma was such a normal person with problems and insecurities. I loved the part where she blurted all her secrets to a stranger :D It's so much easier to stuff like that to a complete stranger then someone you know :)) I\\ll stop here because I feel the urge to tell spoilers and some people I know don't like this :D", "num_likes": 9, "sort_order": "default", "shelves": ["contemporary"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/805284732", "review_id": "805284732", "date": "Dec 30, 2013", "rating": 5, "user_name": "Branwen Sedai *of the Brown Ajah*", "user_url": "/user/show/5701086-branwen-sedai-of-the-brown-ajah", "text": "\"I've been transformed. I'm a new Emma. Far more open than I used to be. Far more honest. Because what I really learned is, if you can't be honest with your friends and colleagues and loved ones, then what is life all about?\"Emma has secrets. Big deal, right? Doesn't everybody? But Emma has a lot of little secrets, and sometimes they are hard to manage. So when she lets loose with a torrent of word vomit on a plane ride and confesses all her secrets to the man sitting next to her she feels a bit relieved. After all, its not as if she's ever going to see him again, right? Wrong.This book absolutley knocked me off my feet with its humor and overall sweetness. It's a romance, but it is also a story about knowing who you really are as a person. About knowing what matters and what is important to you. And it's about being able to let yourself go and really trust the people you love. And it is absolutely hilarious. There were quite a few moments where I had to keep myself from laughing out loud at some of Emma's antics.This was a great, fun read!", "num_likes": 9, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1430467833", "review_id": "1430467833", "date": "Nov 01, 2015", "rating": 3, "user_name": "bookaholic_kim", "user_url": "/user/show/46045830-bookaholic-kim", "text": "How would you react if the stranger whom you have told all your crazy/random secrets about yourself turned out to be your big boss? So it happened on a plane ride. Emma thought the plane would crash and ended up telling all her secrets to the guy sitting next to her. Then she met again the man and he is not just a stranger but the owner of the company where she is working. Interesting story for Jack knows everything about Emma from her little secrets to her personal secrets. Their encounters in the story are my favorite part.The story is told in Emma’s POV and I have mix emotions for her, she is annoying but funny and stupid then smart the next. She is kind of relatable in some part of the story but most of the time I feel irritated, but maybe that is really how her character was written.In general, giving it 3/5 stars.", "num_likes": 9, "sort_order": "default", "shelves": ["audiobook", "read-in-2015"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/743994717", "review_id": "743994717", "date": "Aug 31, 2018", "rating": 3, "user_name": "Jen (The Starry-Eyed Revue)", "user_url": "/user/show/4659650-jen-the-starry-eyed-revue", "text": "At times, I adored this story and the characters, and at others, I was livid with them. And it started out so well! I mean, I still enjoyed it in the end but all of those trust issues -- well-earned, I might add -- and the secrecy, it made me reluctant to even like the love interest, despite my initial feelings toward him. Plus, it seemed rushed...their whole relationship. And I think I almost died of embarrassment on behalf of the main character. I don't know how she showed her face after that. She was definitely made of stronger stuff, that's for sure.", "num_likes": 9, "sort_order": "default", "shelves": ["2018", "adult", "audiobooks", "contemporary", "library"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/572501614", "review_id": "572501614", "date": "Mar 27, 2013", "rating": 4, "user_name": "Pamela", "user_url": "/user/show/18785289-pamela", "text": "4.5 stars - I think I had a smile on my face the whole time I was reading this! A cute, funny story with some likeable and not likeable characters. I deducted half a star because I thought the ending could've been flushed out a little better, but overall it was pretty darn funny.", "num_likes": 9, "sort_order": "default", "shelves": ["2015-books"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/865869827", "review_id": "865869827", "date": "Feb 26, 2014", "rating": 4, "user_name": "Love Fool", "user_url": "/user/show/29084789-love-fool", "text": "These kinds of books made me fall for Sophie Kinsella. They are light, funny, enjoyable, and a quick read. Sure, these books become a little unrealistic but that's the joy of reading, you escape the real world and go beyond. Add this to your summer/beach reading list. ", "num_likes": 9, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2721493433", "review_id": "2721493433", "date": "Feb 21, 2019", "rating": 3, "user_name": "fatin", "user_url": "/user/show/43747924-fatin", "text": "full review now up on my blog!being honest can be quite refreshing at times i guess. maybe i should admit that this book has happily gotten me out of my miserable reading slump. ", "num_likes": 9, "sort_order": "default", "shelves": ["read-in-2019", "humour", "rich-people", "contemporary", "romance", "adult"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1923790958", "review_id": "1923790958", "date": "Feb 24, 2017", "rating": 1, "user_name": "Deborah Pickstone", "user_url": "/user/show/37849334-deborah-pickstone", "text": "Please don't judge me; I only read it for a challenge. The usual idiotic female character finds love. Men must be barmy. Will never understand why so many read this sort of thing with pleasure!", "num_likes": 9, "sort_order": "default", "shelves": ["authors-most-annoyed-by", "exceptions-to-my-reading-rules"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/31004033", "review_id": "31004033", "date": "Aug 23, 2008", "rating": 4, "user_name": "Jc", "user_url": "/user/show/1452470-jc", "text": "I decided to give Sophie Kinsella another try (I started a Shopaholic book once, but must have been in Chicklit burnout because I couldn't finish it), and picked up Can You Keep a Secret?. The premise is that Emma has a really horrible day that ends in a terrifying plane trip. In a panic, she turns to the man sitting beside her and spills every secret she has ever had: lying about her grades on her resume, that she hates jazz even though her boyfriend thinks she loves it and continues to buy her tickets to concerts, how she lost her virginity, her real weight - secrets small and large tumble out her mouth uncontrollably. Then when she shows up at work, it ends up that the guy owns the company that she works for, and remembers each and every secret she told. There are two things that make Can You Keep a Secret? stand out in my mind. First, it is laugh out loud funny. Second, Emma is a thoughtful, believable protagonist. I suggest this book to people who are looking for a fun read with a sweet romance.", "num_likes": 8, "sort_order": "default", "shelves": ["chicklit"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/553450947", "review_id": "553450947", "date": "Mar 05, 2013", "rating": 4, "user_name": "Gobokairina", "user_url": "/user/show/4205209-gobokairina", "text": "Funny.Cute. I am not a Shopaholic reader but this hilarious chic lit absolutely has influenced me to find other Sophie Kinsella’s books. Emma spills all her secrets to a stranger on a plane when she thinks they're about to die. But then this strange guy turns out to be the co-founder of the company she works for. OMG! *wink*Jack Harper; a multi-millionaire bachelor that the girls would die for. But literally, he only opens his heart to this nothing-special-ordinary-girl named Emma. He felt extremely honoured and relief when there’s somebody who at least told him everything-inside-out. Emma is just being honest from the day one they had met. Then the conflict arises, Emma felt betrayed and deeply hurt. So, this a time for Jack to take the action. Go Jack! It is a quick and cheeky read. Bit cliche in some parts, but who cares. I laughed a LOT and I just might to re-read this book when I need to have a good laugh and a happy ending.", "num_likes": 8, "sort_order": "default", "shelves": ["koleksi-ga", "favorites", "e-book"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1975903222", "review_id": "1975903222", "date": "Apr 19, 2017", "rating": 4, "user_name": "Mela", "user_url": "/user/show/41757430-mela", "text": "Two things:1. Warning. Don't read it in public. I have to at least two times put down the book and wait until I stop laughing. It was so funny. And one time I put down the book and went to the kitchen saying \"Oh no, crap, crap\" and other swearwords. I was so worried about what happened.2. QNPoohBear, I want to hug you for your recommendation. I have read it thanks to you.What can I add? I have a great time. This book brought me back faith in contemporary romances (after a few worse).The first half of the novel is so funny, simply hilarious. The second is a little more serious. Nonetheless it is a witty romance with a glance at the world of a young modern women, our dreams, fears and reality.PS I admit, some aspects (eg. the case of Emma's promotion) are a little bit unrealistic but I didn't expect perfection, I expect an amusing reading and I had it.", "num_likes": 8, "sort_order": "default", "shelves": ["british-literature", "humor", "contemporary-romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1253663881", "review_id": "1253663881", "date": "Apr 13, 2015", "rating": 5, "user_name": "Mia  Bakhthiar", "user_url": "/user/show/41015271-mia-bakhthiar", "text": "Oh my gosh. This was a perfect beach read.It was insanely hilarious, cute and just the quintissential romcom book I've read in so long! This is my first Kinsella book, and I've jist fallen in love with her instantly!This was such a feel-good read! Recommend it to anyone with a soft spot for quirky romances.", "num_likes": 8, "sort_order": "default", "shelves": ["read-within-24hrs", "favourites", "funny"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2540695663", "review_id": "2540695663", "date": "Sep 24, 2018", "rating": 3, "user_name": "Sara", "user_url": "/user/show/69932312-sara", "text": "There's something about Sophie Kinsella's books that keep drawing me back in.Its just fun, easy reading that is at its core, pure escapism. I hear they're making this into a movie and i'm very intrigued to see how it turns out!", "num_likes": 8, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1063973183", "review_id": "1063973183", "date": "Sep 25, 2014", "rating": 4, "user_name": "Giulia Alayne", "user_url": "/user/show/32211345-giulia-alayne", "text": "This was really fun and cute! Emma reminded me a lot of Bridget Jones so bonus points for that! Very entertaining.", "num_likes": 8, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1703255076", "review_id": "1703255076", "date": "Jul 29, 2016", "rating": 4, "user_name": "Dana", "user_url": "/user/show/55822015-dana", "text": "It was sooooo cute))) I'm totally in love with Sophie Kinsella's writing. This book is perfect summer read. I just can't stop smiling ;)", "num_likes": 8, "sort_order": "default", "shelves": ["adult", "romance", "contemporary"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2919319020", "review_id": "2919319020", "date": "Aug 01, 2019", "rating": 3, "user_name": "naz (moodreader) ♡", "user_url": "/user/show/68987430-naz-moodreader", "text": "Another fun quick read. Wish the end was longer, everything wrapped up so fast :(", "num_likes": 8, "sort_order": "default", "shelves": ["2019", "romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3538361931", "review_id": "3538361931", "date": "Sep 08, 2020", "rating": 3, "user_name": "Sanjana", "user_url": "/user/show/106424524-sanjana", "text": "This book is filled with cliches. But also relatable moments. A good fun book. Would probably make a nice pick for a book group with just gal pals. Can totally imagine it! ", "num_likes": 8, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/4012587725", "review_id": "4012587725", "date": "Feb 12, 2022", "rating": 3, "user_name": "Kerova Eli", "user_url": "/user/show/135324716-kerova-eli", "text": "2.75, so painfully unfunny🙄", "num_likes": 7, "sort_order": "default", "shelves": ["2022", "read-in-english", "rom-coms", "books-to-tv", "rated-3-stars"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/4502625440", "review_id": "4502625440", "date": "Jan 25, 2022", "rating": 4, "user_name": "Mona", "user_url": "/user/show/10827474-mona", "text": "He was a stranger. He was supposed to be a stranger. As I travel home that evening, I’m still reeling with the injustice of it all.The whole point about strangers is, they disappear into the ether and you never see them again. They don’t turn up at the office. They don’t ask you what eight nines are. They don’t turn out to be your mega-boss employer. Well, all I can say is, that’s taught me. My parents always said never talk to strangers, and they were right. I’m never telling a stranger anything again. Ever.************************************************“Well, this is the same! He knows all my most intimate, personal details! But the difference is, I can’t just leave! I have to sit there and pretend to be a good employee! And he knows I’m not—”************************************************I feel all agitated, like one of those snow globes you see resting peacefully on shop counters. I was perfectly happy being an ordinary, dull little Swiss village. But now Jack Harper’s come and shaken me up, and there are snowflakes all over the place, whirling around until I don’t know what I think anymore.And bits of glitter, too. Tiny bits of shiny, secret excitement.************************************************“What if he suggests dancing?” says Lissy slyly. “What will you do then?” A look of total panic crosses Jemima’s face, then disappears.“He won’t,” she says scornfully. “Englishmen never suggest dancing.”“Fair point. Have a good time.”************************************************“You know, I wish I’d never sat next to you on that stupid plane. You go around saying all these things to . . . to wind me up, behaving as though you know me better than anyone else—”“Maybe I do,” he says quick as lightning. “What?”“Maybe I do know you better than anyone else.”************************************************“She believes in love and romance. She believes her life is one day going to be transformed into something wonderful and exciting. She has hopes and fears and worries, just like anyone. Sometimes she feels frightened.”He pauses, and adds in a softer voice, “Sometimes she feels unloved. Sometimes she feels she will never gain approval from those people who are most important to her. But she’s brave and good-hearted and faces her life head-on.”************************************************In fact, I am never talking again, full stop. All talking ever seems to do is get me into trouble. If I hadn’t opened my mouth on that stupid plane in the first place, I wouldn’t be in this mess now.I will become a mute. A silent enigma. When people ask me questions, I will simply nod, or scribble cryptic notes on pieces of paper. People will take them away and puzzle over them, searching them for hidden meanings", "num_likes": 7, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1944368118", "review_id": "1944368118", "date": "Mar 28, 2017", "rating": 4, "user_name": "Gabriela", "user_url": "/user/show/14484233-gabriela", "text": "A super cute and light read. I really enjoyed it! *RTC*", "num_likes": 7, "sort_order": "default", "shelves": ["adult-fiction", "fiction", "contemporary", "romance", "digital-read"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/41620333", "review_id": "41620333", "date": "Jan 02, 2009", "rating": 4, "user_name": "Antof9", "user_url": "/user/show/1717549-antof9", "text": "Re-read April 11, 2011:What I always tell people is that it's good this was the first Kinsella I read, because if I'd read those dumb Shopaholic books first, I'd never have bothered with this. That said, this made me laugh out loud the first time I read it, and everyone I've ever talked to about it said the same thing. Ironically, many of us also read it on an airplane, which is funnier if you've read the book.Anyway, with all my recent heavy reading and because I BookCrossed my first copy of this, when I saw it at Goodwill the other day, I grabbed it. When I read heavy books, I need junk food for a break, and this was just the ticket. Plus, I read part of it on the back deck yesterday and that was lovely too.I'm lending this to a friend, but keeping it in the permanent collection because it really is a good \"break\" book.May 1, 2005 review:I really enjoyed this book! MUCH more than the stupid Shopaholic books :)Emma was so loveable and sincere! Jack was fun, and of course, very appealing :) I liked the whole \"nobody will tell the boss the truth\" thing and Jack and Emma's way around that. I was also very entertained by his American-ness paired with her Britishness.I wish more of the Kinsella books were like this, and if there's a sequel, I'm all over it :)", "num_likes": 7, "sort_order": "default", "shelves": ["2011-read", "re-read", "2005-read", "bwa-ha-ha", "good-chicklit"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/123635814", "review_id": "123635814", "date": "Sep 27, 2010", "rating": 5, "user_name": "Jane Stewart", "user_url": "/user/show/3789528-jane-stewart", "text": "Great for laughter.Normally, I only want to read romance novels. This is not a romance novel. There are no intimate love scenes. This is a cross between chick lit and romantic comedy. I loved it, because I laughed so much. At first I did not like reading about Emma, who was in the habit of telling lies. She lied for many reasons including office politics and politeness. However, once Jack entered the picture at her office, it became hilarious. Her white lies made great comedic material. I didn't want to put it down. After I read the book, I went back and reread all of the Jack conversations. I loved the twinkle in his eyes as Jack asked Emma questions in front of other people, and as she answered the questions with lies, she knew that he knew she was lying.Sexual content: none. Setting: current day Scotland and England. Copyright 2004. Genre: chick lit, romantic comedy.To date, I've read the following Sophie Kinsella books.5 stars. Can You Keep a Secret? Copyrt 2004. Review Date 2/21/07.1 star. Confessions of a Shopaholic. Copyrt 2001. Review Date 3/14/08.1 star. Remember Me? Copyrt 2008. Review Date 8/11/08.", "num_likes": 8, "sort_order": "default", "shelves": ["humorous-contemporary-romance", "5-star-romance"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/303961754", "review_id": "303961754", "date": "Mar 31, 2012", "rating": 4, "user_name": "Lisa Kay", "user_url": "/user/show/2459470-lisa-kay", "text": "[image error]★★★★☆ (This is a review of the audiobook.) I liked this one. I didn’t love it, like I thought I would, but I liked it a lot. (view spoiler)[I felt the heroine jumped into a new relationship too soon after her break-up with her current boy-friend. (hide spoiler)] But, with the hero as yummy as he was, maybe I would have, too.Some of the humor didn’t work for me, but some of it did. In fact, there were a few laugh out loud moments. Maybe this can be credited, in part, to Kate Reading’s wonderful delivery. Love listening to her narrations. She does a great job of Jack’s American accent. Hey, we all have secrets, right?", "num_likes": 7, "sort_order": "default", "shelves": ["zzcover-pink", "buddy-read", "m-library-sj-audio-ocd", "setting-england", "genre-romance-contemporary", "2012-in-2012-group-challenge", "take-flight", "genre-chick-lit-ish", "m-library-sj-cd", "genre-romance-love-laughter"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1890939067", "review_id": "1890939067", "date": "Feb 02, 2017", "rating": 4, "user_name": "Sam Chase", "user_url": "/user/show/33142853-sam-chase", "text": "Rating: 4 stars :)This was such a fun and enjoyable book to read! It's definitely my favorite Kinsella novel so far, though certainly not the best romantic comedy ever written. I loved the aspect of honesty and self-confidence, which was very central to this book, as well as acceptance- both self acceptance and the acceptance of others. This book is prime rom-com material, I would definitely see it in on the big screen. One comment- it felt really short, and I don't know why. More, please!", "num_likes": 7, "sort_order": "default", "shelves": ["4-stars"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1425074161", "review_id": "1425074161", "date": "Dec 20, 2016", "rating": 2, "user_name": "NoraReads", "user_url": "/user/show/5759021-norareads", "text": "This book started out really good, I was having so much fun reading it. But towards the halfway point, things went downhill for me. The main character started acting so...stupid. She was so annoying to the point where I just couldn't take it anymore. I'm extremely disappointed with this book. The only reason that I'm giving it 2 stars and not one is because of the first 100 pages. ", "num_likes": 7, "sort_order": "default", "shelves": ["dnf"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/255500823", "review_id": "255500823", "date": "Jan 03, 2012", "rating": 3, "user_name": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "user_url": "/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "text": "A fun read, complete with wacky characters, crazy situations and lots of humor. I've read all the shopaholic series but I think this one is much better and makes it my favourite Sophie Kinsella novel so far. ", "num_likes": 7, "sort_order": "default", "shelves": ["fiction", "bookcrossing"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3978530005", "review_id": "3978530005", "date": "May 02, 2021", "rating": 5, "user_name": "Anjali Sharma", "user_url": "/user/show/102918463-anjali-sharma", "text": "It left me with a warm, fuzzy feeling. The protagonist, Emma Corrigan was really likeable.When her plane hits a serious turbulence and she feels that she is going to die soon, she blurts out all her secrets to a stranger sitting on the adjacent seat, only to find out later that the stranger is Jack Harper, co-founder of the company where she works.The change in Emma's character (for good) as the book reached its end was refreshing. I loved seeing her accepting herself as she is and not make a fuss out of little mistakes and not keeping them secret rather owning them and apologising or correcting them.The book kept me engaged thoroughly, it was entertaining and funny. I lost the count of how many times I smiled, giggled or laughed out loud while reading it. The book made me feel good, something to take note of if you are looking to read something to lighten up your mood.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2733999437", "review_id": "2733999437", "date": "Mar 03, 2019", "rating": 2, "user_name": "Sandra Harvey", "user_url": "/user/show/94240563-sandra-harvey", "text": "I read this when I took a trip last year to Spain. This book did make me laugh out loud. Also the twist was funny. I did get some weird looks at the poolside whilst reading this! ", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1945602319", "review_id": "1945602319", "date": "Mar 20, 2017", "rating": 4, "user_name": "Neenee", "user_url": "/user/show/15157537-neenee", "text": "So many lol moments. ", "num_likes": 5, "sort_order": "default", "shelves": ["a-whim", "my-2017"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1303460064", "review_id": "1303460064", "date": "Mar 22, 2017", "rating": 4, "user_name": "Marisa Bisaccia [book whisperer]", "user_url": "/user/show/43799286-marisa-bisaccia-book-whisperer", "text": "I really enjoyed this book. It was a fun and fast read of chic lit. A very nice romance novel that was hard not to stop reading. I wanted to know what was going to happen next and was filled with emotions within the story. I would suggest this for women! It's a great read!!", "num_likes": 6, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/121725531", "review_id": "121725531", "date": "Sep 14, 2010", "rating": 1, "user_name": "Katy", "user_url": "/user/show/3495215-katy", "text": "What a load of hooey.Look, I like \"chick lit\". I really do. Marian Keyes is one of my favorite authors because her characters are clearly developed, her stories are engaging and relatable, and so many bits are laugh-out-loud funny. I like to be moved by what I read: moved to laugh, moved to tears, moved to think... This book will do none of those things (well, it moved me to think \"I want those hours of my life back!\")I thought \"Can You Keep a Secret?\" was one of the worst books I've ever read--it was definitely the worst piece of women's lit I've ever encountered. I was VERY close to closing the book halfway through and counting my losses--but so many people seemed to like the book I thought it might miraculously recover. No such luck. In fact, it gets worse.Our main character is an insecure loser--no wit, no charisma, and no common sense. Every sentence of hers starts with \"Err, Umm, Uhhh...\" She's bumbling in a totally un-charming way. The \"romancing\" between the two main characters consists of 2 disastrous dates, one where he is cold, controlling and pre-orders everything for her and one that lasts all of 2 minutes before he runs off with no explanation. So the next time she sees him she sleeps with him. Naturally. And we're supposed to get goosebumps when they end up together? Urgh? The ONLY reason we're given for Emma liking Jack is that she's a lowly assistant and he's the hot owner of the company and has tons o' money. True story. The way Emma treats her boyfriend is really despicable. She tells him she'll move in with him, but at her boss's provocation she breaks up with her boyfriend and goes on a date with her boss the next night! And this is after her boss spends the evening consoling the boyfriend. And the author doesn't present this as a flaw in their characters. What a joke--these people are hot messes.And Emma's relationship with her parents/cousin is so fake and ridiculous. Her parents favor the cousin--laud all praise and attention on her, and when Emma finally points it out, they're shocked, send the cousin away, and finally tell her that they love her. My, what wonderfully crafted storytelling! SNOOOOORE!!!This book was unfunny, predictable, boring, and insulting to the reader. It reads like it was written for 13-year-olds. Example: Emma crosses her fingers behind her back every time she lies. Gag. I like my chick lit to have a STORY and some WIT--for the main characters to be strongly developed. Alas, this book is none of those things. I would give it no stars if I could. And if I could write in library books, I would write on the first page: \"Halt! Close the cover! Save yourself!\"", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2950567549", "review_id": "2950567549", "date": "Jun 08, 2020", "rating": 2, "user_name": "Imme van Gorp", "user_url": "/user/show/101358081-imme-van-gorp", "text": "|| 2.0 stars ||Well, first of all, Can You Keep a Secret? has a way too dumb, ditzy, superficial and basic main character to ever be truly enjoyable. Emma gets on your damn nerves for a lot of stuff she thinks or does. She is supposed to be this super relatable air-head, but if I’d ever be able to relate to her for even one bit, I would honestly want someone to shoot me in the head. She also has way too high expectations for things she really has no reason; for example, Emma wants to get a promotion, but she literally, without any exaggeration, seems to suck at every aspect of her job. And to make matters worse, she doesn’t just want a promotion, she actually thinks she is going to get one (fairly so, in her opinion), but girl.. for what? For what reason would anyone want to promote you? Mad. Absolutely bonkers.I have to admit though, Emma did have some personal growth in the end, but not enough by a long mile and I wasn’t impressed to say the least.Then we get to the main romance: Emma and Jack. Oh.. where do I start? Simply said: I just wasn’t having it. Their chemistry was non-existent. I didn’t like either of them and I also couldn’t quite understand why any of them would like the other so much. It felt forced and kind of came out of nowhere.As opposed to the main romance, this book does have a good female friendship in Emma and Izzy. They go way back and are always there for one another. They even do these little things together that make their friendship seem organic and realistic. I liked it.Now.. the humour. I was promised a humorous chick-lit, but instead I got an eye-roll worthy cringe fest. I think most of the things that were meant to be “hilarious” just made me uncomfortable or annoyed. Well no, alright, alright, I am overreacting. It was indeed enjoyable at times, but not what I’d call funny. I didn’t laugh out loud one time, maybe a smile once or twice. I expected more than that to be honest.Overall, I wasn’t very satisfied. It didn’t give me any of the things I want from this book genre. So, yes, you can call me disappointed.", "num_likes": 5, "sort_order": "default", "shelves": ["workplace", "1st-person-pov", "contemporary", "romance", "single-pov", "chick-lit"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1705458576", "review_id": "1705458576", "date": "Jul 21, 2016", "rating": 4, "user_name": "Isabella", "user_url": "/user/show/33151336-isabella", "text": "Actual Rating: 4 StarsSoundtrack: On My Mind by Ellie Goulding\n“I feel all agitated, like one of those snow globes you see resting peacefully on shop counters. I was perfectly happy being an ordinary, dull little Swiss village. But now Jack Harper’s come and shaken me up, and there are snowflakes all over the place, whirling around until I don’t know what I think anymore. And bits of glitter, too. Tiny bits of shiny, secret excitement.”\nClever, outrageous, and sweet, Can You Keep a Secret? captures the adorable insanity of any good rom-com you have seen!There was a slow beginning, and there were quite a few lulls between conflicts, so sometimes I hesitated about whether or not to finish this story; but, boy am I glad to have finished it, as that magical, true connection to the characters smacked me in the face in the final chapters and epilogue. So many witty quotes, comedic flukes, and engaging relationships fill this book, particularly past its midpoint. If the really gripping situations had begun earlier, I think I would have enjoyed it a bit more. Nonetheless, this is a good book, and if you enjoy romantic comedy, it is a cute, entertaining tale to share with your girl friends (or guy friends, if you prefer).Mixed feelings were with me throughout, yes, but in the end, I reflected on how many times this story made me smile, giggle, shake my head, or bite my lip, and I found that those times were many. Then, I knew that Sophie Kinsella fed my heart something nice.", "num_likes": 5, "sort_order": "default", "shelves": ["reviewed", "physical-copy-read", "rereadable-faves", "book-boyfriends"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2017300025", "review_id": "2017300025", "date": "Jun 02, 2017", "rating": 4, "user_name": "lacy white", "user_url": "/user/show/51379803-lacy-white", "text": "This was one of those really cute fluffy reads with so much cliches that we should hate but we just can't help but read. It was just adorable. It really was. If there is one thing that Sophie Kinsella knows how to do, it is fluffy books and fun dialogue. Honestly I spent most of the book snickering and giggling. I even laughed out loud at times which is rare for me. Emma is a typical young adult. She is trying to find her place in this world. She also has a bunch of secrets she has kept from her friends, family and co workers. On a super scary plane ride, in a fit of panic, she tells a complete stranger every single little secret. Then that stranger turns out to be her boss. Emma was fun. I love her dialogue and her thought process. She was completely irrational at times but she meant well. I enjoyed learning about all her secrets. In all honesty, her secrets weren't that bad but they did hurt the feelings of several people she knew. I was really rooting for her and Jack. They had such a fun chemistry even though it was kind of insta love. Sometimes, insta love isn't always a bad thing. If you are looking for an in between book or a light read after reading some heavy stuff, I suggest this book. I finished it in about 3 hours (but I am an incredibly fast reader) so it honestly won't take long. Don't expect any deepness or anything like that. Just enjoy the ride of a fun, sometimes irrational young adult. ", "num_likes": 7, "sort_order": "default", "shelves": ["4-stars", "own", "2017", "k"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2382799203", "review_id": "2382799203", "date": "May 05, 2018", "rating": 4, "user_name": "Wendy Bunnell", "user_url": "/user/show/20668719-wendy-bunnell", "text": "3 1/2 stars, rounding up for Goodreads. This was a book club pick, as I hadn't read any Sophie Kinsella before, but had certainly heard of her. A little more chick lit than my usual tastes, and it's probably the Barbie dream house pink cover, but I wouldn't have picked this on my own. Isn't that why we go to book clubs though, to read books we wouldn't have selected? So I read it, and it was light and fluffy and a very easy read. Certainly lighter and fluffier and a more enjoyable read than Tangerine which I just finished yesterday. It was a breath of fresh air. I loved that she was totally pulling off first person present tense, all from Emma's POV. This is my favorite POV, and sometimes people say it's only acceptable in YA lit. Emma's not ancient, but she's no teenager. Jack was a decent protagonist, but I really thought his big secret was that he wasn't really American because he said some things that really aren't American. He said some beverage was his favorite tipple. What? And he didn't ever mention what part of America he's from. We Americans can't help ourselves, and there are huge regional differences. And then, at the costume party, he's dressed like a cowboy? This whole scene reminded me of an episode of Peppa Pig where the nursery school kids had to dress like the countries of the world and the dog character was supposed to be American so they dressed him like a cowboy. Fun little romp, easy as Saturday afternoon.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1019467384", "review_id": "1019467384", "date": "Aug 07, 2014", "rating": 5, "user_name": "V_Nerdbooks", "user_url": "/user/show/11412285-v-nerdbooks", "text": "Book:  Can You Keep a SecretGenre: RomanceType:  Audiobook.Book rating: ☆☆☆☆•5 Narration rating: ☆☆☆☆•5  Review Loved this book, my first but not last read of Sophie Kinsella. This had me laughing out loud a lot of times.Emma is on a flight that hits turbulence, Emma is a nervous flyer, a very nervous flyer. Emma thinks that she is going to die.........so she starts talking to the man next to her.Except she doesn't just talk to him, she gets an extreme case of verbal diarrhea and tells him everything. .....EVERYTHING!!!Like the fact that she wears knickers 2 sizes to small, and that she hasn't found her G spot yet, oh yes and that the company she works for has crappy coffee, a shitty manager and she threw away a clients details. The flight landed fine and she went away embarrassed, but safe in the knowledge that she would never see the man again so it doesn't matter.............Only the man turns out to be the founder of the company, the big cheese, the CEO of the company, and just so happens to visit their offices for a few days.There are some cracking one liners and I thoroughly enjoyed this little slice of fun4•5 ☆", "num_likes": 5, "sort_order": "default", "shelves": ["completed-review", "will-re-read", "get-this-one-asap", "audiobooks", "bloody-lopsided-smile-grr", "4-and-a-half-stars", "book-boyfriend", "2014-read"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1496557006", "review_id": "1496557006", "date": "Jan 05, 2016", "rating": 4, "user_name": "Kamalia", "user_url": "/user/show/1334245-kamalia", "text": "This is my first time reading a Kinsella book and i loved it! Im rating this book 4.2 out of 5 stars!The start was undeniably slow, i read 40 pages when i first started. But after a few more slowish chapters IT GETS SO EXCITING.Firstly, i totally needed a light and fluffy read and this was totally it. THE MAIN CHARACTER IS SO FUNNY! I actually laughed OUT LOUD quite a number of times. She seems very naive and overly dramatic but at the same time so honest and so real.I didn't really fall for the love interest that much but i really did enjoy the story and the romance. The whole concept of secrets and honesty is fantastic, and the subtle moral values from it really did affect me positively.Something about the writing especially starting halfway just made me not want to stop turning the pages. The next thing you know, i was nearly done and i actually wanted a bit more. But ah well, im happy enough. I couldn't give higher rating because of the slow start and i think it did lack character development for the other important characters. But other than that, I definitely see myself rereading this someday!:) ALSOOOO i was thinking from the start \"OHMYGOD I WOULD LOVE TO WATCH A MOVIE ADAPTATION OF THIS\"", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1117907125", "review_id": "1117907125", "date": "Nov 28, 2014", "rating": 4, "user_name": "Ari", "user_url": "/user/show/16646347-ari", "text": "Cute, sweet and funny, this is a fun book to kick back with.I think that my only annoyance with the book was with how many times the characters reverted to the word “Er” whenever they didn’t know what to say, or kept exclaiming about every little thing. Far too repetitious not to become slightly annoying.I wasn’t put off by Jack’s big reveal of Emma’s secrets like some of the other readers were. To be honest, I found it to be a good opportunity for Emma’s character to grow from it, after the impact that it had on those around her and how she was forced to deal with it.It wasn’t done with ill intent on his part—part from it.Not that I wouldn’t want to tear a few eyeballs myself if that happened to me, but that’s beside the point.Similar to a fate deserved by Jemima. What an obnoxious and psychotic roommate to have—the girl’s intentions were not all bad, but she seriously has to find a new role model other than Mummy dearest when it comes to her delivery.Lovely ending to the book, not at all thanks to her.I’ll have to hunt for my next Sophie Kinsella novel.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1517368537", "review_id": "1517368537", "date": "Jan 19, 2016", "rating": 5, "user_name": "Liliana", "user_url": "/user/show/47767356-liliana", "text": "I can't believe I'm giving such a chick-lit five stars but I am, and nobody can judge me. It was so incredibly hilarious and was all about being honest. I loved how it showed the difference between how horrible dishonest relationships are compared to how wonderful honest relationships are. Also it showed a lot of dysfunctional family habits that get cleaned up. Just the subject matter being about honesty was perfect. It felt awkward in the beginning because I didn't agree with all the stupid things she wanted but in the end she got everything she needed and really changed into a new persona. There were also some annoying parts but all in all it was good. This book didn't drag on forever either. Each chapter something exciting was happening and was packed with so many new experiences. I hate when books drag on the same event for the next 5 chapters, but it never did that and I never felt like it needed more. But of course this book wasn't super-deep and could've had more depth but it did touch on the huge subject of honesty. So yeah cool, I loved it.", "num_likes": 5, "sort_order": "default", "shelves": ["tbr-2016"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1527842479", "review_id": "1527842479", "date": "Jan 27, 2016", "rating": 3, "user_name": "Sivi", "user_url": "/user/show/49911758-sivi", "text": "Rating 3.5 This is the perfect example of a book that, even though it’s not life-changing (none of the chick-lit books I’ve read are) it’s very easy to read because it’s funny and it doesn’t require you to think very much about what happens, you just enjoy the reading no matter how surreal the situation is.In my opinion, the best and worst thing about this book is:1)\tBEST THING: Emma Corrigan, the main character. She’s such a mess but very hilarious. I don’t even think is possible to get into so many awkward situations.“Oh God. I'm losing it. Everyone knows this is how criminals get caught. They add too many details and trip themselves up.”2)\t WORST THING: Why so many dull conversations? I had to skip some parts because they were repetitive and really boring.All in all, it was a good book because it had some awesome moments where I couldn't stop laughing but it's also not one of those special books that you always remember (at least, it wasn't for me)", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/115491854", "review_id": "115491854", "date": "Aug 06, 2010", "rating": 2, "user_name": "Linda ", "user_url": "/user/show/3919132-linda", "text": "Meet Emma....an average woman from London who is having a not-so-average day. Since the book has already been described here by other reviewers I'll explain why I couldn't give it more than 2 stars. I love humor in a book. I love all types of romance but I like it when a book makes me laugh. And Sophie kept my interest to the end. Lately, so many books I have read use the 'same-old, same-old' plots. This was something a little different.The sad part is the f-bomb is used throughout this romance. I tolerate it once in a while in a contemporary romance but honestly, does anyone think a person appears attractive saying this word in public? I also thought Emma forgave too easily regarding Jemima and her co-workers but I enjoyed it enough to try some of Sophie Kinsella's other titles.", "num_likes": 5, "sort_order": "default", "shelves": ["chick-lit", "contemporary-romance", "expected-more-from-great-ratings"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1281120729", "review_id": "1281120729", "date": "May 15, 2015", "rating": 5, "user_name": "Nikinnia Smith", "user_url": "/user/show/30523604-nikinnia-smith", "text": "This was my first Sophie Kinsella book. I chose it for a reading challenge, and I'm glad I did. This book was hilarious. I couldn't help but literally laugh out loud, and my husband kept giving me weird looks. Lol. Emma in a moment of thinking the plane she's on is about to crash spills all of her little secrets to a stranger on the plane. Turns out that stranger is the owner of the company she works for. When she meets him for the first, well second time he can't help but make little snide comments about her secrets. He ends up wanting to date her, but of course that is ruined for awhile as with all romantic comedies. Emma's coworkers are such asses. They continuously harass her once her secrets are made public. Emma is very brave. I wouldn't have been able to return to work after that embarrassment.", "num_likes": 5, "sort_order": "default", "shelves": ["may-page-count-challenge", "may-bookish-block-challenge"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/136499163", "review_id": "136499163", "date": "Dec 25, 2010", "rating": 5, "user_name": "Thenia", "user_url": "/user/show/1216094-thenia", "text": "I loved that book!!It made me laugh out loud, it frustrated me, it annoyed the hell out of me at times and in the end, it taught me a lesson (one that I knew already, but revision is the mother of knowledge and all that! :P)It will give you a few things to think about considering secrets and honesty!Highly recommended if you want a light (but not feather-light) but also kind of serious book with a dose of humor and fluffy-ness on top.", "num_likes": 5, "sort_order": "default", "shelves": ["standalone", "romance", "contemporary", "reviewed", "2011"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/734319788", "review_id": "734319788", "date": "Oct 04, 2013", "rating": 5, "user_name": "Becky Johnson", "user_url": "/user/show/24460767-becky-johnson", "text": "This book I have read about a million and one times and you know what? It never gets old and it still makes my heart race!!The two main characters, Emma and Jack are just amazing together and so perfectly fitted. And Emma's family or more so her cousin Kerry!!! OMG like everytime I'm bringing scissors up to my book then have to restrain myself. Sophie Kinsella is one of my favorite writers in everything she does and I cannot wait to see where she goes.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1097098906", "review_id": "1097098906", "date": "Nov 04, 2014", "rating": 5, "user_name": "Camillia (Twenty Three Pages)", "user_url": "/user/show/11663167-camillia-twenty-three-pages", "text": "Sophie Kinsella's audiobooks are such guilty pleasures of mine and this was no exception.This story was hilarious and it slathered on a perfect amount of romance and tension and everything you would want in a guilty pleasure book.I absolutely adored the way it was told and many times I would catch myself laughing out loud in a public place and looking absolutely crazy.", "num_likes": 5, "sort_order": "default", "shelves": ["audio-books", "library-books", "read-in-2016"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1574165230", "review_id": "1574165230", "date": "Mar 08, 2016", "rating": 3, "user_name": "Christine Andersen", "user_url": "/user/show/8940559-christine-andersen", "text": "Definitely not my favorite Sophie Kinsella book ever. I quite liked the beginning but I felt like the end was SO rushed. I also started out really liking the love interest, [SPOILER!!] but by the end I kind of wished she ended up with someone else. Still love Sophie Kinsella, this just wasn't my favorite.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2024658080", "review_id": "2024658080", "date": "Jun 09, 2017", "rating": 4, "user_name": "Lili  Marcus", "user_url": "/user/show/58341705-lili-marcus", "text": "More like 3.5 stars.The story started great. IT was funny and interesting. But OI get bored in the middle and thankfully it turned okay at the end. Emma is hilarious and so real. Jack, her boss, is adorable. His secret is a bit shallow for me, not the one I was expecting.Overall, this a nice read and fun. ", "num_likes": 5, "sort_order": "default", "shelves": ["family"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2161515271", "review_id": "2161515271", "date": "Oct 24, 2017", "rating": 3, "user_name": "Ronak Gajjar", "user_url": "/user/show/70806774-ronak-gajjar", "text": "Well, Dharmraj did curse entire womanhood,\" I curse all womanhood that henceforward no woman shall succeed in keeping a secret.\" and women succeeded failing. (NOT BLAMING ANYONE) But when a man exposes woman's secrets! Sure it's BATTLE time!At points romantic, hilarious, sad along with all feelings painted well enough.", "num_likes": 6, "sort_order": "default", "shelves": ["2017", "read-before-and-in-2017", "stand-alones"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/753370351", "review_id": "753370351", "date": "Oct 31, 2013", "rating": 5, "user_name": "Tracy Banghart", "user_url": "/user/show/4705266-tracy-banghart", "text": "This book was so much fun. Loved it!!", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1257707348", "review_id": "1257707348", "date": "Apr 17, 2015", "rating": 4, "user_name": "Stacie (Shy Book Nerd)", "user_url": "/user/show/16576201-stacie-shy-book-nerd", "text": "Another wonderful story by Sophie Kinsella! I loved the characters, I loved the romance. It was a perfect rom-com to enjoy and get away from the real world. I can't wait to read more of her books!", "num_likes": 5, "sort_order": "default", "shelves": ["owned-paperbacks", "favorites", "gifted"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1287260526", "review_id": "1287260526", "date": "May 22, 2015", "rating": 5, "user_name": "Rakel", "user_url": "/user/show/32593212-rakel", "text": "Loved it!! Defiantly a new favorite :) ", "num_likes": 5, "sort_order": "default", "shelves": ["books-i-own", "favorites"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2525258376", "review_id": "2525258376", "date": "Sep 15, 2018", "rating": 3, "user_name": "Inna", "user_url": "/user/show/53165636-inna", "text": "I can’t allow myself to read this kind of books in Ukrainian or Russian. But in English – why not? :)", "num_likes": 5, "sort_order": "default", "shelves": ["romance", "humour", "british"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2678286340", "review_id": "2678286340", "date": "Jan 17, 2019", "rating": 5, "user_name": "Ivi Oltovska", "user_url": "/user/show/22756044-ivi-oltovska", "text": "my all time favorite book by Sophie Kinsella I totally freakishly am in love with it~!^_^", "num_likes": 6, "sort_order": "default", "shelves": ["1002-before-i-die", "sophie-kinsella"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1036889539", "review_id": "1036889539", "date": "Aug 26, 2014", "rating": 3, "user_name": "Laura", "user_url": "/user/show/1394928-laura", "text": "Funny, light, good audio...pretty much what you expect from this author. Great beach read. ", "num_likes": 5, "sort_order": "default", "shelves": ["on-laptop", "humor", "library", "lib-has-audio", "library-request", "favorite-authors", "2015"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1428446622", "review_id": "1428446622", "date": "Jun 20, 2017", "rating": 3, "user_name": "Ezra", "user_url": "/user/show/33213063-ezra", "text": "As far as SK books go, this wasn't her best. Not even close to \"Twenties Girl\", which was absolutely amazing.That's not to say it was bad. This is great book if you just want something light that doesn't crush your soul into dust, leaving you to wander this mortal realm in utter despair.It would make a great rom-com/chick-flick/Anne Hathaway movie. Then again, don't all her books?Emma is a typical twenty-something year old, fully complete with a self-depreciating inner dialogue and a whiny, melodramatic, over-the-top, I-want-to-slap-the-moron-out-of-you personality...but she seems quite aware of that, which makes it a bit more bearable. The plot is one of your run-of-the-mill chick-lit types, including and not limited to; (view spoiler)[ revenge on her bitchy, all-adored, arch-nemesis cousin Kerry that has always been putting her down; dumping her wonderfully attractive boyfriend Connor because she didn't realize UNTIL THE VERY MOMENT SHE MET JACK, that she was blinded by his looks and she never really had any actual feelings for him; revealing to her parents that they adored the wrong child for years and that they should have been on her side all along; having a sweet and supportive best friend/roommate called Lissy who stands by her side no matter what, having another annoying roommate called Jemima who is a spoiled rich kid but somehow decides to live with two roommates in what I gather is a not-so-palace-like flat; co-workers that are mostly mean and spiteful, except that one really sweet airhead; and finally, Jack, the man of her dreams who also comes equipped with a ton of cash, his own company, excellent bedroom skills, a fancy car, a bodygaurd/friend/what-is-this-guy called Sven, a secret that only Emma knows (kind of), and is ABSOLUTELY SMITTEN by Emma for the very traits that she doesn't find special. THEN it goes a little something like this...there's a betrayal, then some desperate clamoring and clattering while Jack tries to explain things to Emma who is ADAMANT that she not hear him out, followed by forgiveness because it was all a big misunderstanding, then another betrayal that wasn't a betrayal but looked like one and thenEmma has to explain to Jack and he doesn't want to listen and he walks away but then HE REALIZES SHE WOULDN'T DO THAT and comes back and apologizes and opens up to her and so begins their wonderful life together. Cut to the epilogue, Emma still has a few secrets that are endearing and innocent and can't possibly cause any more drama. Thus, implying that she will live her life free of any unexpected debacles and together forever with the super-rich man of her dreams and everything she has ever wanted.  (hide spoiler)]That was a mouthful.Still quite a fluffy, cheery read.", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3340483552", "review_id": "3340483552", "date": "May 25, 2020", "rating": 2, "user_name": "Zain", "user_url": "/user/show/12228441-zain", "text": "I went into this seeking a light fun read, and although this is my third Kinsella's book, it's definitely my least favorite .The story was pretty naive and kind of lame, and the humor is practically non existent.", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3848150245", "review_id": "3848150245", "date": "Feb 19, 2021", "rating": 2, "user_name": "Julia Guimarães", "user_url": "/user/show/42452249-julia-guimar-es", "text": "This is old school chicklit. It definetly won't change your life, but it can make you laugh. The story is completly absurd and the characters all behave like over-dramatic 2000's tv series teenagers on steroids. But it serves well the purpose of harmless entertainment.", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/228868192", "review_id": "228868192", "date": "Oct 29, 2011", "rating": 5, "user_name": "Dayla", "user_url": "/user/show/5039340-dayla", "text": "I will always love this book.", "num_likes": 4, "sort_order": "default", "shelves": ["favourites"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1281710700", "review_id": "1281710700", "date": "May 16, 2015", "rating": 4, "user_name": "Kim 'BookAddict'", "user_url": "/user/show/7374013-kim-bookaddict", "text": "This was a very nice and enjoyable read. It was a lot of fun, and I liked the characters. ", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1579899029", "review_id": "1579899029", "date": "Mar 14, 2016", "rating": 1, "user_name": "Annie", "user_url": "/user/show/26606718-annie", "text": "Don't read.This. Crap. ", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1771092441", "review_id": "1771092441", "date": "Sep 29, 2016", "rating": 5, "user_name": "Nurhayati Ramlan", "user_url": "/user/show/47552156-nurhayati-ramlan", "text": "Halfway into the book, I was considering in giving it a 4 stars but by the end of the book, I guess, it deserves that 5 stars. <3", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2250673212", "review_id": "2250673212", "date": "Jan 09, 2018", "rating": 4, "user_name": "Mariah", "user_url": "/user/show/6728955-mariah", "text": "Read this on a road trip. Great pick for easy fun.The second Kinsella girl to take me on an adventure.Loved every second of it!", "num_likes": 4, "sort_order": "default", "shelves": ["own-paperback"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2595971843", "review_id": "2595971843", "date": "Nov 16, 2018", "rating": 2, "user_name": "janel", "user_url": "/user/show/63511728-janel", "text": "And so the trend continues of me reading something random on Libby instead of anything on my tbr.....Save me from my own poor decisions ", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2405468032", "review_id": "2405468032", "date": "May 28, 2018", "rating": 1, "user_name": "Arlandria", "user_url": "/user/show/82444104-arlandria", "text": "This book is horrendous which is a shame because Sophie Kinsella does have some lovely, funny books. There is literally nothing about this book that is good. The plot is terrible. The characters are not even remotely likeable and you don't really get to \"know\" any of them. The main character, Emma, is a shallow, entitled, flakey, mess that has absolutely no self-respect. She acts like a dramatic teenager who doesn't know how to control their emotions. She's either on the verge of tears or stunned by panic. There's no in-between. That would be okay if the things she experienced warranted that kind of behaviour, but it's usually something incredibly menial like picking a restaurant that ended up being closed for a private function. After completely botching her first client meeting, she spills her \"secrets/unnecessary lies\" on a turbulent plane ride to her seat mate and the story just gets worse from there. Every secret Emma has is stupid and her efforts to keep them secret are a wasted investment, but she's so concerned about being liked by everyone that she just manufactured a fake version of herself. One that pretends to like jazz just because her loser boyfriend does or pretends she weighs less than she does because...who the hell knows?! She has to do this because, somehow, every single person she encounters in her daily life from her parents to her roommates to her co-workers are absolutely horrible people. Emma is the kind of woman I would never want to be and I genuinely wonder if women like her even exist outside of trope-y books that require spineless dimwits in order to propel weak plots and create faux drama. She's struggling to find herself and her passion which is completely normal and yet she and her ridiculous family have this warped idea that she should already be a CEO or some shit when she's only 25. Seriously, her family is THE WORST! They are the farthest thing from supportive and even go so far as to make her feel like she's less than because her piece of shit cousin has managed to find success. For her family not to realize what a bag of trash the cousin is while simultaneously being patronizing pricks themselves is so unbelievable it almost manages to quell my rage every time I read their interactions. Instead of calling her family out on their bullshit, Emma spends her time obsessing over achieving a promotion that she is 100% not entitled to in an effort to \"show them!\" Her priorities are so remarkably skewed, I don't even know how she's managed to keep the job she's in; certainly not out of skill or performance.**SPOILERS AHEAD**Eventually it is revealed that the man on the plane that knows all of her silly secrets is the founder of the very same company Emma works for, Panther Cola. Jack has the personality of a wet mop and while I assume he must be at least 10 years older than Emma given the level of success he has achieved, the book avoids the subject of his age altogether. Somehow, Jack develops an interest in Emma despite the fact that she is a bumbling fool and encourages her to break things off with her boyfriend, Conner. To be fair, Conner is insufferable, but up until the moment she met Jack, Emma was perfectly content being insufferable alongside him because people thought they were perfect together and appearances are all that matter to Emma. After they meet again, this time in a professional setting, Jack leverages the information Emma revealed to him in a moment of fear against her to make little comments that make her feel uncomfortable and/or worried. His reason for visiting is never really elaborated on or developed, nor are any of the relationships that Emma has. You really never get to know any of the characters at all. The entire focus of the book is on Emma's attempt to keep up her façade while simultaneously trying to have a clandestine relationship with Jack that is rife with drama.Jack has no charisma. He's bland and boring and he and Emma have no chemistry. Indeed, the lack of chemistry is so palpable that I can only surmise that the reason Emma enters a relationship with him is because he's good looking and wealthy. He thinks that because she spilled the beans to him on the short flight from Glasgow to London, that he somehow knows everything there is to know about her. Despite being a supposedly intelligent business man that has risen to success by building a brand based on knowing his target market, he has remarkably little insight into Emma. To be fair, Emma has no insight into Emma, so expecting Jack to is probably a bit unfair.They go from zero to sex in less than a week even after Jack learns that Emma, an alleged adult, has a Barbie bed spread. Apparently he likes that in a woman and Emma must have the orgasm of her life because suddenly believes she's in love. Yup. Love. She knows absolutely nothing about him because he is a closed off robot, but I guess the sex is good so Emma falls in love. Emma's roommate and friend Lissy tries to inject some common sense into the conversation by asking Emma what she really knows about Jack, but she won't listen. She's convinced herself that he loves her too and sure, they've kept their relationship a secret at work, but that's because they've only known each other for 5 minutes (certainly not for HR purposes).Randomly, Jack is set to give a live interview and apparently it's the most watched event on TV because everyone in Emma's life tunes in to see it. Somehow, this brilliant, successful business man gets lost in thought on national TV and starts describing the target market for a new product that ultimately ends up being a very obvious description of Emma. In the process he reveals most of her secrets and everybody figures out he's talking about her. Even though she's gotten herself into a situation where she's been making up unnecessary lies, she is rightfully embarrassed to have them revealed on national TV. Everyone in her life acts like a bunch of tactless buffoons and start prying further into her life because nobody in this book has any boundaries or common courtesy. Emma cries to her roommates and one of them, Jemima, recommends seeking revenge by revealing one of his secrets to the public. Since Emma doesn't know him, there's not much for her to go on other than the fact that they met on a flight back from Glasgow that he asked her not to tell anybody about. Jack comes slinking back to apologize before Emma has the opportunity to formulate a revenge plan and provides the lame ass excuse that Emma was on his mind and that's why he had verbal diarrhea. She was on her way to buying it when Jack inadvertently let it slip that the reason he doesn't share his secrets with Emma is because his are actually important and then acts like he did Emma a favour by spilling hers on national TV.Emma's parents throw money at her in an attempt to salvage their relationship. Her father trips over himself while trying to apologize because apparently it's much easier to cut your own daughter down on a regular basis than it is to tell her you love her. Emma gets a backbone for 5 seconds and tells her coworkers that she was the one with the idea to put an ad that ended up being successful in a bowling magazine and her boss gives her a promotion even though she hasn't demonstrated any proficiency at her job. Jack, being the creepy guy who can't take no for an answer, tracks Emma down at her roommates dance recital and reveals to her why he went to Glasgow. To be fair, he had every reason to keep it a secret and for Emma to expect him to be 100% forthcoming with a big secret that has far reaching implications after only a week of knowing one another demonstrates the level of high-school thinking she has. Things are looking like they are about to be smoothed over when Jemima, Emma's sociopathic roommate calls a journalist and tries for force Emma, despite her numerous objections, to reveal dirt on Jack. Jack walks in on Jemima, Emma and the journalist and Emma does a classic Emma and can't form a coherent sentence to explain what's happening and Jack storms off. I wish the book ended there because they all would have gotten what they deserved and I would've felt a lot better about having spent my time reading this garbage.Instead, Emma sits and throws herself a pity party. Jack comes back and starts prattling off his \"secrets\" which are really just pieces of information about himself that any normal person would eventually tell someone as their relationship developed, like when he lost his virginity and that he doesn't like caviar. Emma is, of course, beyond impressed with this mediocre display and even goes so far as to tell Jack that he doesn't have to tell her anything else. Honestly, Emma is so weak it's infuriating. Her expectations for the people she surrounds herself with are so low and she's so needy that she would put up with a totally unbalanced relationship over being alone and/or getting her shit together. The book ends by attempting to show how Emma has grown and learned lessons from this whole mess, but it rings hollow, just like everything else in this miserable book. Emma got the hot, rich boyfriend and the title of Marketing Executive, both of which she doesn't deserve and is probably going to screw up if she doesn't invest as much energy into getting comfortable with herself as she does in petty secrets/gossip. Not that I expect rom-com books to be pieces of feminist literature, but everything in this book is so awful that I am genuinely sad it was written by a woman. If anything, it could double as a guide for women on what not to do in life. Maybe that's the silver lining...", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2834250472", "review_id": "2834250472", "date": "May 27, 2019", "rating": 5, "user_name": "Melissa", "user_url": "/user/show/4912586-melissa", "text": "This was a four star book that gets bumped up to a five because of the WONDERFUL Kate Reading narration. Seriously, she was AMAZING. Can You Keep a Secret? is a chick lit book that is witty and fun, and I really feel like half of the fun was hearing Kate Reading's narration of Emma's first person narration. She brought Emma to life in a way that few audio narrators manage to pull off. I could feel her anxiety and her irritations. I could feel her vulnerability and her anger. I really felt like I was inside Emma's head. This is my first Sophie Kinsella book, and I can see why she is a popular writer. I see why this book is compared to books like Bridget Jones' Diary. It has that same sort of feel to it. The premise of this story was super cute. Emma has a fear of flying, and on one trip her plane hits some severe turbulence, causing Emma to start blurting out all of the secrets that she has never told anyone. I loved that scene. The plane does not crash, but that shouldn't be a problem, right? She'll never see her seatmate again, right? Well, it turns out that she does see him again. He is the owner and founder of her company. Lots of anxiety and fun ensues. As far as the story goes, I really enjoyed it. I think that there was a lot of time in the middle of the book where nothing was really going on. I didn't mind it so much because I did enjoy being in Emma's head due to the great narration. But I wonder if I would have been as patient if I was reading it myself. I don't know. I enjoyed the romance too, but when compared to other contemporary romances, I could probably only rate this as average. But I couldn't help but root for Emma and hope that she could find a beginning to a happily ever after. Jack was okay. His grand secret seemed a bit lame when it came out, but I forgive him. I thoroughly enjoyed this audio book. I highly recommend it. The story might be a little above average, but the audio narration is top rate. Five stars. it was amazing.", "num_likes": 3, "sort_order": "default", "shelves": ["audible-book", "2019-reads"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2472791449", "review_id": "2472791449", "date": "Aug 01, 2018", "rating": 5, "user_name": "Kelli", "user_url": "/user/show/2540990-kelli", "text": "This is the 2nd Sophie Kinsella book I had read and I am already looking forward to reading more! Can You Keep a Secret definitely didn't disappoint and kept me continuously wanting more - especially the last 1/4 of the book! Don't get me wrong, the whole book was good and had me giggling, but of course we all wonder how things are going to come together in the end! From reading the info on the book I knew that Emma was going to run into her 'friend' from the plane again, but it was fun how it all came together - especially the 'running over number' (starbucks) and the Leopold file (lets get away from our desks for awhile). The small things that Emma and Jack got to share were so much fun. The way that he kept making little comments that Emma knew came from the secrets that she told him - I couldn't help but laugh! I absolutely loved when Jack got Emma to stand up for herself to Kerry - she really needed to find that part of herself and be able to put her feelings out there. I feel like it really made a difference with her parents and also her self esteem. Having her secrets no longer be secrets was hard at first, but I also feel like it helped Emma in the long run. Even though it all came together I definitely felt myself wanting more Emma and Jack!", "num_likes": 3, "sort_order": "default", "shelves": ["2018-read"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1373416160", "review_id": "1373416160", "date": "Jan 11, 2018", "rating": 3, "user_name": "shannon&#x1f3f9;", "user_url": "/user/show/35113083-shannon-x1f3f9", "text": "This was definitely not the kind of romance novel i was looking for. It barely had that much romance to begin with.I thought the love interest was a complete jackass to our main character emma at times when he could have easily explained things instead of acting like a prat.In fact, I hated the romance in this. I felt like they were wrong for each other in pretty much most ways. The story was nothing like i expected. Although I’ll give that I read the first 200 pages ish rather quick, Sophie Kinsella’s writing is usually fast paced.I did laugh multiply times throughout this book. I found Emma to be the most likeable character in this, and her best friend Lissy. Although at times I didn’t like them.I didn’t connect with any character in this really...It just wasn’t what I wanted and expected at all.I was looking for a romance and this was the most crappiest romance ever. They didn’t even develop as a couple. Although when Emma stood up for herself I felt like a proud mum.Oh well, not every book is what you want.I definitely prefer I Got You’re Number over this!", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2388066802", "review_id": "2388066802", "date": "May 10, 2018", "rating": 3, "user_name": "Teresa", "user_url": "/user/show/15654040-teresa", "text": "This style of book isn’t my normal jam, but I picked it up because it was a selection from my book club. I did the audio version, and I think because of the stellar narration (Kate Reading is always fabulous), it helped me to enjoy this book more than I would have if I’d read it. It was fun in parts, boring and/or frustrating in others, and after finishing it three days ago, I remember only a little. It was enjoyable enough to warrant three stars, but nothing to get overly excited about.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/4048625735", "review_id": "4048625735", "date": "Jun 10, 2021", "rating": 3, "user_name": "Mom", "user_url": "/user/show/7813734-mom", "text": "I almost gave up on this book as it begins with an overabundance of embarrassment humor that I do not find funny. The story is full of aggravating characters that I could not stand. It's totally predictable throughout the thread. Why then did I feel the need to keep reading? I really don't know the answer to this. It was fairly easy to read and it flowed well so I just kept going. In the end, I was glad that I did. Love prevailed. Aggravating characters met their due. And there was a silver lining to the embarrassing moments. No one was more surprised than me that I actually ended up liking it. It might not be for everyone and I wouldn't classify it as one of the best books I've ever read but given the opportunity, I might read it again. ", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3894557197", "review_id": "3894557197", "date": "Jul 01, 2021", "rating": 4, "user_name": "Inosh ", "user_url": "/user/show/89640934-inosh", "text": "Once again, a purely subjective rating! What I love about Sophie Kinsella is that she takes over the top concepts and over the top boyfriends but writes pure,realistic issues that basically every normal person goes through. Because at the end of the day, its not about the boyfriend or about the hook of the story. Its about a woman finding herself.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2491236712", "review_id": "2491236712", "date": "Aug 12, 2018", "rating": 2, "user_name": "Nungari Kahura", "user_url": "/user/show/54052694-nungari-kahura", "text": "Your typical chick flick book. Girl meets random mysterious man in a plane. There’s turbulence, she spills all her insecurities and secrets to the man who then happens to be the founder of the company she works for. She falls for him, he betrays her by telling all her secrets on national television, she forgives him (and they live happily ever after). It’s a silly, easy read for a Sunday afternoon. The characters are underdeveloped, the ending is weak and the plot obvious. ", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1998736354", "review_id": "1998736354", "date": "Oct 24, 2017", "rating": 5, "user_name": "Sarah", "user_url": "/user/show/67396637-sarah", "text": "I absolutely loved this book. I found it to be a very easy read and it had me laughing so much. If you want something light hearted and fun then I highly recommend this book! ", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2358836865", "review_id": "2358836865", "date": "Apr 14, 2018", "rating": 3, "user_name": "Farah", "user_url": "/user/show/51814905-farah", "text": "i don’t know why i keep reading this kind of stuff, its not healthy. i swear to god i’ve never been so irritated by a character as much as her friend irritated me ugghhh", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2439940118", "review_id": "2439940118", "date": "Jun 29, 2018", "rating": 3, "user_name": "Indah", "user_url": "/user/show/18962637-indah", "text": "plane read fave 💜", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2463152321", "review_id": "2463152321", "date": "Jul 25, 2018", "rating": 4, "user_name": "Cherie", "user_url": "/user/show/6460330-cherie", "text": "Chic-lit romance, laugh out loud X times, and cried twice. Probably made more enjoyable by Kate Reading's narration. I was surprised at how much I enjoyed it. ", "num_likes": 4, "sort_order": "default", "shelves": ["published-since-2000", "read-audio"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2532774607", "review_id": "2532774607", "date": "Sep 17, 2018", "rating": 4, "user_name": "Sharon", "user_url": "/user/show/70984996-sharon", "text": "Really funny! Light reading, perfect for between dense books.", "num_likes": 3, "sort_order": "default", "shelves": ["kindle", "sha2018"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1934754752", "review_id": "1934754752", "date": "Sep 14, 2017", "rating": 4, "user_name": "Zara", "user_url": "/user/show/61279943-zara", "text": "A laugh out loud book.I couldn’t put it down, it was hilarious. 4/5 Stars", "num_likes": 3, "sort_order": "default", "shelves": ["4-stars"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2846544215", "review_id": "2846544215", "date": "Jun 04, 2019", "rating": 3, "user_name": "Kelcy", "user_url": "/user/show/66345093-kelcy", "text": "3.5 - Read this to get my out of my feelings from the last book I read. Super enjoyable and easy read. I bust out laughing a number of times .What I didn't like: The ending was super rushed and I didnt agree with some aspects ...certain ways of apologzing and shit being OK after with no issue. I also dont like Jack trying to go after her when she was with Connor. I get talking to her as a friend but he crossed the line for me.But other than that I still found it hilarious. Just what I was looking for.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/1648545289", "review_id": "1648545289", "date": "Jul 31, 2019", "rating": 4, "user_name": "Budoor", "user_url": "/user/show/35008362-budoor", "text": "Kinsella always makes my emotion meter go up :”) such a sweet, naive and heart-touching read", "num_likes": 3, "sort_order": "default", "shelves": ["owned"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2891531864", "review_id": "2891531864", "date": "Jul 15, 2019", "rating": 5, "user_name": "Lilly", "user_url": "/user/show/92992513-lilly", "text": "Lighthearted, funny and relatable but not ordinary at all. When I first started I really wanted to stop because I simply couldn't understand what it was gonna be about and I thought it was about a career driven girl who's only goald is to get promoted. Spoiler alert: Not at all. Emma is living a normal life and she's the typical 20-something year old that just wants to find out what she's meant to do with her life and not settle for any less than what makes her happy while at the same time not disappointing her parents or being over-shadowed by her cousin. It has romace in it but the book doesn't make it seem like the only reason a girl would ever live is to find love. That one day a man is going to come in and rescue her from her mundane life. No. She's independent and strong and doesn't want to have man for any other resons than because she's in love. She pays for her own things, she doesn't play the victim or need someone to rescue her when work gets tough and her whole world doesn't crumble when a relationship ends. Sadly too many romance novels can't do it right. This one did. ", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2996788664", "review_id": "2996788664", "date": "Oct 01, 2019", "rating": 3, "user_name": "Meda", "user_url": "/user/show/4532325-meda", "text": "Somehow it was funnier almost 7 years ago.., but there were cute moments :)", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3551559185", "review_id": "3551559185", "date": "Sep 19, 2020", "rating": 4, "user_name": "Sanara♥", "user_url": "/user/show/28883553-sanara", "text": "My rating: 3.75/5", "num_likes": 3, "sort_order": "default", "shelves": ["romance", "book-to-movie", "humour", "watched-movie", "read-in-2020"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/3759766864", "review_id": "3759766864", "date": "May 14, 2021", "rating": 4, "user_name": "Abbie", "user_url": "/user/show/110645331-abbie", "text": "Another great read by Sophie Kinsella, she never fails to make me smile and laugh with her books. Emma was such a likeable character right from the beginning, she was funny, quirky and you empathised with her.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2563842928", "review_id": "2563842928", "date": "Dec 08, 2018", "rating": 4, "user_name": "Veronika", "user_url": "/user/show/53627328-veronika", "text": "I wanted something light and fun and this book was exactly the thing! It was really cute, charming, heart-warming and very funny. I loved the main character Emma, she was the heart of this book. I really enjoyed reading this one.", "num_likes": 3, "sort_order": "default", "shelves": ["2018"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/2319136765", "review_id": "2319136765", "date": "Mar 15, 2018", "rating": 4, "user_name": "Fallon", "user_url": "/user/show/33291730-fallon", "text": "4 Stars!!! What a fun and hilarious book!! I laughed so hard throughout the entire read. I listened to this on audible and the narrator was so good!!!! I have not ventured into chick-lit books much as I tend to stick to thriller/mystery but oh how I enjoyed this read!!!! Sophie Kinsella is a treat and should not be missed! I am actually excited to start her Confessions of a Shopaholic series next. I highly recommend this book to anyone in need of a good laugh and a very cute love story! I absolutely loved the main character Emma and wish this was a series as I was sad when it was over. Hope you all enjoy this!! ", "num_likes": 3, "sort_order": "default", "shelves": ["chick-lit"]}, {"book_id_title": "33724.Can_You_Keep_a_Secret_", "book_id": "33724", "book_title": "Can You Keep a Secret?", "review_url": "https://www.goodreads.com/review/show/859525003", "review_id": "859525003", "date": "Feb 19, 2014", "rating": 3, "user_name": "Shinjini", "user_url": "/user/show/27433269-shinjini", "text": "So... I wasn't supposed to read anything before my exams were all done. And here I am, writing a review for the book I wasn't supposed to read and I’m sure there will be a couple more such books this month. Drat!The book is about Emma Corrigan, an ordinary, nothing-special girl living in London. She, like every other woman on the planet, has a few secrets that she shares with nobody. Until, one day, she spills them all to a stranger on the plane. Unfortunately for her, this man turns out to be the CEO of the company she works in.I’ve decided to share a few of my secrets involving this book. Can you keep a few secrets?1. I read a majority of this while on public transport and my expressions attracted a lot of attention. Some people gave me strange looks and I’m quite sure they thought I was a mad person. Eh, whatever!2. I read a part of this book till about 5 o’clock in the morning. When I was supposed to be sleeping. My father must never know this. Never!3. I may have a little crush on Jack Harper. That was before a very stupid thing that he did. He did try to redeem himself but I couldn't forgive him completely.4. I didn’t like Emma as much as I thought I would. (Does that count as a secret?)5. Okay fine, I hate Emma because she took Jack away from me!! I have been crying ever since. I still haven’t been able to overcome the trauma.6. I did not like the ending at all. It felt too rushed and I was left wanting more. That’s one reason I knocked off a star from my original rating of 4 stars. Had this been a series, I would have understood the reason behind such an ending, but it isn't. It’s a standalone book and the ending did not do justice to the fun ride that this book had become.7. This is my third book by Sophie Kinsella, which includes her Shopaholic series and I don’t like the fact that she keeps writing the same thing over and over again. The books that I've read all have an adorably clueless heroine, a relatively rich, crush-worthy hero, funny banter and a happy ending with lots of embarrassing moments thrown in. It’s predictable and I’d like to read one book by her that doesn't have all this again. I’d really love it if she writes about some other character in another scenario because I think even with that she can make the reader laugh out loud. Well here’s hoping..8. In spite of it all, I’m going to re-read this book someday. It was quite funny and the embarrassing and awkward moments were just HILARIOUS!9. Now comes my funniest secret regarding this book. I convinced a guy friend that this book is a mystery involving government secrets and he is actually currently reading it. He was a little put off by the pink cover but after I told him it was supposed to be ironic, he agreed to read it. I just keep imagining what will happen when he finishes reading the book. I will probably get to hear some lovely cuss words.10. I've already started another book. Goodbye to my No-reading in July pledge. Oh well.And now, I bestow upon Sophie Kinsella the title Queen of Awkward Moments. I wonder how she comes up with such hilariously awkward moments that make you laugh out loud. My shrieks of laughter on the train while reading this book did attract some horrified looks from co-passengers. But I don’t even care. Some of the humour might not work for others but there sure are moments in the book that are genuinely adorable. All in all, it was a light and fun read that helped me go through a boring study routine and that’s exactly what I needed.", "num_likes": 3, "sort_order": "default", "shelves": ["read-in-2014", "reviews-written"]}]