[{"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1334669179", "review_id": "1334669179", "date": "Jul 14, 2015", "rating": 2, "user_name": "James", "user_url": "/user/show/41609617-james", "text": "For the most part pedestrian, relying on stereotypical characters and clichéd narrative – Tony Parson’s mildly diverting novels certainly served a purpose in the late 1990’s / early 2000’s when they first starting coming out – giving permission and opening the door the perhaps previously non-book reading 30/40-something lads/men to read about and indulge in stories of other men and the various life dilemmas faced by the pre-millennial male in modern society, providing characters they could identify with and life choices they could relate to.Ultimately though, these novels are uninspiring, verging on the lazy. After the success of ‘Man & Boy’ the following novels from Parsons essentially followed and relied on the same narrative template.Whatever happened to the former ‘enfants terrible’ of the UK music press, who along with Julie Burchill terrorised the staid, conservative and self-indulgent writings of their elder music journalist peers? Well I guess they grew up, like we all do – but maybe along the way some of that fire has certainly been lost, that attention grabbing and exciting music journalism became by comparison, utterly mundane in these generic ‘modern/contemporary’ novels. These novels by Tony Parsons, whilst largely proficient, lack excitement and inspiration – ultimately betraying all that early promise. Unless of course all that ‘kicking against the establishment’ was merely a pose, a pretension symptomatic of the time and perhaps rooted in an underlying and cynical careerist agenda all along – who knows? Whilst Parson was initially kicking against the establishment back in the late 1970’s, he then quite decidedly became the establishment – an inevitable transition perhaps, but such a ‘revolt into style’ doesn’t necessarily have to equate to such a literary decline. Where Parsons once had so much to say, there now seems so little to be told. Parsons is now reportedly a staunch supporter of the UK Conservative Party and now apparently rails against people having tattoos…need I say more?There is in the end, nothing particularly bad about these novels – they are proficient and mildly diverting, but they do lack any real excitement, seem bereft of inspiration and are – ultimately disposable.  ", "num_likes": 32, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1447433636", "review_id": "1447433636", "date": "Nov 20, 2015", "rating": 1, "user_name": "Miran", "user_url": "/user/show/16885966-miran", "text": "*****SPOILERS AHEAD (but maybe they will help You to skip this book, I hope)******Whole book I was waiting for main character to realize his mistake, that sleeping with another woman besides his wife, EVEN FOR ONE NIGHT, is WRONG. That's the only reason I kept reading. But my waiting didn't pay off. Through whole book I was reading Harry's wining how life is unfair, how everyone is talking to him that he is hopeless romantic (wtf???), how he is the victim that wife left him. He also didn't tell his parents that he cheated on his wife, so they also fell sorry for him. He didn't have a job and didn't come to mind that he could sell his sports car so he could pay off mortgage on house - I feel the only reason for this stupidity is to feel sorry for him after some hooligans tear roof of the car. In short, after the fact that HE cheated on his wife, that huge and only important matter in the book, isn't emphasized but disregarded, everything else is just b*shit. There's so many idiotic sentences in the book.I don't know what was the point of the book, really. The world is NOT to blame for you cheating on your wife, the problem is YOU, and everything that comes with it is also your fault.", "num_likes": 32, "sort_order": "default", "shelves": ["fiction"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/109954554", "review_id": "109954554", "date": "Jul 04, 2010", "rating": 4, "user_name": "Naomi", "user_url": "/user/show/3334760-naomi", "text": "Truth. That's what I kept thinking as I was reading this book. It's true and it's raw. It's sad and it's happy. Tony Parsons has a certain way of making the characters so real. I felt I knew Harry Silver. Really knew him, as a friend.I guess stories like this don't really need to be complicated to really draw readers in. In the first few chapters I was devastated when Gina and Harry break up. I actually felt pain for Harry during his tiny mid-life crisis when he sleeps with another woman. The book puts across the reality that is life. That relationships can't be all romance all the time. The fact that people do fall in and out of love. The pressure that people have in today's society to be happy and romantic all the time. I don't know why people kid themselves into thinking being with someone is an easy task. It's really not, espeically when you're with eachother for life and have a family.It made me empathise with little Pat, a child of divorce. The majority of my friends and exfriends have had divorced parents but they never really talk about it. What it was like when they intially split up. I'm so very lucky to have parents that have stayed together. The book brings to light the horrendous damage that divorce can bring upon a child and a parent. The quote that really got me;\"You need a license to drive a car. You need a license to own a dog, but anyone can bring a child into the world.\" It's true. Of course I'm not at liberty to really give my oppinion on parenting and in some cases- love itself. I'm only seventeen.I've kinda veered off the point of this review. In a nutshell, I totally loved it. The truth of life that nothing is really a happy ending. It's sad, but true and that's what I really like in a book :)", "num_likes": 14, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/25732474", "review_id": "25732474", "date": "Jun 28, 2008", "rating": 2, "user_name": "Sunni", "user_url": "/user/show/431184-sunni", "text": "This is an engaging, smooth read and I would have rated it higher had I never read/seen \"Kramer v. Kramer.\" I really felt this was borderline plagarism and was very surprised the author could get away with recreating so much of that story, right down to details like carrying the child when he is injured on the playground. I am also surprised that 25 years later this story plays well. When Kramer came out, most men didn't have a clue about real hands-on parenting and a man with custody was unheard of...the \"Mr. Mom\" stories made great fodder. Today, I'd be hard-pressed to think of a young father who does not fully participate in every aspect of parenting (not housework mind you...we haven't come THAT far!). The protaganist does have some self-discoveries that were not covered in Kramer, but mostly it is the same book.", "num_likes": 12, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/45165237", "review_id": "45165237", "date": "Feb 02, 2009", "rating": 2, "user_name": "Canada", "user_url": "/user/show/1919269-canada", "text": "I definately preferred \"About a Boy\"- Nick Hornby has no competition whatsoever from Tony Parsons. Parsons tries to be funny. Fails, of course, but then it's made more pathetic by the fact that he totally pulls the heart strings to their fullest extent at the end. And that doesn't quite work. It was almost boring. Almost as bad as Jack Sheffield! [That's saying something:]. ", "num_likes": 10, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2148849524", "review_id": "2148849524", "date": "Oct 15, 2017", "rating": 1, "user_name": "Sarah", "user_url": "/user/show/19038986-sarah", "text": "How on earth did this sell a million copies?? Do not read!!", "num_likes": 8, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/48588129", "review_id": "48588129", "date": "Mar 08, 2009", "rating": 2, "user_name": "Meliana", "user_url": "/user/show/290460-meliana", "text": "reading \"Man and Boy\" is like listening to an easy-listening pop song. it is sweet, easy to guess, nothing in particular. it goes well, as usual, and everybody likes it. it is just; i am not really into pop music.though is beatifully written, i dont find any sense to fill up my soul after reading this book. it is just a too-easy-to-guess and happy ending story, good for the young couples. i think it will be better if the story of the father and the son (read: man and boy) is brought up more deeply and emotionally.", "num_likes": 7, "sort_order": "default", "shelves": ["novel"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3154644317", "review_id": "3154644317", "date": "Jan 26, 2020", "rating": 4, "user_name": "Tanya Parsons", "user_url": "/user/show/107777286-tanya-parsons", "text": "Overall I thoroughly enjoyed the book and found it very interesting to see a familiar enough story from an almost exclusively male view point. I did, I think because I'm a woman, feel irritated by the main man's somewhat blasé (in my opinion) attitude towards his and other male characters' misdemeanors. Is this, maybe, a true insight in to how worryingly differently men and women see certain things? I think the grandfather, son, grandson relationships were the highlight of the book and I think the way the illness and death were written about was among the best and truest I've ever read.", "num_likes": 7, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2169736863", "review_id": "2169736863", "date": "Oct 31, 2017", "rating": 4, "user_name": "Lucija", "user_url": "/user/show/69308229-lucija", "text": "The book kept me going as it was an easy read. Thoughts and feelings of the main character were described in details which made Harry Silver closer to the readers. And, although I would never spend my time with someone as unrealistic and whiny as him, the thing is that there are people who really cannot see the faults in their actions and somehow manage to make themselves victims. This is probably why someone would not like this book, you got to be very understanding with Harry. It was not easy getting close to the last 50 pages to see that he really does not see past his own problems and identity crisis. Furthermore, the biggest dissapointment was the portrayal of Gina's character after she went to Japan. Somehow, her lifelong dreams were presented as selfish and whimsy acts while her love for Pat was diminished to a level of mere custody fight. To conclude, I gave this book 4 stars because I read it through Harry's eyes and feelings. Not the feelings I would have after cheating on my partner but the feelings this hopeless romantic had. Not the feelings I would have everytime I see my father but the feelings this insecure young man had. And I would recommend everyone to do the same, just try to understand him.", "num_likes": 6, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2684430925", "review_id": "2684430925", "date": "Jan 27, 2019", "rating": 2, "user_name": "Louise", "user_url": "/user/show/47664583-louise", "text": "Every character was awful and I have no idea what this book was meant to be about.", "num_likes": 6, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1160195690", "review_id": "1160195690", "date": "Feb 26, 2017", "rating": 3, "user_name": "Nataliec7", "user_url": "/user/show/27581158-nataliec7", "text": "I really wanted to read this book and finally got round to it. I felt it started with a bit of promise but kind of didn't get better. Meet Harry, happily married with a little boy and a good job. He cheats on his wife and she leaves him and also his contract isn't renewed at work. His wife is very upset as she gave up her dream to go to Tokyo to be with Harry and decides that she's going to go as a result. She leaves their son behind and Harry now has to be a parent to his son, a job that took him 10 minutes a day previously. He does step up to the plate and makes a go of it but still feels like the injured party in the whole situation. This was annoying. I mean, Harry seems like a nice enough guy but apologise to your wife and accept you did wrong. And no, you don't get a medal for being a single father for a short time. Gina annoyed me to an extent too, she just left her son and went to Tokyo, Seriously? Harry's parents were likable though and added a nice tough. I'm glad Harry accepted the challenges in raising his son, but he had little choice anyway. And the book ended the way I thought it would so there is an element of predictability.One this I didn't like was - they are in England but mum is 'mom' in the book. And they talk about soccer. It would have been good to use the English terms and spellings. My book is a US version but everyone knows that mum and Football are the same as mom and Soccer.", "num_likes": 4, "sort_order": "default", "shelves": ["fiction", "read-in-2017"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1465315240", "review_id": "1465315240", "date": "Dec 10, 2015", "rating": "", "user_name": "Joey Woolfardis", "user_url": "/user/show/4639825-joey-woolfardis", "text": "[To be read in paperback, urgent as part of #InfiniteVariety2016.]", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/336868149", "review_id": "336868149", "date": "May 26, 2012", "rating": 4, "user_name": "Kelly", "user_url": "/user/show/2169934-kelly", "text": "Man and Boy by Tony Parsons is the story of how a man becomes a father to his son, and a son to a father. The affection Harry feels for his family, all of it, is obvious from the first page. As evident is Harry’s sense of self. He comes to realise that what he feels isn’t always enough, though. Approaching his thirtieth birthday, Harry is lost in between. He is no longer a child, but does not feel properly mature. He is married, but is unsure what that means. He loves his family, but isn’t quite sure why. But, Harry knows himself, even if ‘himself’ baffles him, and that thread is what makes this story so brilliant: Harry’s utter honesty. He makes mistakes and owns up to them. He feels and is ready to share that fact. He loves unconditionally, which is both uplifting and heartbreaking all at once. A month before his birthday, full of BIG questions and doubts, Harry makes a mistake. Then, within the course of thirty days, he loses everything he considered important. Over the next six months, he gains it all back, but not necessarily in the same form. Harry learns to be a father, not just a man with a young boy. He begins to understand his own father. He figures out what is important, and who, and he learns what love is. I thoroughly enjoyed this book. Harry’s voice was so real. At times, his observations were funny, at others, wrenching. I forgave him his mistake. I hated his wife. I cheered Harry’s successes and secretly plotted Gina’s failure. I loved that none of the characters were heroes (except for the possible exception of Harry’s dad). They were all ordinary people and could be wholly uncompromising. Not a one of them changed their mind for the sake of the plot or story; they were all themselves to the end. Even Harry—though he grew. At the end of the book, he was still Harry, still ‘himself’, but a much more content version. There is a sequel, Man and Wife. I am not sure if I want to continue the story, however, as I was satisfied with who Harry was at the end of this chapter. ", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/253413443", "review_id": "253413443", "date": "Dec 30, 2011", "rating": 3, "user_name": "Michael", "user_url": "/user/show/3680008-michael", "text": "Harry Silver has everything that most people would envy to have: a beautiful spouse,great job in the media and a wonderful son. On the other hand, while most will love to have that kind of life, they do not realize the sacrifice that comes with it. Harry threw it all away after a one night stand, now he struggles to being a single parent and his ex often wonders if he is capable of taking on such a big responsibility. Raising his son alone is really hard, he asks common questions such as: Should you eat green spaghetti for breakfast? Is his son really the most beautiful son in the world or is that just a trend that goes around? Is he fit to be a parent? Gina regrets that she left her child with Harry, so she wants him back in her life, although she is in Tokyo trying to have a fresh start. It does not get any better that Harry's father health is dying and he is falling in love at the wrong time. He soon has to make a decision that is best not only for himself but for his dear son that he adores. This is a witty, insightful and inspirational about making the right choices in the end.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3639366936", "review_id": "3639366936", "date": "Nov 11, 2020", "rating": 1, "user_name": "Krystelle Fitzpatrick", "user_url": "/user/show/57560734-krystelle-fitzpatrick", "text": "I think something that deeply pesters me as a person is parents (generally fathers, which I’m sorry, just seems to be the way of things when you’re not the one popping a kid out of a birth canal) who simply do not want to be a parent nor understand how to be one. It is rudimentary to do the absolute bare minimum for your children- this man seems to avoid that enough that washing his son’s hair is a novel concept. This book is from the perspective of a man who is egotistical and juvenile, and the worst of it is that this is nonfiction. Nonfiction! To a point where the author could not recall his actual real life son’s real life fall from a bed because of his mildly fictionalised recollections. This kind of book is just a self indulgent sideshow of egoism- and it has such little value. The lawyer at the end also felt like a vitriolic demonstration of what the author *really* felt, and it was a very weird thing to be reading. I can only hope in the future that this specific brand of ‘man only grows up a little bit because he has to do bare minimum for child’ dies out entirely.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/112736059", "review_id": "112736059", "date": "Jul 21, 2010", "rating": 4, "user_name": "Badly Drawn Girl", "user_url": "/user/show/3131165-badly-drawn-girl", "text": "This was a \"beach read\" book for me, meaning I didn't except it to me much more than a cliched, easy reader that would be enjoyable in a mindless sort of way. But I quickly found myself totally involved in the book and the characters. Tony Parsons has taken an overdone topic and done it right. The emotions are spot on, the dialogue is believable, the plot is engaging and intriguing. My only grip is the ending which felt a bit forced but honestly it's a small thing in terms of the rest of the book. The most powerful part is the relationship between Harry and his father. Tony Parsons authentically captures all the nuances of man's relationship with his aging father. It was the most believable portrayal I've ever read, and let me tell you, I've read a lot of them.In the end, I was very pleased with this book. I'm glad I went in with lower expectations because it allowed me to be fully blown away by the quality of the book.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2087512302", "review_id": "2087512302", "date": "Aug 22, 2017", "rating": 4, "user_name": "Zoha", "user_url": "/user/show/63125596-zoha", "text": "\"Love means knowing when to let go.\"The main reason why I borrowed this book from the library was that one of the reviews stated: \"I cried five times and laughed out four.\" I love books that can make you smile and cry at the same time and this book is definitely one of those. Very beautifully written and insightful too. Gives you a pretty good idea about children from broken families and their upbringing.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/45131961", "review_id": "45131961", "date": "Feb 02, 2009", "rating": 3, "user_name": "Margaret", "user_url": "/user/show/1070673-margaret", "text": "Solid modern writing. Quick read. A bit derivative of Nick Hornby. I didn't always like the main character - he's a bit of a prat sometimes - but I guess that's part of the point, isn't it? If John Cusack isn't cast as Harry in the movie version (which I'm afraid is inevitable), I'll be shocked.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2276367166", "review_id": "2276367166", "date": "Jan 29, 2018", "rating": 3, "user_name": "Nur", "user_url": "/user/show/69003764-nur", "text": "This book feels honest and real. People makes mistakes. People wants second chances. People can be unforgiving. Fairy tales dont always exist. ", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4430981861", "review_id": "4430981861", "date": "Jan 08, 2022", "rating": 2, "user_name": "Ann Dewar", "user_url": "/user/show/7516547-ann-dewar", "text": "Reading this makes you realise how much has changed in the 20+ years since it’s publication and also, how little has. Men are generally much more involved with childcare than they were but still seem to expect applause for doing it. Similarly, Harry’s lack of self-awareness seems bizarre and he forgives himself pretty quickly for the mess he has createdFinally, the idea of Gina turning up for the wedding of the woman who helped to trigger her marriage breakdown and allowing Pat to be a pageboy…? Reeeaaalllyyy??? Can’t see it, somehow 🙄🙄🥲🙈", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3632764672", "review_id": "3632764672", "date": "Nov 18, 2020", "rating": 4, "user_name": "Natalija", "user_url": "/user/show/13628157-natalija", "text": "Although I was pretty sure I'd end up giving it the average 3 stars throughout the few weeks it took me to read it, I realized the book made me cry way too many times, so I'm bumping it to 4. Embrace the emo in you", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/42657515", "review_id": "42657515", "date": "Jan 11, 2009", "rating": 5, "user_name": "Faith", "user_url": "/user/show/1863114-faith", "text": "My expectations on this book were high. And as soon as I finaly got it from the library I Couldn't keep myself away from it. I Loved it from the first page to the last! On the cover it says that James brown has said in the Observer that he cried five times and laughed out loud four. I didn't really really cry, even thou the grandfaither died. He was after all 70 something. And such happens everyday. I'm not saying that it isn't a big dela, cos it is, but I can never get that engaged. Whatever, I don't know why I'm writing this. As for the laughing. I alughed a lot more that four times. Pat, the boy, was just so cute. Anyway. Man and Boy was Nick Hornby indeed, but even better actually. The book and the characters were just so symphatetic. Funny and hilarious and everything. Man and Boy is really about men in three generations. Gradfather Paddy, 70 something, typical for his generation, has been in the war, that is a very manly man. Father Harry, 30, left by his wife, forced to take care of his child by himself. Pat, 5, little cute boy with small worries. On the backcover Mail on Sunday says that the book is a love letter to a son from his father, and to a father from his son. That is absolutely right. A perfect way to describe the book. Thames in the book are fathers and families in the chaotic world of today and the peaceful world of yesterday. (Ok, that's a little too rough.) Anyway. The role of the father in a family. Is the mother supposed to do all houswork and mind the children and the father to go to work and bring in money? Hardly. Not today. But some men and woman still take for granted that there are separate men's and women's duties. Dad drives the car, and mum does the cooking. It's all about the upbringing. I mean, take our house. Mum seratinly used to do all the cooking and cleaning etc, and now when she can't, I do it. Well, not the cleaning, cos most of the time I don't see that necessary, but the cooking. Cos dad can't cook, but I can, even thou I hadn't cooked that much before I took over mun's duties. I couldn't imagine anything else. Well, I wonder if there's a point in this. Anyway. I just loved the book, and am eagerly looking forward to reading the sequel and anything ekse by Tony Parsons.", "num_likes": 2, "sort_order": "default", "shelves": ["2005"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/695520678", "review_id": "695520678", "date": "Aug 15, 2013", "rating": 4, "user_name": "Kishel Bactong", "user_url": "/user/show/9071363-kishel-bactong", "text": "I laughed and then cried, then some time in the beginning, threw it because of frustration. This book had me. It tugged my heart and lifted up some of the pessimistic views I have about love and men, life in general. This novel is about a producer, a husband and a father who made a mistake that caused him his wife. At first, I can't feel sorry for him. I just cannot find the nerve to forgive men who break their women's heart easily. They deserve to rot or work in a public high school canteen..in jersey. He goes by the name Harry by the way. So his wife left him and brought their 4 year-old son with her. But when she went away to go to Japan to, get this, 'follow her dreams..' Harry took his child to his care. Well, it was hard for him. He basically has ZERO knowledge how to raise a kid. But he persevered, with the help of his dad and his mom. By and by, he changed, he even turned down a big job just to be a father. He thought, he has been a failure. As a husband, as a son and he wants to try not fail to be a father. This is a story of how a man learns to know the meaning of true love and its realities or lack thereof of happy endings. This is a journey of a boy and a man. If there's something I have learned about this book is that nobody is perfect. We all make mistakes one way or another, its just that men are far better in picking and worse mistakes. Men are men and they will always act like how they are programmed (y'know what I mean, right? I need not spell this out?). Another thing, it is understandable for ladies to feel hurt, betrayed and all that, but there should always be room for forgiveness. Even the biggest act of betrayal is forgivable. They make mistakes, so are the ladies. Let's face it, men will hurt women, they will say sorry and beg for forgiveness, that's no assurance that they will not hurt them again. Forgive and keep on fighting for true happiness, for happy endings doesn't just land in your lap, you have to work for it. ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/825354016", "review_id": "825354016", "date": "Jan 16, 2014", "rating": 3, "user_name": "Janie Johnson", "user_url": "/user/show/5116650-janie-johnson", "text": "Tony Parsons is a brand new author for me. I discovered this book earlier in the year and finally decided to pick it up. It felt like a contemporary to me. This was not a blow me away, wow me book by any means but it was so well told, and so heart felt. This author can definitely tug on the readers heart strings. And if you don't feel something while you read this book then you need to turn your emotions on.Set in England you have this story of a beautiful family, Gina, Harry and their 4 year old son, Pat. Harry, who is turning 30, makes one big mistake and that it all it takes to drastically change all their lives and their families lives. Harry and his family try their best to heal from the mistake and so this story goes.I loved the characters in this story they were so vivid in my mind. I could picture each one of them. So many different types of people, eccentric, down to earth, wild and crazy. And I think I feel in love with most of them. I loved watching the growth of our main character Harry. You could not help but love who he is and who he becomes as well. I could not really pick out an antagonist as they all had their own issues and struggles to overcome. This story was definitely character driven rather than plot driven, which worked well. The main plot was the one that counted the most and I thought it was very well written.I can recommend this book to those who love a great heart engaging contemporary story with vivid characters and a beautiful plot line. It was truly engaging and irresistible to read. I thought though, that it could have had just a little bit more to it. So I decided to rate this a 3.5 stars.", "num_likes": 2, "sort_order": "default", "shelves": ["2014"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/128952312", "review_id": "128952312", "date": "Nov 02, 2010", "rating": 4, "user_name": "Michael Armijo", "user_url": "/user/show/4488615-michael-armijo", "text": "A British best-seller...B+ to this one! I found this book at an airport bookstore in London, England. It was a British bestseller at the time. I was intrigued by the title. It ended up reminding me how \"lucky\" I have been in my life. Life is unpredictable and we must be happy no matter what it takes. There was one event in the book that TOTALLY surprised me, catching me totally offguard. That's a 'real find' in a book! This isn't a depressing book...it's a book about real-life, love and savoring the present moments filled with happiness. Interesting lines for me: As the lead character, Harry Silvers' father is dying: 'The worst thing about it', my father whispered in the darkness, 'is knowing what you will be missing. I don't mean the things that haven't happened yet--Pat's wedding day, seeing you finally settle down--but the things that you take for granted. Seeing Pat ride his bike, telling him a story, kissing him goodnight. Watching him running around the garden with his bloody light sabre. All those small things that mean more than anything.' ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1554093961", "review_id": "1554093961", "date": "Feb 19, 2016", "rating": 3, "user_name": "Brenda", "user_url": "/user/show/5076889-brenda", "text": "I love to read about a character who starts off as a total screw up, but manages to figure things out, and that process can bring a wide range of emotions to the reader. This guy, Harry, messes up big time by having a stupid one night stand, loses his wife, but is left to raise his 4 year old son on his own. Through the process of figuring out parenting, which is often quite funny and endearing, he is able to reflect on his own relationship with his dad, and that experience (don't want to spoil it) was at times heart-rending and tearful. I found the story a little slow to start and got quite frustrated with Harry's messing up of his life, but once I got past that the book was so enjoyable it was hard to put down.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2837062242", "review_id": "2837062242", "date": "Jun 16, 2019", "rating": "", "user_name": "Ola", "user_url": "/user/show/11205726-ola", "text": "I chose it mainly because I hoped it'd be simple enough for me to read it in Serbian to practice my language skills. (It was.) I understood about only 70-80% of the thing so I guess rating it would be a bit unfair. After all, I knew I'm not getting a masterpiece here so there's no point in judging it too seriously. The plot was simple, full of clichés and self-pitying characters. I couldn't really remember why it seemed so familiar until the author actually mentioned Kramer vs. Kramer. Bingo. Just go and watch the movie. It is basically the same story but much better.I did learn neke nove reči though. :)", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1889323958", "review_id": "1889323958", "date": "Jan 23, 2017", "rating": 3, "user_name": "Justin", "user_url": "/user/show/37400-justin", "text": "This was a lovely, if somewhat unremarkable, book about a young dad whose world collapses around him after he cheats on his wife. The story follows his redemption as a man and as a father to his young son, but it's just as much about his relationship with his own father as anything. It was a good – and fast – read with some poignant moments but it was a bit too sugary sweet and unrealistic for my taste.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2223688785", "review_id": "2223688785", "date": "Dec 23, 2017", "rating": 4, "user_name": "Nga Nguyễn Phương", "user_url": "/user/show/75313142-nga-nguy-n-ph-ng", "text": "Your child isn't only your child, he/she is also your teacher who teach you how to be absolutely good parents.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2367687992", "review_id": "2367687992", "date": "Apr 20, 2018", "rating": 4, "user_name": "Kathryn", "user_url": "/user/show/29113719-kathryn", "text": "Excellent!", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2671760416", "review_id": "2671760416", "date": "Jan 13, 2019", "rating": 1, "user_name": "Zeljko", "user_url": "/user/show/49440114-zeljko", "text": "Waste of time.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2960221672", "review_id": "2960221672", "date": "Sep 22, 2019", "rating": 4, "user_name": "Lisa", "user_url": "/user/show/7396942-lisa", "text": "It started out really slow, but I got invested in the story eventually and ended up liking it a lot! ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3912221478", "review_id": "3912221478", "date": "Mar 30, 2021", "rating": 2, "user_name": "Regina Munoz", "user_url": "/user/show/119495350-regina-munoz", "text": "Very slow book. I only really got hooked on the last 100 pages. I feel like in general, the author could have explored the deeper emotions and experiences the protagonist was experiencing. General too fast paced for me considering the things Harry was going through. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3944454566", "review_id": "3944454566", "date": "Jul 12, 2021", "rating": 3, "user_name": "Cath Hughes", "user_url": "/user/show/61962996-cath-hughes", "text": "A good book but I just couldn't get into it. Lovely heart warming story about a single dad and his 4 year old son. Parts made me laugh out loud and parts were very sad.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3989706023", "review_id": "3989706023", "date": "May 09, 2021", "rating": 3, "user_name": "Niall Balmer", "user_url": "/user/show/128072852-niall-balmer", "text": "It’s ok, but I can’t believe it got book of the year. I’m sure there must have been better books even in 1981. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4150420160", "review_id": "4150420160", "date": "Aug 02, 2021", "rating": 5, "user_name": "Alekksej", "user_url": "/user/show/27176239-alekksej", "text": "Honest, realistic and emotional ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4399467689", "review_id": "4399467689", "date": "Jan 12, 2022", "rating": 3, "user_name": "Amr Amer", "user_url": "/user/show/138119106-amr-amer", "text": "it was nice reading a book from a man’s perspective for once.and it had some good reflections on broken homes and manhood, and i honestly didn’t expect to like this book but it surprised me for sure.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3326765514", "review_id": "3326765514", "date": "May 12, 2020", "rating": 2, "user_name": "Lauryn Tee", "user_url": "/user/show/105315780-lauryn-tee", "text": "The book is fairly well written but I can't really get behind the plot....A successful man cheats on his wife and then has to deal with the consequences? Woe is me.I have no connection to the character and don't think he does anything exceptional, he manages to look afte himself, get a good job and learn to cook, am I missing something or is it really this unexciting?Maybe in the 90s when his was written it was a groundbreaking idea to imagine a man looking after his kid while his ex tried to regain fragments of her old life. Now it's just dull.At the end when Harry has finally 'grown up' he writer adds that Gina and her new partner don't seem to be getting on. I'm not sure why the author felt the need to add that? Is he trying to show the reader that she was better of with her cheating husband in an unhappy unfulfilled life?", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3025200053", "review_id": "3025200053", "date": "Oct 25, 2019", "rating": 4, "user_name": "Jovana Despotovic", "user_url": "/user/show/80940874-jovana-despotovic", "text": "A touching story of a father-son relationship. The love of a child overcomes every obstacle in man, heals every pain of the soul and teaches us true values, gives us the opportunity to repair, until then, irreparable.Dirljiva priča o odnosu oca i sina. Ljubav prema detetu prevazilazi svaku prepreku u čoveku,leči svaku boljku duše i uči nas pravim vrednostima, daje nam priliku da popravimo,do tada,nepopravljivo.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1132120500", "review_id": "1132120500", "date": "Dec 14, 2014", "rating": 1, "user_name": "Conrad Buck", "user_url": "/user/show/37498377-conrad-buck", "text": "Only managed to get to about the third chapter and gave up. Just didn't find it very well written and the prose and style of writing just didn't seem to be up to par for a book that supposedly sold many copies. Maybe my reading interests have changed as I've gotten older but it just seemed very loose, weak and at times parts seemed irrelevant and not needed in the story. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1695272143", "review_id": "1695272143", "date": "Jul 11, 2016", "rating": 1, "user_name": "kori kayleen", "user_url": "/user/show/51065102-kori-kayleen", "text": " I HATE HARRY SILVER more than I have ever hated a fictional being including every villain that ever laid a finger on Harry Potter. My first ever one star rating. The four year old acted and spoke like a fourteen year old, every bit of the entire freaking novel could've been guessed from the summary on the back. I hate every cliche character, setting, and event of this. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2499044653", "review_id": "2499044653", "date": "Sep 27, 2018", "rating": 3, "user_name": "Davida Chazan", "user_url": "/user/show/3193744-davida-chazan", "text": "When Harry lost Gina because he cheated on her with a one-night stand, he got something else in return; a chance to learn how to be a real father to his young son, Pat. You can find out what I thought of Tony Parsons’s novel “Man and Boy” (the first in his Harry Silver series) in my latest book review on my blog now. https://tcl-bookreviews.com/2018/09/2...", "num_likes": 0, "sort_order": "default", "shelves": ["fiction", "coming-of-age", "literary", "contemporary", "print-copy"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/347844606", "review_id": "347844606", "date": "Jun 13, 2012", "rating": 4, "user_name": "Dennis", "user_url": "/user/show/962322-dennis", "text": "I was touched by this book but I could never quite come to terms with the absolute refusal of his wife to forgive one mistake. I'm not sure if thast was unrealistic on my part but that was my feeling.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1400153984", "review_id": "1400153984", "date": "Sep 24, 2015", "rating": 3, "user_name": "Anja", "user_url": "/user/show/41621107-anja", "text": "3.5/5spoilers now:book was good but why do endings of these novels have to be so 'the right thing to do'? why didn't he show that bitch and take her son so she can be the one for the weekends? men deserve kids as much as women and that should've been shown at the end as well.", "num_likes": 0, "sort_order": "default", "shelves": ["2015", "books-i-own"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1806006561", "review_id": "1806006561", "date": "Nov 07, 2016", "rating": 4, "user_name": "Sarah", "user_url": "/user/show/60880885-sarah", "text": "Forgot how much I liked this book, it's been a lot of years since I read it and didn't remember any of the story, even as I worked my way through it. I really did enjoy it, and it even brought tears to my eyes in some places... Great read!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/754618065", "review_id": "754618065", "date": "Nov 01, 2013", "rating": 5, "user_name": "Azran Ariff", "user_url": "/user/show/23202581-azran-ariff", "text": "Manly written - laconic yet sensitive as a man could be. Most men should be able to relate to it in some sort of way, and learn a thing or two.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/865637084", "review_id": "865637084", "date": "Feb 26, 2014", "rating": 1, "user_name": "Amandalily", "user_url": "/user/show/29071513-amandalily", "text": "Nothing much written bout the life of the father and son. I don't get the title of this book. It should be named 'Man'", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/597564278", "review_id": "597564278", "date": "Sep 22, 2020", "rating": 1, "user_name": "John", "user_url": "/user/show/15057504-john", "text": "Terrible, boring wasted reading time, I could not relate to anything in this book", "num_likes": 0, "sort_order": "default", "shelves": ["own", "fiction", "mexico"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1192341675", "review_id": "1192341675", "date": "Feb 06, 2015", "rating": 4, "user_name": "Carrie", "user_url": "/user/show/22233753-carrie", "text": "Loved this series of books", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1636759229", "review_id": "1636759229", "date": "May 13, 2016", "rating": 4, "user_name": "Jacques Coulardeau", "user_url": "/user/show/24373332-jacques-coulardeau", "text": "A love story of a completely different type, maybe unexpected, and it has not aged more than one single iota in the nearly twenty years that have elapsed since publication. It was adapted to television by and for the BBC. This iota has to do with the father’s attitude toward not getting primary residence for his son. Today courts are a lot more open on the question and some real sharing can be envisaged.But what makes this book special to the point of being translated into thirty languages? A lot of elements could be listed. I will just give a few.First the center piece of the novel is a young couple with a four year old child. The wife has sacrificed a career that she had never started to her family, a family that is so nuclear that she becomes a zombie from such nuclear fallout. Note even after six months of trying having such a career she will come back to the mould, request primary residence for her son and that will be it with maybe a second child later on with the new husband. As for the mother the book has tremendously aged. But back to the story line. She picks the first pretext she can find to run away. An easy task since boys will be boys and men will be men: they cannot escape the curse of the knob, as the husband Harry calls it, that makes them masculine. They have to rub it and to dip it into the first sheath available.Then the story centers on this man and his son. Harry learns how to take care of his son Pat. He becomes a single parent father. And he is successful at it. And yet the boy misses something. Guess what. The mother is in Japan having her own life with some Richard American expat, or something like that since it is not important who he is, his name, his position. He is just the man this frustrated woman picks to step back down into nuclear frustration. Poor Pat, and he is not the postman.Third, the author doubles this picture with a second mirror image, hence inverted which makes thing “normal” meaning straight. A woman, Cyd, an expat from Texas who has kicked her British BMW motorbike monster of a husband out of her immediate life and lives with her/their four year old daughter Peggy. Poor Peggy who is also missing something, a father probably. This makes the film utterly moralistic as for the definition of the parents of a child. There is no same sex marriage and no children with two fathers or two mothers, and children with single parents are seen as victims. A child has to have two parents and these have to be a man and a woman. Full stop! No question asked, hence no question answered. At the very end, in a club, there is a vague mention of gay men, but it sounds like some frustration on the part of the main character. Fourth. With that stuff the author makes a novel that is definitely new with some novel (new and not resembling something formerly known or used) ideas. It is true a lot less novel today. He now centers the novel on the father first and his efforts at becoming a true loving father and at providing his son with a new mother and a sister, Cyd and Peggy. But Cyd and Peggy are running away from such a choice, at least Cyd is, and Peggy follows. Pat just makes a new friend, but this time a boy whose identity is meaningless, except that we go back into a cliché: a boy with a boy, girls are for later.Yet the author avoids the soap opera with tears and whining mice and rats inter-devouring one another. Just one episode is important for the story: the relation of Pat with the parents of his father. The grandfather plays a role and particularly when he dies of cancer. The boy Pat at the age of five discovers death in a man he likes. Yet that loss is not exploited beyond the plain anecdote. For a child this age such an event is a trauma, and cannot be anything but a trauma. She child may be deeply disturbed, especially if he does not seem to be really shocked because he should. But of course it would have been another novel. So why introduce this death if it is not exploited? There is absolutely no reason why this grandfather has to die in this novel. It does not change the course of events at all, at least for the child. The novel at least avoids that possibility. So why mention the anecdote.Sixth. This death provides the “end” of the novel, but not in the child Pat, rather in the child Harry, because at this moment the father regresses to what he used to be as a child and he is deeply hurt, shocked and transformed by this death. Not on his own but thanks to the mother who has a tremendous power of adaptation. Harry’s mother goes through the funeral, survives her solitude and confides her secret to her surprised son. “Love means knowing when to let go.” Love then becomes a deep emotion that never leaves the one who lets go and it becomes the deepest inspiration for the one who goes, who is let to go, in this case Pat who is let to go by his father Harry. The book though does not seem to see the difference between letting go a dead man into death and letting go a child into a recomposed family. But I guess such contradictions are part of the genre. And the father drops all desire to get primary residence for his son and he lets the son’s mother and her recomposed family have it. Note the child becomes then a pure possession.This is heavily emphasized by the reference to the film “Cinema Paradiso” (Nuovo Cinema Paradiso, 1988) by Giuseppe Tornatore. Harry sees the film in a cinema with Cyd and the author summarizes it slightly skimpily: “. . . an Italian film . . . about a young boy’s friendship with the old projectionist at the local movie house. . . at the end when the gruff old projectionist, now blinded by a fire in the cinema, tells the Bambi-eyed young boy, now a teenager, to leave their village and never come back. The boy, Toto, goes away and becomes a famous film director and doesn’t come back to his little village for thirty years, on the day that they are burying Alfredo, the old projectionist who taught him to love the cinema and then sent him away. . . Because Alfredo knew that Toto would never find the things he needed in that little town. . . He had to break free so that he could learn what Alfredo already knew Life is not what you see in films – life is much harder. [dixit Cyd]” (p. 257-258)I regret the skimpiness of this summary because it misses absolutely everything important about the son Pat, because it cuts out Toto’s dead father, Toto’s sister nearly killed by a fire in the cinema, Toto’s mother, the two fire incidents in the cinema, the rebuilding of this cinema, Toto’s love affair with Elena, a rich man’s daughter, etc. In fact the film should have led the novel into another direction, but life is not what it looks like in films. Surely it is not, but the cinema teaches us great ideas and truths that life at times forgets to teach us and here the main idea is that Salvatore (Toto) has no father, needs a father substitute and finds one in Alfredo the projectionist. Toto is fascinated by the cinema (as an art and communicational medium) but his sister nearly dies in a fire in that local cinema (as a plain building that is inflammable). And Toto needs this father substitute to tell him: “OK, boy, it is time for you to go and realize your dream, live your life!” But Alfredo cheated in a way, and yet Salvatore would never have realized his dream of becoming a film director if Alfredo had not cheated and had not decided to lose a friend in order for that friend to become what his potential made him capable of becoming, and that future man will be able to hyg Alfredo on his deathbed if not in his coffin. To expand this theme let me quote the full synopsis of the film as given by the users of IMDb.“Beginning at the end, the movie opens with Salvatore's mother trying to inform him of the death of Alfredo. Salvatore, a filmmaker who has not been home since his youth, leaves Rome immediately to attend the funeral. Through flashbacks we watch Salvatore in his youth, in a post WWII town in Southern Italy. As a young boy he is called Toto and he has a strong affinity for the cinema. Toto often sneaks into the movie theater when he shouldn't and harasses the projectionist, Alfredo, in attempts to get splices of film that are cut out by the church because they contain scenes of kissing. Toto has a younger sister and war widowed mother who often struggle due to the loss of Toto's father. Toto is banned from the movie theater by his mother when his film bits accidentally catch fire and nearly kill his sister along with burning up the only picture Toto has of his father along with other family photographs. Eventually he sneaks his way back and forms a father-son bond with Alfredo, despite Alfredo's reluctancy, Toto even learns how to run the projector. Meanwhile one of the townspeople wins the lotto and becomes a rich man. One day in the cinema, after Toto leaves to watch the movie with his friends below, the film catches fire in the projector and knocks Alfredo out. Young Toto rescues Alfredo from death in the fire, unfortunately the cinema burns down and Alfredo loses his sight. Lucky the lotto-lucky-townsman pays to have a new cinema put up. Since Toto already knows how to run the projector he works with Alfredo in the projection room. Some years pass and Salvatore is now a young man. A rich girl, Elena, comes to town and Salvatore and his friends vie for her attention. Salvatore films her and begins to fall in love. Alfredo advises him to steer clear of love because it only causes pain. Despite his warning, Salvatore confesses his love to Elena, whose reply is that she does not, but she could. So he waits, every night outside her house for her reply. One day he gives up and trudges home depressed and upset only to soon discover that Elena does love him in return. They begin a passionate romance, like that of two newlyweds. Unfortunately, Elena's father doesn't approve and so he takes Elena away. All summer they try to meet, sometimes successfully, sometimes not. On one particular day he tries to reach her and she him but their paths don't cross. As we discover later, Alfredo catches Elena and convinces her to leave Salvatore alone out of love. Salvatore then wanders without purpose and eventually joins the military due to the requirement by Italian law that all male youths serve for a period of time in the army. When he returns to his home town, all has changed and he cannot adjust. Alfredo urges him to leave and tells him that if he were to ever return, he would not see him. Obviously Salvatore goes on to become a successful filmmaker. As he wanders the remains of his town after the funeral he sees a vision of Elena just as she was when they were young; he realizes it is Elena's daughter and follows her to Elena's home where he sees that she married one of Salvatore's childhood friends, a dunce when Salvatore knew him. He confronts Elena and they meet. They talk and she reveals to him that she didn't miss out on their fateful reunion but rather that Alfredo convinced her to leave. Salvatore realizes what a role Alfredo had in shaping his life and that Alfredo knew that if he stayed with Elena he would have no chance to pursue his love of film and so by going to Rome to become a filmmaker he sacrificed his love for Elena. Salvatore and Elena say farewell and go their separate ways. Salvatore returns to Rome with a can of film left to him by Alfredo. It contains all the splices of the kissing scenes from Salvatore's youth.” (http://www.imdb.com/title/tt0095765/s..., accessed May 13, 2016 )You can now realize how much the author missed, how many opportunities he missed on the side of Harry as well as on Toto’s side. The fact that Harry had been invited by Cyd to see that film with her in Soho is also extremely meaningful and the summary Cyd gives is so far from what is relevant: desire is one thing but it has no future in itself whereas love is not desire and it is able to see beyond the emotion the interest of the loved one who has to move away on his or her own road to eventually fulfill his or her promise, potential, future. We have our future in our own mind and brain but our body’s desires may tie us up so strongly at crucial moments in our lives that we miss the train and we reach the station too late. If we are lucky we can see the red lights of the train moving away and maybe learn a lesson for next time we try to catch a train: don’t linger satisfying your bodily functions and rush after your spiritual potential. Life is cruel if you do not do the latter. Life is beautiful if you do. I thus dedicate this review to a young man who has been my assistant for seven years and has to go on his own road. Don’t miss your train in the name of what is good now. Your train will not wait for you. Finally this novel has a happy ending for “everyone” though we could doubt the happiness of this ending but I won’t reveal it. It is good at times to run amok in a love story in modern garb, but please do not throw cobblestones on the pianist. He is only an entertainer.Dr Jacques COULARDEAU", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1030865399", "review_id": "1030865399", "date": "Aug 19, 2014", "rating": 5, "user_name": "Kendall", "user_url": "/user/show/21732428-kendall", "text": "*****************************************************************Harry should get custody of Pat. Harry has demonstrated excellent parenting skills by putting Pat first after Gina’s abandonment. Harry made sure that Pat felt comfortable at home and in school. He made sure Pat had friends to interact and have fun with. Harry was also willing to work out the marital problems he and Gina were experiencing. Harry never left Pat. Therefore, Harry should have equal rights and opportunities as a parent. Pat has two parents and considering Harry’s love and concern for Pat, Harry should be awarded custody of his child.\tHarry has demonstrated good parenting skills by being present for Pat and taking care of his needs. When Harry loses his job as producer of the Marty Mann show he does not initially take another job so he can take care of Pat. Pat is having problems at the nursery school as a result of his mother leaving him and going to live in Japan. Harry receives a job offer as executive producer of a new television show with the comic, Eamon Fish. He goes to the interview with Pat and realizes he cannot work a full time job and take care of Pat. Once again Harry puts Pat first in his life. Only when Eamon arrives at his flat to ask him to work part time as a producer does Harry accept the position. Harry takes Pat out of nursery school when it is obvious Pat is having trouble. Harry let Pat do what was best for him at the time, clearly showing his understanding of his child’s needs. When Pat is almost five years old, Harry enrolls him in kindergarten. Pat makes his first friend, Peggy. Now he really enjoys it and is well adjusted because of how his father treated him. Harry also makes sure Pat is only with safe family members. Gina had wanted Pat to stay with her father who left Pat with his daughter Sally (from an abandoned marriage) and her boyfriend. Harry walks in and sees the boyfriend and Sally making out and smoking and removes Pat from the house. Instead of using Sally as a babysitter Harry lets Pat spend time with his own parents. Pat’s grandparents are wise and knowledgeable and love Pat, showing him a good time in a safe setting. Even when he needs more help Harry calls upon a family friend, Auntie Ethel, to help him. As a parent, Harry is a very good father.\tHarry has a willingness to work on his marriage with Gina. Gina expresses no interest in any attempt to reconcile the differences in their marriage. Gina’s father’s “hippie womanizing” life style of abandoning children as he went along profoundly affects Gina and her attitude toward marriage. She felt that Harry’s one sexual encounter out of their marriage equated his behavior to her own father’s. Harry had become a womanizing beast in her mind. Even when Harry had shown he had just made a mistake and could hold up a nuclear family. It was Gina’s own fears as a child that made her marriage collapse and abandon her son. Gina then went to Japan to focus her career as an interpreter. Although Gina’s lawyers present her traveling to Japan to be the only opportunity for her to make a life and career for her and Pat; her abandonment of Pat shows a selfish, self centered, ego driven woman. While she is trying to get her career going and intending to send for Pat, Pat is suffering from the abandonment of his mother. Gina also is having an affair with a married businessman in Japan. Gina was a wonderful mother to Pat before her Japan adventure but she has now gone to the “dark side of the Force.” In question is her character, will she have another breakdown and ruin her life and Pat’s life? The issue of Pat being exposed to inappropriate music is an ironic one because Gina’s own stepsister, Sally gave it to Pat as a gift. Gina states that Pat is allowed to watch violent films unsupervised. Pat has been watching the Star Wars triology since he was quite young with permission from Gina. This is not an arguable issue since the Star Wars films are extremely violent for a young child to be exposed to. In reference to the Harry’s failure to provide a safe environment, this is also not relevant. The terrible biking accident that Pat experienced makes Gina feel that Harry is a bad parent. Any parent knows that anyone can look away for a split second and have their child suffer a serious injury. In no way does that event make Harry a negligent, irresponsible parent.\tFathers should have equal rights to the custody of a child. Typically, children are not given a voice in custody battles. Harry tries to give Pat such a voice. Pat feels safe and secure with Harry and had adjusted to Gina’s absence from his life. His success at kindergarten is evidence of this. “If very small children could speak, they would not choose to divide their lives in half. It is just not developmentally appropriate.” (McBroom, 1999). Pat wants to remain living with Harry. “We would look, first of all, to who is performing the actual parenting.” (University of California at Berkeley) In this case, Harry is performing the parenting as Gina has abandoned her son and is now off having an affair with a married man.\t“The absence of a father from a child’s life can lead to a wide variety of negative behavioral and educational consequences.” (Larson, 2003).“Attachment refers to the strong emotional bond that develops between children and their primary caregivers… Establishing a stable, trusting relationship with a caregiver is an important component of early social development… Early attachment has a long term influence on children’s adjustment to school and social skills…” (Passer and Smith 473-475) Although the mother/son bond is important the father/son bond is equally important.In England, a parent no longer is granted “custody” according to the Children Act of 1989 but a residence order is issued. “Residency replaces custody as a way of removing the confrontational nature of deciding where a child lives. A residence order does not deprive any other person of parental responsibility. The law was changed to make it clear that a child is not a possession that can be won or lost. Under the terms of a residence order, a child lives with you. But a child does not belong to you.” (Parsons 298-299).Harry should be granted custody of Pat because he is a good father. Harry did not abandon Pat like Gina did, causing Pat emotional turmoil and the need to be taken out of nursery school. Harry is a loving, supportive and caring parent who puts Pat before everything else in his life (such as his career). Gina abandons not only Pat, but also the marriage, with absolutely no desire to keep the nuclear family intact. Harry is a man with much integrity. He shows it through his love for Pat and his willingness to do anything for him. Harry should be granted residency. Good fathers should have an equal chance. Works CitedLarson, Aaron. “Father’s Rights and Child Custody Law.” ExpertLaw. Online. September 2003.McBroom, Patricia. “Modern Custody Disputes Favor Father’s Rights Over Child’s Welfare.” University of California Berkeley. 28 January 1999. Parsons, Tony. Man and Boy. New York: Simon & Schuster, 2001. Passer, Michael W.,and Ronald E. Smith. Psychology: Frontiers and Applications. New York: McGraw Hill, 2001.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1891661494", "review_id": "1891661494", "date": "Jan 25, 2017", "rating": 5, "user_name": "Joey Nguyen", "user_url": "/user/show/44309518-joey-nguyen", "text": "One of the major themes represented within this book has to be the theme of love. It doesn’t have to be necessarily the love between man and women; in this case it’s father and son. I really enjoyed how the novel Man and Boy portrays this theme in a very detailed manner when Harry is left alone to take care of his Pat. The father son relationship grows as Harry does everything he can to raise his child. The author was very powerful while describing the setting and characters in the first few chapters. The amount of detail put in the novel made the readers experience the story firsthand. In my opinion a story that has a great description of the settings and characters establishes its greatness from the first few chapters. Man and Boy had curiosity in almost every chapter, as the reader I was excited, curious and stayed glued to my seat wanting to know what happened in the next page.Although there are a lot of positive influences in this novel, there are also negatives which shouldn’t be ignored such as the ending being very fairy tale like and fake; also events in this novel happened suddenly. Normally to average humans it would take them time to get into another relationship after divorce, however Harry met a new lady and got married within a few months of his break up. This book makes it out to seem that in reality there is always a happy ending. However sometimes things don’t end up in a fairy tale style ending. Man and Boy is a novel with a roller-coaster of emotions, describing feelings and mental thought process in an extraordinary way. The novel showcases the importance of strength within a relationship and the importance of a relationship. This novel appealed to me because of all the drama, romance and plot twists it had stored within it. The novel started of very boring and randomly took a twist making it very interesting. Personally I was satisfied with this book. If you are interested in a novel with romance, corruption, plot twists and drama, this novel will be a good read for you.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3102735055", "review_id": "3102735055", "date": "Dec 29, 2019", "rating": 3, "user_name": "Suganya Jothi", "user_url": "/user/show/60830284-suganya-jothi", "text": "This novel is an emotional roller -coaster. To book lovers who wants to break free from the reality and relax in a fantasy, this novel is too real and that eventually infuriates the audience and that reflects in many reviews. The novel captures the essence of father son bond which acts as a page turner. The novel also takes a stand in love, propagating true love is the willingness to let it go. the protagonist Harry Silver is selfish in his own ways and his ways of categorizing people as beautiful and ugly makes him shallow and also he is a textbook romantic kinda man and not to forget that he cheats his wife and never feels guilty about it and he hides it from possibly everyone starting from his parents,his lover and eventually his lawyer, yet, for some reason he tries to justify his actions and plays victim and every time the author tries to glorify the protagonist, he terribly fails. he is not perfect but custom made for his life with his son Pat, his father Patrick and his love Cyd and with them he seems fine and even perfect in certain circumstances.Thus making him a perfect blend of positives and negatives and perhaps,all of it is too real, thus it bothers many. The novel also plays around many real emotions like divorce, death, parenthood. The writing of Tony Parsons is impeccable, even when one dislike a certain character, one has to remember that the outburst of emotions is because of the amazing reality that is created by the author and his writing. In the end one would close the book loving the author for creating the reality within fiction and absolutely hating the reality of the novel and the characters. IF YOU ARE STILL CONFUSED WHETHER TO READ THIS NOVEL OR NOT, Let me put it bluntly, if you are willing to go against reality once again in your magical reading room, go for it. If you are too tired to reality, stay away from it because this novel is one heck of a remainder of people and emotions some of us deal in our day-to-day life.", "num_likes": 0, "sort_order": "default", "shelves": ["roller-coaster"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2408762835", "review_id": "2408762835", "date": "Aug 18, 2018", "rating": 2, "user_name": "Caixa Catalunia", "user_url": "/user/show/15879247-caixa-catalunia", "text": "******Contains spoilers, I guess****This is a book about a man who doesn't get anything. He cheated on his wife who consequently decided to leave him. Their marriage fell apart because of him, yet the book is full of him complaining about the world is and how he suffers. More, even though he never much cared about his wife or son to be interested in their wellbeing and happiness while they stayed together, he feels extremely proud of himself that he looked after his son for the whole FOUR MONTHS. To exemplify what I wrote, I have a few 'genius' quotes for you:‘Was it really all my fault? Or was it just random bad luck, like getting hit by a car or catching cancer? If we had loved each other so much, then why hadn’t it lasted? Was it really impossible for two people to stay together forever in the lousy modern world?’ (following his logic, it would be possible if he didn't cheat or she would be fine with him sleeping around)‘But I wasn’t ready to grow old and cold, hating women and the world because of what had happened to me.’ (what happened was that his wife didn't forgive him cheating)‘And I don’t want her to meet a boyfriend until I’ve been seeing him for a while. Okay?That didn’t make any kind of sense to me.’ (him not understanding his new partner taking precautions to protect her daughter from the confusion of seeing various boyfriends)'You can’t expect us to take part in the parenting and then just step aside when she wants us to'(him being proud of himself of taking part in his 4-years-old son's last 4 months, real star)I gave it two stars because, despite the stupidity of the main character and a lousy attempt at justifying his behaviour, it was a pleasant read most of the time.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3326140807", "review_id": "3326140807", "date": "May 09, 2020", "rating": 1, "user_name": "Jean St.Amand", "user_url": "/user/show/22273050-jean-st-amand", "text": "Hmmmm, this book....I don't know quite what to think or say. I've got a BIG problem with people who end one relationship and immediately begin another. And an even bigger problem with people who leave a marriage and, within a few months, are \"engaged\" to someone new... you can't be engaged if you are still married, genius. Did Gina even recognize the irony of leaving her husband because he had a one night stand and becoming the mistress of a married man??? Seriously. And as unenlightened, old fashioned, or sexist as you may think I am, my biggest problem is with a woman who buggers off and leaves her child to \"get her life back\"...f off, you selfish cow. Don't think I am only criticizing Gina. I am no happier that Harry started dating... what was it, a month after his wife, as the British like to say, scarpered. And decided just as quickly that Cyd was \"the one\"... after all, their mouths fit, in a way that even his wife's never fit. And both women had long legs, so OF COURSE it was true love. Best part of the book was the stupid duck joke. Laughed until I cried. Literally. Even took a picture of the joke and posted it on FB. Some books, I don't realize how much I hated...not so much the story, but the characters, until I start to write a review. Liked Harry's parents, a lot. They had some self respect and self restraint that everyone else was lacking. Also, I couldn't figure out why so many random people who were part of Harry and Gina's life were at Marty and Siobhan's wedding. That didn't make sense. And what about the similarities to Kramer vs Kramer?? The lawyer even brings up the movie at one point. What the ***?", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4398823274", "review_id": "4398823274", "date": "Dec 19, 2021", "rating": 4, "user_name": "Tantravahi ", "user_url": "/user/show/83843263-tantravahi", "text": "I didn't expect to like this book, I'll give you that. I picked it up, on whim, from a friend's bookshelf. He didn't remember he owned this book. He couldn't remember if he read it. When I was halfway through the book, I imagined penning this review and it started off with 'A mediocre book about a mediocre guy, who created his own conflict, and then grew up'. I think, in theory, that sums up Man and Boy quite accurately. But, once I got past the halfway mark, and felt a few jolts from my own life coincide with his, Harry Silver's, I realized this isn't all that bad. In fact, this could be pretty great, if you're massaging a few wounds. Harry Silver cheats on his wife of twelve years. And she leaves the very next day, of course she does, to get back the life she gave up to be with him. When you're trying to undo some past decisions, you can't honor a few others, too. So, their son gets left behind with Harry, no questions answered. And the book's about Harry trying to cope with this new change. He gets fired soon after. A few deaths added into the mix. It's all very 'It's a Wonderful Life' minus the loss of cash, or dream sequences, and perfect as a December read. I don't know if I have it in me to recognize a good man from another, but I can gauge good writing from what's not. And Tony Parsons knows how to write just enough to touch you. I'm touched and I'm glad I picked this one up.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2708093361", "review_id": "2708093361", "date": "Feb 11, 2019", "rating": 4, "user_name": "it’s a book thang", "user_url": "/user/show/78712555-it-s-a-book-thang", "text": "Book 10 of 2019; Man and Boy – Tony Parsons I picked up ‘Man and Boys’ from the op-shop down the road from my work on my lunch break. I had no idea what it was about & had a fleeting thought that it was a movie staring Hugh Grant in it…I still haven’t googled that to see if I am wrong (or right). I really enjoyed it-it was a smooth easy read with moments of beauty in it. Being a mother of sons I enjoyed his descriptions of snapshots of child hood like when your sleepy 4 year old comes out in the morning smelling like sweaty sleep, or the unabandoned love they throw on you so fiercely when they are still your babies. I made me feel nostalgic for those time with my babies that are all growing so fast & are taller than me…I mean, for God’s sake I am teaching my eldest how to drive & my baby is finishing primary school this year. I miss the easy days of playing with playdough for hours at the bench & bath times where all they wanted was me to it by the bath with them & play boats… The story line was not exciting but & Parsons doesn't dazzle with his writing style (it's practically invisible), but rather with the skill by which he makes a page-turner out of a simple father-son story. Before you know what has happened, you'll be rearranging your schedule so that you can spend another few minutes with Man and Boy.4/5⭐️ Happy reading x", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3492635347", "review_id": "3492635347", "date": "Sep 06, 2020", "rating": 2, "user_name": "Richa Sharma Dhamorikar", "user_url": "/user/show/28527046-richa-sharma-dhamorikar", "text": "More like 2.8 stars out of 5. This is a story about a well-settled man called Harry Silver, hid mid-life crisis at the age of 30, his separation from his spouse and most importantly, the effect a divorce has on the child. When I started reading it, I thought that here is a book that talks about a male perspective of what it takes to maintain a marriage, take care of a child, midlife crisis everyone faces and cope up in a society not very supportive of single parents. But somehow, the novel either lost its plot midway or did not give me the answers I was seeking. The effects of a divorce on a child is well described, how the children cope up with the loss of a 'family', what doubts creep up in their heads about where they would stay, how they would live, how the child is torn between loving and living with either of their parents etc. That was the part I thought was well highlighted and greatly discussed. The writing is easy and smooth and you do not get to know when you reach the last chapter. However, I could not be attached to any character except Pat, child of Harry and Gina. I actually did not or could not like any of the characters in the book. It is okay-ish, it is funny in some places, a bit sad at others but overall, it is just okay.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2712637077", "review_id": "2712637077", "date": "Feb 15, 2019", "rating": 3, "user_name": "Sam", "user_url": "/user/show/90285867-sam", "text": "I didnt know men felt this. I don't think this applies to this generation anymore. Because the MC was just ranting on about how men are treated unfairly.. I didnt like how most people in the book was just openly judging the way Harry, the main lead, is. And I hate the genralization, like is this.. For real? Kept saying stuff how Harry should be, he should be this, should be that, like can y'all shut it? Harry made a mistake and people were like Harry you are this, and you shouldn't be, or else your life won't be happy at all. I didnt really see that 'this' of Harry. Ya feel meh?Speaking of meh, the ending was meh. The cover btw, cried 5 times, laughed 4? Tf why are you counting.. Aand i didnt cry and maybe only smiled a couple times and that's it.And here's a blockquote bc i feel like itI didn't want it all. All I wanted was one more chance. One more chance to have a unified life, a life without broken bits and jagged edges. One more shot at happiness. And what- *edits* this is a ffrekin series!??", "num_likes": 0, "sort_order": "default", "shelves": ["2019-reads"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2869922001", "review_id": "2869922001", "date": "Jul 11, 2019", "rating": 3, "user_name": "Rafaella ", "user_url": "/user/show/48267962-rafaella", "text": "A very smooth book to read, nothing special, a little bit of everything, yet nothing in particular. The whole story feels very diluted, it doesn't have a plot( which isn't necessarily a negative thing), but in this case I find a lot of the chapters to be extremely useless and unneeded. This is what keeps the reader from sinking into the story. The topic is very interesting and it has a lot of potential to dig deep into it, but for some reason, the author chooses not to do so. What Parsons manages to do though is to illustrate how a broken marriage/ split up parents affect the children and their future. There are a few strong moments,where the conversation and actions feel extremely real, which is why I kept reading.Definitely wouldn't recommend if a person wants to read something special, that would leave them with a feeling of satisfaction. The book is very pleasant to read during trips (maybe the reason why I enjoyed it and why I give it 3 stars ).", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3469397185", "review_id": "3469397185", "date": "Jul 29, 2020", "rating": 1, "user_name": "TRẦN NHUNG", "user_url": "/user/show/106358654-tr-n-nhung", "text": "I seldom read non-fiction books as I find quite tricky to remember previous details to fully understand them as a whole. However, when doing window shopping, I was hooked by the title of this book and gave it a try. Disappointingly, it doesn’t work as what I visualized. It is about a story of a man who had everything (a decent job, a happy family, and a romantic love with a dutiful wife) lost all what he achieved after a night of betraying his wife, making me curious about upcoming plot twists. Actually, I looked forward to the moment he could realize his mistake and sincerely change his behaviors in a better way to keep his wife back, but it didn’t happen at all. He complained all the time how unfair his life is, and cowardly supposed that it was her fault when she left him and their son alone rather than bravely face up to his mistake and say the truth to his parents about it. This book was not the same as attractive its leading in on its cover. 😭 ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4435807020", "review_id": "4435807020", "date": "Jan 02, 2022", "rating": 2, "user_name": "Kausik Venkatesan", "user_url": "/user/show/72165863-kausik-venkatesan", "text": "I started my reading journey this year with this book, which was recommended to me by a friend who found it heartwarming and touching. Sadly, we both do not agree on this at all - it was underwhelming and bland. I will not elaborate on the storyline too much - this book primarily talks about Harry Silver (recently turned 30) and his mid-quarter-in-between (whatever) life crisis and how he copes being single with his 4 year old after his wife leaves him after he cheats on her with a one night stand. The problem with Harry and the book in general is that just when you start feeling sorry for him and truly empathize with his travails, he starts being whiny and begins to wallow in self pity. That pretty much sums up the book for me. It tries too hard. I gave it 2 stars only because the prose is light and engaging to read - but even that cant take one too far - I began to tire after the 200 page mark. Strictly a one time read only!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2277767364", "review_id": "2277767364", "date": "Sep 26, 2018", "rating": 2, "user_name": "SillySuzy", "user_url": "/user/show/2235973-sillysuzy", "text": "The British version of Kramer versus Kramer. Harry Silver is left by his wife Gina after he had a one-night-stand with a colleague of his. Gina departs for Tokyo, leaving their 4-year-old son Pat with Harry. Harry gradually learns to cope with being a single parent (with a lot of help from his own parents). After about four months, Gina turns up again with her new lover and she wants Pat back. Although this novel is a bit dated sometimes (published in 1999), I thought it was a nice enough read until I came to the ending. The ending was so sugarsweet, so predictable and so politically correct, it made me want to puke. Not recommended. I just found out that there are two sequels to this novel (Man and Wife and Men from the Boys. I think I'll give them a miss.", "num_likes": 0, "sort_order": "default", "shelves": ["general-fiction"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3215940000", "review_id": "3215940000", "date": "Mar 12, 2020", "rating": 4, "user_name": "Emilia", "user_url": "/user/show/108447130-emilia", "text": "I deeply enjoyed this book as it was written from the perspective of a man who has been left by his wife now faces the struggle of bringing up his son whilst dealing with conflicting factors such as his job and relationship. The author included humour/sarcasm and tragedy to bring this story across and was very well written. It is a heart-warming story and it follows the journey of finding self-respect as well as the real meaning behind the words love and family. This is a romance/domestic fiction book and I would recommend it to anyone who enjoys books about self-worth or realistic fictional stories. It is quite an easy read, full of page turners and Parson's style of writing keeps you on edge. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3480424999", "review_id": "3480424999", "date": "Aug 07, 2020", "rating": 5, "user_name": "Julie Tombs", "user_url": "/user/show/25401157-julie-tombs", "text": "This is not the first time I have read this but I had forgotten how poignant and emotional and heart warming this book is. It is a modern story of a father, son and grandson. It is a story of a failed marriage and new relationships starting and an examination of children and divorce. It is also a reflection of how society has changed in the last 50 years and the expectations of marriage and women and men's changing roles especially when it comes to parenting. The traditional set up of men working and women raising children has been turned on its head and no longer is it the expectation that children need only their mother. The book also examines the role of absent or poor parenting. A brilliant book. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3793031484", "review_id": "3793031484", "date": "Jan 25, 2021", "rating": 5, "user_name": "Imarie Oberholzer", "user_url": "/user/show/117709714-imarie-oberholzer", "text": "Tender and sweet and above all things, real. This book was terrifically easy to read, simply written but vivid, immersive and full of quotable phrases. I loved it. I honestly could not put it down. I'm probably as far removed from the character as possible, and I shouldn't have any reason to relate to him or root for him even, but the story is so wonderfully written that I couldn't help but relate. There is so much clever, subtle commentary, put so well and explored within the limits of the plot and used to further the story that I'm not completely sure whether it's meant as social commentary or not. All in all, I absolutely loved this book and would recommend it to everyone who knows how to read. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1696312323", "review_id": "1696312323", "date": "Mar 07, 2021", "rating": 3, "user_name": "Kirsty Monteith", "user_url": "/user/show/38933856-kirsty-monteith", "text": "An enjoyable but long winded read So I had quite a thing for Ioan Gruffudd when I was younger ans remember watching him in the TV adaptation of Man and Boy quite a few times and really enjoying it. Always fancied reading the book as well so here we are.. Many years later.Since the TV adaption followed the book fairly closely it meant there was no real intrigue for me reading the book as I remembered a lot of what happened. This meant at points I found the book a bit of a slog and it took me ages to get through.However in general I did enjoy it - especially the stuff around Harry and his relationship with his Dad.. Haven't decided if I'll read the others in the series... Maybe after I've read a few exciting thrillers first! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2550586044", "review_id": "2550586044", "date": "Oct 03, 2018", "rating": 5, "user_name": "Alexouki", "user_url": "/user/show/11858871-alexouki", "text": "I found this book absolutely amazing. While reading this I kept getting angrier and angrier at the main character and this is what I loved the most, the rawness of it. The character acts like a normal human being and behaves like every other human being he is not a superhero or whatever. He makes choices, he faces the concequences. It discusses about different life relationships, like father-son, mother-son, husband-wife etc, although I wonder how one can live without best friends since the main character didnt have none. I recommend this book for a chilling reading, it made me laugh but also cry sometimes. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3270773513", "review_id": "3270773513", "date": "Jul 04, 2020", "rating": 4, "user_name": "Christie Bane", "user_url": "/user/show/10727035-christie-bane", "text": "I really thought this book was a memoir until I was halfway through and happened to glance at the inside flap and realized it was a novel. It was so real and raw — at least the first half — that it absolutely sounded like the wide-open personal story of a love that didn’t last and the damage it left behind. (I don’t actually know how this book got onto my to-read list, but it’s been on there so long that I forgot it was fiction.)This book nails both the joys and the extreme sadnesses of being human, but especially the sadnesses (even though the ending is more or less happy, or at least hopeful), so do not read it if you’re looking for something uplifting. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4509739751", "review_id": "4509739751", "date": "Jan 31, 2022", "rating": 4, "user_name": "Wendell Hennan", "user_url": "/user/show/26997520-wendell-hennan", "text": "A good marriage ends, and a father has to learn how to become a father, and at the same time grows closer to his father. Another relationships ends, not being able to handle the imperfection of children from past relationships. Granddad, who has helped immeasurably with Harry becoming a better father, dies of cancer. A custody battle that Harry concedes, love is knowing when to let go, probably the most important truth in the entire novel. Sad in many many ways, but not inaccurate in the portrayal of men's wanderings. A surprise happy ending that doesn't quite take away the sadness from the whole story. Complex, plenty to digest.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2738824126", "review_id": "2738824126", "date": "Mar 04, 2019", "rating": 1, "user_name": "Holly", "user_url": "/user/show/4809862-holly", "text": "Self-absorbed jerk has to figure out how to be a decent father and a decent son. Becomes slightly less of a jerk but still hopelessly self absorbed. There were very few likable characters in this book and I didn't like the writing style. A few of the glimpses into the English television scene were amusing, but the rest of it was so cliche, straight out of Kramer vs Kramer and the like. I had no idea it was the first book of a series...why? Oh, and somehow the author doesn't know the difference between pedal and peddle.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3294055637", "review_id": "3294055637", "date": "Apr 21, 2020", "rating": 5, "user_name": "Charlene Dolan", "user_url": "/user/show/110144512-charlene-dolan", "text": "‘ I'm not saying it's what I would have wanted. But don't you see? We fuck up our lives again and again and it's always our children who pick up the bill. We move on to new relationships, always starting over, always thinking we've got another chance to get it right, it's the kids from all these broken marriages who pay the price. They - all the millions of them - are carrying around wounds that are going to last a lifetime. It has to stop. ‘Another favourite series, so well written and relateable. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1779058181", "review_id": "1779058181", "date": "Oct 24, 2021", "rating": 5, "user_name": "Mihai", "user_url": "/user/show/8963221-mihai", "text": "I stumbled upon it via BCC Book Club, and found it as one of the single contemporary guy lit novels with a predominant Tory streak which actually deserves some praise. It it well written, clear as s good piece of journalistic press - that's why I think I can remember almost all scenes from it without too much effort - and interesting as it builds up on fears that any family has at some point. A social/divorce horror story in a sense, one on which the child is the main victim, and those around him learn one by one the things they should know as parents.I liked it quite a lot.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2226883669", "review_id": "2226883669", "date": "Dec 26, 2017", "rating": 3, "user_name": "Emily James", "user_url": "/user/show/29010819-emily-james", "text": "Had me hooked from page 1... I eagerly devoured the first half, but then it began to lose me. My main issue was the dialogue: the newly-arrived American spoke like a Brit and the children all spoke like adults. 5-year-olds were riding motorcycles and listening to hard-core rap. And the entire book of characters showed up at a wedding for which most of them had no connection. It just didn't work. It's a fun, quick read, made me laugh out loud and cry real tears. We'll leave it at that!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2699592781", "review_id": "2699592781", "date": "Feb 12, 2019", "rating": 3, "user_name": "Valerie", "user_url": "/user/show/68718797-valerie", "text": "Okay this is more of a 2 star book but there were a lot of themes that were parallel to my life which bumped this up to a 3. However the whole book I was just waiting for the main character to realise his mistake, this isn't a spoiler as it happens in the first 2 chapters, he slept with another woman once, the character kept trying to rectify it by saying I only did it once, it was a mistake. That was my main issue with this book, he never admitted his mistake.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2968065104", "review_id": "2968065104", "date": "Sep 07, 2019", "rating": 5, "user_name": "Mary E SMYTH", "user_url": "/user/show/60529625-mary-e-smyth", "text": "I have read most of Tony Parson's Max Wolfe.,police procedure books, and thoroughly enjoyed them all. Man and Boy was flagged as being sort of autobiographical and I was intrigued to learn a bit more about this writer. Initially I wasn't too convinced that this was my kind of read but before long I found myself unable to put this book down .I don't believe in regurgitating books in a review. Enough to say I am looking forward to my next Tony Parson book. confident both series will be a feast of well written entertainment..", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3070951932", "review_id": "3070951932", "date": "Dec 14, 2019", "rating": 3, "user_name": "Clint", "user_url": "/user/show/8161103-clint", "text": "Fictional treatment of an English couple with a young son who split up. The mother acquires work in Japan but can’t immediately take the son. The father keeps the boy but is soon out of work. The scenario weaves around the father waking up to his role, his role as a son and, eventually, to what might ultimately be best for the son. The ending, drawn from 10,000 rom-coms, was a little disappointing.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3193871867", "review_id": "3193871867", "date": "Feb 16, 2020", "rating": 2, "user_name": "Sally Andrews", "user_url": "/user/show/3687855-sally-andrews", "text": "This book could have been absolutely amazing except for two things:1) It was so closely akin to Kramer vs Kramer that it was almost plagiaristic.2) The f word being bandied about like a ping-pong ball got REALLY old. It was terribly distracting and totally unnecessary. Just tell the story with emotion. Bad language, in my opinion, really doesn't add much in most circumstances. This was over the top. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3315451631", "review_id": "3315451631", "date": "May 03, 2020", "rating": 5, "user_name": "Neil Merryweather", "user_url": "/user/show/108232626-neil-merryweather", "text": "This was my second reading of this book - the first being many years ago.I found the book to be really affecting - which is very unusual for me.Being a father and having aging parents really increased it's resonance.The character work is brilliant and they are all believable. The main character's relationships with his son and father are the main driving forces of the book.I can see these people actually existing and can resonant with their trials and tribulations.Amazing book!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3805293735", "review_id": "3805293735", "date": "Jan 29, 2021", "rating": 3, "user_name": "Olha Perelet", "user_url": "/user/show/129358567-olha-perelet", "text": "as for me it’s just a simple book for vacation if u don’t want to think a lot. it seems like a tv show with low ratings but it’s still just okay.two things that i liked here that the main character still believes in love and still being optimistic after pretty sad things in his life, but man why did u cheat on your wife if u are so romantic boy who wants to live all your life with one woman??? i have a lot of questions. my rate is that book just okay and that’s all.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4560034704", "review_id": "4560034704", "date": "Feb 20, 2022", "rating": 4, "user_name": "Драгана Домазет", "user_url": "/user/show/147955359", "text": "Porodična priča u kojoj Hari ostaje bez svoje žene zbog muške požude za devojkom na jedno veče. Nakon odlaska supruge Đine, Hari se susreće sa čarima roditeljstva prema svom jedinom sinu Patu. Nove nedaće ga čine zrelijim i sposobnijim muškarcem koji kroz roman \"Čovek i dečak\" prolazi kroz dosta šture, ali i srećne momente. Da li je avantura na jedno veče bila vredna svega što je izgubio, ali i dobio...vredi pročitati.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2085639170", "review_id": "2085639170", "date": "Aug 21, 2017", "rating": 5, "user_name": "Sean Casey", "user_url": "/user/show/49541860-sean-casey", "text": "Hell of a book. Nails what it feels like to go through a divorce & all of the things that break your heart with how your kids are impacted, and the loss of your own Dad, and all the big questions and doubts that ensue. Parsons does this all with wit and self deprecating humor & a ton of empathy. Really great book...", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2149201594", "review_id": "2149201594", "date": "Oct 13, 2017", "rating": 4, "user_name": "Helen Wright", "user_url": "/user/show/69721684-helen-wright", "text": "I like Tony Parsons style of writing, and this is a really good book, showing how marriage break up impacts on all the family, not just the couple themselves. Well written and I could really empathise with the characters, I cared about what happened to them. Having read his crime thriller books this was a pleasant surprise!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2262912802", "review_id": "2262912802", "date": "Jan 25, 2018", "rating": 5, "user_name": "Svetlana", "user_url": "/user/show/64976581-svetlana", "text": "I was halfway through Michael Connelly’s novel when I picked up this book and decided to read a few pages just to see what it is about… and I couldn’t put it down. The book is beautifully written, it’s engaging and heartfelt, and it’s funny and deeply sad at the same time. I found the storyline about Harry and his father particularly moving. Loved it!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2384068667", "review_id": "2384068667", "date": "Jul 18, 2018", "rating": 3, "user_name": "Jan", "user_url": "/user/show/2067728-jan", "text": "This was almost a 4 star. Lovely tale of a man and his young son, as they spend quality/quantity time together for the first time. At times heartbreaking, and at times heartwarming, I liked the tone and voice of the main characters. I've just realized that there is a follow up book - I will definitely read it. ", "num_likes": 0, "sort_order": "default", "shelves": ["read-on-kindle"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2677683699", "review_id": "2677683699", "date": "Jan 19, 2019", "rating": 2, "user_name": "Claire", "user_url": "/user/show/80581379-claire", "text": "I wanted to like this book, but... it was too predictable, too contrived, and the characters too flimsy. Things seemed to happen for no good reason just to serve the plot; it wasn't natural at all. And the characters were hypocritical and the ending felt like a let-down!! But it was entertaining in its own way and the writing itself was not bad, soo two stars.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2729421285", "review_id": "2729421285", "date": "Mar 09, 2019", "rating": 3, "user_name": "Claire Fern", "user_url": "/user/show/14360467-claire-fern", "text": "This book is a nice read with a tenderness for family life but it is not great. It is not very well thought through and is very unbelievable in parts especially the end. Man and boy would be a good holiday book if you didn’t want challenging. It did not make me want to rush out and buy another of his books.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3426493194", "review_id": "3426493194", "date": "Jul 05, 2020", "rating": 4, "user_name": "Leslie", "user_url": "/user/show/11713761-leslie", "text": "This is a tough one to review, I’m so mad at the main character for screwing everything up on a whim, but he’s such a likeable character, and how he feels about his son is just so lovely! This is a really great reflection of society, times in the modern world, how easy it can be to ness everything up, but written with lots of humour and warmth. Really great writing!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3484220568", "review_id": "3484220568", "date": "Aug 07, 2020", "rating": 3, "user_name": "Samantha Collins", "user_url": "/user/show/91286044-samantha-collins", "text": "Do you know what, I enjoyed this book. Not my usual genre if I’m honest I’m more of a crime thriller type of girl and hate a chick flick love story and good job it wasn’t a chick flick love story it was more than that. It was touching and funny and made me want to hug my loved ones a bit tighter and I will. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3884859041", "review_id": "3884859041", "date": "Mar 13, 2021", "rating": 4, "user_name": "Fiona Black", "user_url": "/user/show/12872746-fiona-black", "text": "I don't always find out what a book is about before I start reading it. And in this case it was beneficial because it was not a story I would have chosen had I known. However Tony Parsons must be quite a good writer to make me finish the novel in 2 days, and want to know what happens next to the characters who I became rather fond of. A dash of humour, a tear or three...it was a good read.", "num_likes": 0, "sort_order": "default", "shelves": ["2021"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3873668837", "review_id": "3873668837", "date": "Mar 16, 2021", "rating": 2, "user_name": "Carl Miles", "user_url": "/user/show/125283908-carl-miles", "text": "An uninspiring novel. Lacklustre characters and stony cold narrative. Perhaps there was never any warmth to be had from a story of a man living his mistake. But the opportunity for the character to rise bigger, better, stronger than before, wasn't clearly taken and you felt that he was destined to continue floundering through life.I read it quickly and I'm glad I did.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4507212506", "review_id": "4507212506", "date": "Jan 26, 2022", "rating": 2, "user_name": "Ciorstaidh", "user_url": "/user/show/146046237-ciorstaidh", "text": "It could be that protagonist Harry is meant to serve as an example of the shamelessness and entitlement of men, a purposefully unlikable character that experiences a few meaningful life-revelations. However, I feel like it more just reads as a man playing victim, determined that there is nothing wrong with cheating on his wife. This book shows its age.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2196589060", "review_id": "2196589060", "date": "Nov 27, 2017", "rating": 4, "user_name": "Nhân", "user_url": "/user/show/68288075-nh-n", "text": "Found this book quite interesting last year, it's cute at somewhat level but it's also silly (about the man - Harry) at also somewhat level, probably straight men are just sometimes terrible at maturing haha. Anyway this is a cute one, I like stories so 4 stars for this book :D.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2404499802", "review_id": "2404499802", "date": "May 31, 2018", "rating": 4, "user_name": "Karen Anne", "user_url": "/user/show/74596719-karen-anne", "text": "quite a sad and moving story but beautifully written. i think the thing i liked most about this book was that is was so real and true to life and i could really relate to the characters and what they were going through. looking forward to reading more of tony parsons!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2517563035", "review_id": "2517563035", "date": "Sep 03, 2018", "rating": 2, "user_name": "Daniela", "user_url": "/user/show/5504088-daniela", "text": "There comes a time in your life when if the book seems bad, you have to realize there is no point in finishing it. Stopped at page 50. Ain’t nobody got time for that...To cliche and predictable for me to continue reading it.", "num_likes": 0, "sort_order": "default", "shelves": ["abandoned-gasp"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2524089078", "review_id": "2524089078", "date": "Sep 09, 2018", "rating": 2, "user_name": "Hnin Set Phyu ", "user_url": "/user/show/26008532-hnin-set-phyu", "text": "Didn't care about the characters or their fucked up love lives or thr writing, either. I didn't absolutely loathed it but I didn't enjoy it at all. At least, it reminds me that parenting is difficult and to be grateful to my parents for being the best parents they can be to us.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2282605590", "review_id": "2282605590", "date": "Oct 04, 2018", "rating": 1, "user_name": "Shraððhâ", "user_url": "/user/show/56833946-shra-h", "text": "Read it on your own risk.... You'll be wasting your time and it will not end the way you think it will. Cause the main character will never realise what the FUCK he did in the first place. I regret how did I end up picking this one.... Atrghhh", "num_likes": 0, "sort_order": "default", "shelves": ["books-i-own"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2581119706", "review_id": "2581119706", "date": "Nov 09, 2018", "rating": 4, "user_name": "Emma", "user_url": "/user/show/10494129-emma", "text": "My first time reading Tony Parsons and I wasn't disappointed. An interesting read, nothing ground breaking but interesting to read a book like this told from the males perspective. There is something most people could relate to in this book, I found the story about his Dad very poignant.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2679094016", "review_id": "2679094016", "date": "Jan 19, 2019", "rating": 2, "user_name": "Maria", "user_url": "/user/show/11477196-maria", "text": "I tried to read this book but I failed miserably. I do not know why but I did not like it at all. I think that there are some autobiographical elements, which I do not like. Or maybe I do not like a character who cheats on his wife.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2758744710", "review_id": "2758744710", "date": "Mar 21, 2019", "rating": 3, "user_name": "Neetha", "user_url": "/user/show/90649200-neetha", "text": "It depicts the real life story of a young man, his family life, the sudden turnovers happening in his life.. and ultimately how he (though unknowingly), transforms himselves into someone like his own father - his all time hero!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2971331136", "review_id": "2971331136", "date": "Sep 09, 2019", "rating": 4, "user_name": "Toma Renich", "user_url": "/user/show/12624154-toma-renich", "text": "Ages ago I found this book but stopped reading it somewhere in the middle because it seemed quite predictable if not absolutely boring. Years later I decided to give it another chance and loved it. So obviously own experience in single parenting did the trick :)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3112896208", "review_id": "3112896208", "date": "Jan 19, 2020", "rating": 4, "user_name": "Lama Abdel Barr", "user_url": "/user/show/5894390-lama-abdel-barr", "text": "Engaging, funny, and heart breaking. The painful - but often not discussed - day to day moments of getting through your messy 20s or your parents' divorce are explored with poignancy. As Observer's James Brown writes \"I cried five times and laughter out loud four.\"", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3217561474", "review_id": "3217561474", "date": "Mar 04, 2020", "rating": "", "user_name": "Michelle", "user_url": "/user/show/818371-michelle", "text": "It surprised me how much I really liked this book. It's great to see how one mistake doesn't ruin a life but creates new paths. Made me smile, giggle, cringe, and think about repercussions of decisions.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3220048972", "review_id": "3220048972", "date": "Apr 03, 2020", "rating": 3, "user_name": "Ericteur", "user_url": "/user/show/74540456-ericteur", "text": "A book with two faces, a happy and a sad face. The impact of a slip on three lifes is huge. The way that love turns to hate turns to ... is in your face. To let go of your son for the better, poh, that is something.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3351753869", "review_id": "3351753869", "date": "May 23, 2020", "rating": 5, "user_name": "Sunny Agnihotri", "user_url": "/user/show/101785580-sunny-agnihotri", "text": "Read many years ago on holiday and at the time absolutely loved it. Have moved on from this type of novel and not sure the five stars would be given today but at the time I remember it had a big impact on me.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3501103681", "review_id": "3501103681", "date": "Aug 17, 2020", "rating": 4, "user_name": "Sabunam Rai", "user_url": "/user/show/120040944-sabunam-rai", "text": "Not my usual read, but I enjoyed the gritty reality. It's not a 'they lived happily ever after' novel but you grow fond of each character and hope for a successful ending. The best part for me was getting to see how the lives of people intertwined. ", "num_likes": 0, "sort_order": "default", "shelves": ["contemporary"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3623290790", "review_id": "3623290790", "date": "Dec 04, 2020", "rating": 4, "user_name": "H Morgan", "user_url": "/user/show/106535728-h-morgan", "text": "Really enjoyed the style of writing and the story as a whole. I didn’t quite buy into the second relationship but it didn’t really matter as I did enjoy the various other relationships that are described. Would read another book by the same author. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3924225949", "review_id": "3924225949", "date": "Apr 03, 2021", "rating": 3, "user_name": "Rosa", "user_url": "/user/show/12478310-rosa", "text": "Account of a man who after adultery gets left by his wife with his son. He learns to care for a five year old, giving up his job for a part time. Later, he gives son back to wife for the sake of the son (if you love someone, let him go).", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4432763227", "review_id": "4432763227", "date": "Jan 01, 2022", "rating": 4, "user_name": "Kate De", "user_url": "/user/show/124037911-kate-de", "text": "A big redemption arc of a story. Harry only becomes self-aware of his own failings at the age of 30, which was pretty miserable to read. Some forced 'deep' moments, but based on the character of Harry, these weren't unrealistic. Still a good holiday read, with good pace.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2196225796", "review_id": "2196225796", "date": "Nov 30, 2017", "rating": 4, "user_name": "Lynzie", "user_url": "/user/show/65948743-lynzie", "text": "This book was beautifully written. However, I think the author gave the main character a little too much credit for being a dad, but overall I enjoyed it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2263335232", "review_id": "2263335232", "date": "Jan 24, 2018", "rating": 5, "user_name": "Neil Webb", "user_url": "/user/show/76575122-neil-webb", "text": "This was one of my favourite books, I laughed and cried and didn't want it to end.Loved reading about the flawed and relatable main character.Unfortunately coloured by the dreadful sequel.", "num_likes": 0, "sort_order": "default", "shelves": ["1999"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2322937055", "review_id": "2322937055", "date": "Mar 10, 2018", "rating": 1, "user_name": "Gowri N.", "user_url": "/user/show/3797803-gowri-n", "text": "A remorselessly dry narrative. A protagonist you not only don't like, but have to try hard not to dislike. And never-ending reams of self-pity. Tedium, tedium, tedium.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2302273149", "review_id": "2302273149", "date": "Mar 26, 2018", "rating": 2, "user_name": "Glenn Evans", "user_url": "/user/show/66019921-glenn-evans", "text": "2.5 stars", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2367149423", "review_id": "2367149423", "date": "Apr 20, 2018", "rating": 1, "user_name": "Dolly T", "user_url": "/user/show/81100020-dolly-t", "text": "The kind of book I hope I won't stumble upon again in the future. Uninspiring and dull.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1953338277", "review_id": "1953338277", "date": "May 14, 2018", "rating": 3, "user_name": "Nikki", "user_url": "/user/show/863429-nikki", "text": "Cute book about a boy being raised by his father.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1355738942", "review_id": "1355738942", "date": "Jun 05, 2018", "rating": 4, "user_name": "Dominic Neesam", "user_url": "/user/show/39894420-dominic-neesam", "text": "A novel which really builds into something very human. The major achievement being the gradual reinvention and indeed redemption of the main character and how he sees his place in the world. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2427922350", "review_id": "2427922350", "date": "Jun 22, 2018", "rating": 4, "user_name": "Doris", "user_url": "/user/show/10890534-doris", "text": "Well written book. Coincidentally I was reading it on Father’s Day weekend . That was fitting Because it’s about a father that really stepped up when necessary. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2441572755", "review_id": "2441572755", "date": "Jul 01, 2018", "rating": 4, "user_name": "Victoryenglert", "user_url": "/user/show/64278014-victoryenglert", "text": "an intense view into marriage life. The book emphasizes the importance of family and the strength we receive from family to overcome our problems in life. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2442227324", "review_id": "2442227324", "date": "Jul 01, 2018", "rating": 5, "user_name": "T. Bailey", "user_url": "/user/show/77664667-t-bailey", "text": "Another discover from wandering randomly...this time in a coffee shop that sold used books. Entertaining, honest, and very, very funny. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2480952671", "review_id": "2480952671", "date": "Aug 03, 2018", "rating": 3, "user_name": "Kirsti", "user_url": "/user/show/2898440-kirsti", "text": "This follows the familiar pattern of boy meets girl, boy messes up, boy loses girl, etc., with the addition of trying to single parent an adorable young child. Good beach read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2520874605", "review_id": "2520874605", "date": "Sep 06, 2018", "rating": 3, "user_name": "Adam", "user_url": "/user/show/44540454-adam", "text": "This books seems to have had some pretty severe criticism from some overly serious people. Let me just say this, sometimes it's nice not to think.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2573791592", "review_id": "2573791592", "date": "Oct 26, 2018", "rating": 5, "user_name": "Ellie Morland", "user_url": "/user/show/87480431-ellie-morland", "text": "Emotional read but so good! Puts the world to rights and completely relatable for child or adult. Loved it", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2582665075", "review_id": "2582665075", "date": "Nov 11, 2018", "rating": 2, "user_name": "Rhiannon", "user_url": "/user/show/21425543-rhiannon", "text": "extremely blah.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2595907363", "review_id": "2595907363", "date": "Nov 15, 2018", "rating": 3, "user_name": "Gilda", "user_url": "/user/show/34129666-gilda", "text": "It was a fast and easy read. Entertaining book but nothing too deep.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2636264236", "review_id": "2636264236", "date": "Dec 23, 2018", "rating": 3, "user_name": "Gerry", "user_url": "/user/show/54938609-gerry", "text": "Pretty slow moving--just an average book", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2705494613", "review_id": "2705494613", "date": "Feb 11, 2019", "rating": 4, "user_name": "Jules", "user_url": "/user/show/93224410-jules", "text": "Equally heartwarming as heartbreaking, full of laugh out loud moments as well as tears for all kinds of reasons. Raw and honest.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2673438142", "review_id": "2673438142", "date": "Feb 20, 2019", "rating": 2, "user_name": "Kitty", "user_url": "/user/show/38615178-kitty", "text": "I don’t know, I just feel as though the book was over hyped ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2768460331", "review_id": "2768460331", "date": "Apr 05, 2019", "rating": 5, "user_name": "Sinead", "user_url": "/user/show/28215551-sinead", "text": "A truly wonderful book. Already downloaded the sequel Man & wife", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2786576276", "review_id": "2786576276", "date": "Apr 14, 2019", "rating": 3, "user_name": "Melissa", "user_url": "/user/show/3113521-melissa", "text": "I enjoyed this book. It seemed so real and raw...basically like reading an everyday true story of mistakes and marriages and parenting.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2816572992", "review_id": "2816572992", "date": "May 10, 2019", "rating": 5, "user_name": "Gerty", "user_url": "/user/show/7932984-gerty", "text": "Book 28! And what an amazing book it is!! Must Read!!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2818316282", "review_id": "2818316282", "date": "May 18, 2019", "rating": 1, "user_name": "Cat", "user_url": "/user/show/17916660-cat", "text": "I've had a pretty fast and solid run with this book, all up until 100 pages where I finally realized that this... isn't doing it for me.Sry, Tony.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2833422639", "review_id": "2833422639", "date": "May 25, 2019", "rating": 1, "user_name": "Mouli", "user_url": "/user/show/20875863-mouli", "text": "Nnope. Stupid writing, lack of perspective, clichéd characterization. Dunno how this won awards. Would not recommend.", "num_likes": 0, "sort_order": "default", "shelves": ["half-read"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2849542465", "review_id": "2849542465", "date": "Jun 26, 2019", "rating": 3, "user_name": "Mark Rudd", "user_url": "/user/show/53237074-mark-rudd", "text": "A little predictable, I wouldn't recommend it.", "num_likes": 0, "sort_order": "default", "shelves": ["2019"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2950209703", "review_id": "2950209703", "date": "Aug 24, 2019", "rating": 2, "user_name": "Carolina", "user_url": "/user/show/22897311-carolina", "text": "What a drama! It could be acted in a movie by Hugh Grant...", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2976633906", "review_id": "2976633906", "date": "Sep 22, 2019", "rating": 5, "user_name": "Andy Fab", "user_url": "/user/show/102515844-andy-fab", "text": "Wonderful, heartwarming read", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2991775416", "review_id": "2991775416", "date": "Sep 26, 2019", "rating": 4, "user_name": "Lisa", "user_url": "/user/show/82300501-lisa", "text": "This made me so sad but I loved it", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3000124036", "review_id": "3000124036", "date": "Oct 03, 2019", "rating": 4, "user_name": "John Twamley", "user_url": "/user/show/93962951-john-twamley", "text": "Enjoyed this book, nice to hear a dad’s story ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3002064305", "review_id": "3002064305", "date": "Oct 05, 2019", "rating": 3, "user_name": "Erica", "user_url": "/user/show/3214079-erica", "text": "Quick and easy read. The storyline is like many others about relationships, just with the main character being male. Interesting read, but not very challenging/thought provoking. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3005095028", "review_id": "3005095028", "date": "Oct 10, 2019", "rating": 4, "user_name": "Karen", "user_url": "/user/show/8012552-karen", "text": "Really enjoyed this from about 1/4 way throughEasy to read, funny, sad and enjoyable ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3261699894", "review_id": "3261699894", "date": "Apr 03, 2020", "rating": 3, "user_name": "Karen Suhorsky", "user_url": "/user/show/76663728-karen-suhorsky", "text": "Good light hearted book not what I usually read but it was good. First book I have ever read of this author so I don't know if all his books are like this or not. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3308348609", "review_id": "3308348609", "date": "May 09, 2020", "rating": 1, "user_name": "ANGELA PRICE", "user_url": "/user/show/103113657-angela-price", "text": "Couldn’t finish it was so boring!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3330318179", "review_id": "3330318179", "date": "May 11, 2020", "rating": 2, "user_name": "RJC", "user_url": "/user/show/114769161-rjc", "text": "A custody battle, short time span/frame. Sexism of a single father, as his own father dies.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3335760725", "review_id": "3335760725", "date": "May 14, 2020", "rating": 3, "user_name": "Eva Smitt", "user_url": "/user/show/76644104-eva-smitt", "text": "Maybe my expectations were too high after I heard that this book was 'brilliant' and 'a tear jerker'. It's very well written and I enjoyed reading it, but that's it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3598432909", "review_id": "3598432909", "date": "Oct 16, 2020", "rating": 2, "user_name": "Katie", "user_url": "/user/show/99927012-katie", "text": "Not for me.", "num_likes": 0, "sort_order": "default", "shelves": ["eye-books"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3679150443", "review_id": "3679150443", "date": "Dec 10, 2020", "rating": 1, "user_name": "Neelima", "user_url": "/user/show/82820131-neelima", "text": "You can go without reading this one... Out-dated and really not as funny as the blurbs and quotes claim it to be", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3890790692", "review_id": "3890790692", "date": "Mar 16, 2021", "rating": 5, "user_name": "Martin", "user_url": "/user/show/38806903-martin", "text": "Loved it, expressive, moving, poignant but a happy ending, for all? Only time will tell or heal we are all led to believe.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3911789908", "review_id": "3911789908", "date": "Mar 30, 2021", "rating": 4, "user_name": "Ivy", "user_url": "/user/show/119235715-ivy", "text": "Good written, real and serious story about life and love. Heartbreaking and heartwarming with a hint of humor, this book will hold you until the end.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4043436465", "review_id": "4043436465", "date": "Jun 05, 2021", "rating": 1, "user_name": "Kriti Verma", "user_url": "/user/show/134872114-kriti-verma", "text": "Just don't read it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4047258992", "review_id": "4047258992", "date": "Jun 23, 2021", "rating": 2, "user_name": "Ellie Ricketts", "user_url": "/user/show/129615677-ellie-ricketts", "text": "A nice story but it made me feel quite sad throughout, so I was glad when there was a happy ending!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3872336725", "review_id": "3872336725", "date": "Jun 28, 2021", "rating": 4, "user_name": "Gary Cupitt", "user_url": "/user/show/129636513-gary-cupitt", "text": "Hold on, it's that tosspot Tony Parsons again. Surely he can't write another book that tugs at your heart strings. Yeah, he has though, great book from that Tosspot Tony parsons", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4117899184", "review_id": "4117899184", "date": "Aug 14, 2021", "rating": 5, "user_name": "Zorina Pachuau", "user_url": "/user/show/117410238-zorina-pachuau", "text": "What a good time of investment. Sad and funny plus a good life lesson for a relationship.. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4245892774", "review_id": "4245892774", "date": "Sep 19, 2021", "rating": 5, "user_name": "Maria Ivanova", "user_url": "/user/show/136352495-maria-ivanova", "text": "A deep and touching story, I recommend!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4073875435", "review_id": "4073875435", "date": "Sep 22, 2021", "rating": 3, "user_name": "Vasudeva Reddy", "user_url": "/user/show/36759958-vasudeva-reddy", "text": "It was good in bits and pieces, but not worth the hype around it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4297364665", "review_id": "4297364665", "date": "Oct 20, 2021", "rating": 1, "user_name": "Dinh Minh Anh", "user_url": "/user/show/141891679-dinh-minh-anh", "text": "It sucks!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4334834563", "review_id": "4334834563", "date": "Nov 16, 2021", "rating": 5, "user_name": "Sharlene Rowan", "user_url": "/user/show/91452919-sharlene-rowan", "text": "This was such a great story.i particularly enjoyed male narration and humour", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4310100001", "review_id": "4310100001", "date": "Dec 15, 2021", "rating": 4, "user_name": "Andreas", "user_url": "/user/show/7438648-andreas", "text": "Excellently written and very touching. I didn‘t like the events described and the main character very much - subject to personal taste only.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4405689035", "review_id": "4405689035", "date": "Dec 23, 2021", "rating": 4, "user_name": "Suzanne Ashworth", "user_url": "/user/show/12571588-suzanne-ashworth", "text": "enjoyable, realistic and quote touching take on modern fucked up lives", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4479996425", "review_id": "4479996425", "date": "Jan 16, 2022", "rating": 4, "user_name": "Mark ", "user_url": "/user/show/68710943-mark", "text": "Strong plot and well crafted insight into a relationship breakdown. Easy language to understand and some genuine funny moments. Plus some Sad onesInteresting glimpse back into the nineties ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4530094203", "review_id": "4530094203", "date": "Feb 18, 2022", "rating": 3, "user_name": "Olivia Graversen", "user_url": "/user/show/146142542-olivia-graversen", "text": "meh", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1826069270", "review_id": "1826069270", "date": "Nov 30, 2016", "rating": 1, "user_name": "Mr Newman", "user_url": "/user/show/62076205-mr-newman", "text": "\"if the MGF is about anything, it's abut fun\"At this point I stopped reading. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1995161700", "review_id": "1995161700", "date": "May 09, 2017", "rating": 3, "user_name": "Emily Church", "user_url": "/user/show/67616079-emily-church", "text": "The fact that the husband was portrayed as the victim was a bit off wasn't it but it was still incredibly touching. My dad recommended this and he said it made him cry a few times. It was incredibly touching but I haven't experienced the difficulties of marriage which would help for this book to be more impacting I guess", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2807914318", "review_id": "2807914318", "date": "May 03, 2019", "rating": 3, "user_name": "Yingfang", "user_url": "/user/show/53120064-yingfang", "text": "Everything so real, among grandpa, me and son. One impulsive night, wife gone, parenting son, accident, moving on, losing job, stepchildren, divorce fight, and letting the loved one go... light but emotional.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3507362085", "review_id": "3507362085", "date": "Aug 28, 2020", "rating": 3, "user_name": "Maryam", "user_url": "/user/show/9888573-maryam", "text": "Man & Boy was a good read, not excellent but good. Its real and raw. It’s a peak into a Man’s mind, his emotions and the bond between Father and Son.I’ve seen bad reviews on this and I get why, but I believe you can’t categorize this book as fiction (although it is)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3508742939", "review_id": "3508742939", "date": "Aug 22, 2020", "rating": 5, "user_name": "Paul Reid", "user_url": "/user/show/120263131-paul-reid", "text": "I read this book mainly on a train, and had to keep my emotions in. Which I found difficult.I think it’s more aimed at men and how they think in the main, buts that’s ok as I fell for it. Either way, I laughed and cried whilst commuting and this book keeps a special place in my heart.One to ultimately recommend as a simple, heartfelt book you can’t fail to love.", "num_likes": 0, "sort_order": "default", "shelves": ["favourite-books"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3018311358", "review_id": "3018311358", "date": "Oct 19, 2019", "rating": 2, "user_name": "Friya", "user_url": "/user/show/6478548-friya", "text": "If you like half-baked Richard Curtis movies, then this is for you. Otherwise, it’s just too dated. It seems that when it was written it was revolutionary for fathers to love their sons. These days you get Facebook posts about fatherhood that are more heartfelt and moving than this. I wish I hadn’t bothered. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3562442387", "review_id": "3562442387", "date": "Sep 23, 2020", "rating": 2, "user_name": "Abdullah", "user_url": "/user/show/121515175-abdullah", "text": "Tony never realized he was the reason the marriage broke. A girl who gave up her dream just to be with you! What more can you get. It pisses me off whenever he says \"you left first\" making it sound like Gina is sabotaging his effort to get things back to normal. Well, I think he made the right decision by letting Pat live with Gina.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/616769292", "review_id": "616769292", "date": "May 15, 2013", "rating": 4, "user_name": "Deepika Motah", "user_url": "/user/show/17251815-deepika-motah", "text": "I was going to give this book a 3-star as it is an adult book addressing issues that actually happens if one of the individual in a long-term relationship is facing mid-life crisis. The book started with (SPOILER AHEAD OBVIOUSLY)Harry Silver facing a mid-life crisis with the sinking feeling that he was becoming old and no one likes losing the freedom and wildness of youth as it is. But life happens; you marry the girl who you think was out of your league, you manage to stay with her for a long time, your parents love her and you even have a son. Your wife has given up her career to take care of your son and life is smooth. But when peeking closer, you see that the spark of romance & intimacy is veiled (not to say lost)by a series of responsibilities & other things. You love your wife, you love your son. You have a perfect life. But it is obviously no more the same. You don't get it. What happened? So yeah, after one really rough & fucked up day at work, you dropped that one pretty coworker who asked for a lift and thats it; you go upstairs for a drink and fuck around. One-night stand; thats the word.Everything changes from there. The wife (Gina) leaves and then comes Pat, their beloved son. The drama happening in between didnt really caught my attention at times as I was quickly bored.. But thats real life drama. Such things happen. Harry fucking around while still loving his wife and then later on regretting & realising that he did such a fucking stupid mistake is typical of many married men in their 30s. This book is actually a mature story with real life drama. When Harry & Gina were splitting up; Gina told Harry 'I love you but I'm not in love with you.'Harry goes like: \"You love me but you're not in love with me? Whats that supposed to mean?\"Gina replies: \"Love is what's left when being in love has gone, okay? It's when you care about someone and you hope they're happy but you're not under any illusions about them. Maybe that kind of love is not exciting and passionate and all those things fade with time. All those things that you're so keen on. But in the end, it's the only kind of love that really matters.\"So, the book goes on with Harry, broken and trying hard to fix things in his life. He already lost his job and eventually got another job later but along the way, he was having a hard time esp. in regards to Pat. It was beautiful to see Harry become wise. I really felt for him. During your 30s, you dont mature, you become wiser instead. And Harry did a good job in gradually learning how to take care of Pat. Life gets sweeter and complicated after meeting Cyd, an American woman with her daughter Peggy. The intense drama illustrates how grown ups can complicate things in a relationship when they act like a 20/25 year old man. At a certain age, love obviously does not remain the same; it evolves but it's still there. Getting used to routine is what possibly makes things dull, boring and no more exciting in the relationship. Honestly, at first I hated Harry for being a typical man but later, I discovered he was only human and was hurting so much. This made me realise that loneliness is so underrated. Everyone(including men) needs some loving; it's not always about shagging. :)Finally why I gave the book 4 stars is because the few last chapters really tore me. I felt my heart pinch, seriously. Harrys dad death and Harry handing Pat over to Gina. These 2 events changed my perspective on many things. Family; the one bond of love that will last in forever terms. Everything was beautifully told. During the funeral, Harrys mom chose this song (lyrics ahead):Someday,when im awfully low,when the world is cold,I will feel a glowJust thinking of you,And the way you looked tonight.And the most beautiful lesson to end: Harrys mom - But you have to learn to let go. That's part of it, isnt it?Harry - Part of what?Harrys mom - Part of what it means to love someone. To really love someone. If you love someone then you dont just see them as an extension of yourself. You don't just love them for what's in it for you.And Harrys good old mom then had tears shining in her blue eyes.\"Love means knowing when to let go\"This was my moment of contemplation. I cherished this part most of all.And, I was happy how the story ended. It kinda tells me that there's still hope and faith in humanity. God Bless; this story is wise, mature and packed with much emotions :)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2519906508", "review_id": "2519906508", "date": "Sep 05, 2018", "rating": 5, "user_name": "Lauren", "user_url": "/user/show/86353014-lauren", "text": "Amazing book! A must read, made me cry 3 times and laugh throughout the rest!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4023000317", "review_id": "4023000317", "date": "May 26, 2021", "rating": 1, "user_name": "Bertis", "user_url": "/user/show/117937713-bertis", "text": "Nick Hornby as re-imagined for Brexit voters.I think I first put this down soon after it came out; picked it up again this week and put it down even faster.This is an obnoxiously conservative and lazily written effort in which two things happen:1 - a TV producer, who cheats on his wife, loses his family and still doesn’t really get why in the end.2 - this same whining white male comes to terms with and ‘understands’ his Tory father.This is truly icky and I highly recommend it for the thrill of seeing someone none too deep examine his shallows. It gives a good insight into someone with little insight themselves.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1929280998", "review_id": "1929280998", "date": "Mar 09, 2017", "rating": 3, "user_name": "Daisy Van Lissum", "user_url": "/user/show/838566-daisy-van-lissum", "text": "I would have given four stars were it not for the sappy and predictable ending, it completely ruined my reading experience. \"Man and Boy\" is a beautiful and honest relay of a family falling apart and having to rebuild itself in a new configuration and paints a realistic picture of the core family in modern times of growing divorce rates. Funny and touching at once. Until the (rather forced) happy ending, that is.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2203240982", "review_id": "2203240982", "date": "Dec 03, 2017", "rating": 5, "user_name": "Seldina", "user_url": "/user/show/74563716-seldina", "text": "this is the most beautiful and warm book I have read. I cried and laughed by it and I have read it twice. recommend", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1172736156", "review_id": "1172736156", "date": "Jan 18, 2015", "rating": 5, "user_name": "Akram", "user_url": "/user/show/38057832-akram", "text": "Man and BoyThe book takes place in the late 90’s in London, England. A few months before his 30th birthday, Harry was living the American dream. He had a beautiful wife named Gina, a luxurious red MGF sports car that average men dreamt of having, he was a successful TV producer and had his own Live TV show and to top it all off he had an adorable 4 year old boy named Pat. Till now everything was perfect for Harry; he had everything a man wanted. Everything changed one night when Harry unknowingly abolished everything. One night on his TV show, they brought in a new guest and things didn’t go the way Harry and his staff wanted it to. This incident gave Harry a lot of work stress which eventually led to a one night stand between Harry and his co-worker Siobhan. This changed everything for Harry, Gina found out and decided to walk out on Harry leaving him with the 4 year old Pat. Gina shifted back to Japan in hopes to become a Bank Translator. It gets worse for Harry as he loses his job and becomes an unemployed single parent. Doing everything he can to raise Pat Harry has to deal with his wife’s divorce request and fight for the custody of Pat. When Gina returns from Japan, Harry and Gina agree that after Gina settles in Japan, Pat will be sent to live with his mother. Slowly everything comes together for Harry; he meets a new lady named Cyd and decided to marry her. He got a new job as TV producer for another company and managed his time between working and spending time with Pat. \tOne of the major themes represented within this book has to be the theme of love. It doesn’t have to be necessarily the love between man and women; in this case it’s father and son. I really enjoyed how the novel Man and Boy portrays this theme in a very detailed manner when Harry is left alone to take care of his Pat. The father son relationship grows as Harry does everything he can to raise his child. The author was very powerful while describing the setting and characters in the first few chapters. The amount of detail put in the novel made the readers experience the story firsthand. In my opinion a story that has a great description of the settings and characters establishes its greatness from the first few chapters. Man and Boy had curiosity in almost every chapter, as the reader I was excited, curious and stayed glued to my seat wanting to know what happened in the next page. \tAlthough there are a lot of positive influences in this novel, there are also negatives which shouldn’t be ignored such as the ending being very fairy tale like and fake; also events in this novel happened suddenly. Normally to average humans it would take them time to get into another relationship after divorce, however Harry met a new lady and got married within a few months of his break up. This book makes it out to seem that in reality there is always a happy ending. However sometimes things don’t end up in a fairy tale style ending. \tMan and Boy is a novel with a roller-coaster of emotions, describing feelings and mental thought process in an extraordinary way. The novel showcases the importance of strength within a relationship and the importance of a relationship. This novel appealed to me because of all the drama, romance and plot twists it had stored within it. The novel started of very boring and randomly took a twist making it very interesting. Personally I was satisfied with this book. If you are interested in a novel with romance, corruption, plot twists and drama, this novel will be a good read for you.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2220814706", "review_id": "2220814706", "date": "Dec 21, 2017", "rating": 3, "user_name": "Ieva Liepa", "user_url": "/user/show/70439976-ieva-liepa", "text": "Easy read. Sometimes that's what you need. Might also read another of his books", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2762002961", "review_id": "2762002961", "date": "Mar 24, 2019", "rating": 1, "user_name": "Sonja Marie", "user_url": "/user/show/90223046-sonja-marie", "text": "If I could give zero stars, I would. One of the worst books I ever had to read. I would have liked to read a story about a single father that defies traditional gender conceptions - but holy crap what a pile of sexist and racist poo this book is. Seriously, it wants the reader to relate to the dilemma of dating a single mom by referring to her child as \"the manifestation of another man's fuck\", i.e. the visible proof that she had sex with another man and that's bad because...it means he is not the sole owner of her body?! Also the protagonist can afford to quit his job to take care of his son full time and still have a comfy life. Very relatable. What is the point of this book?", "num_likes": 0, "sort_order": "default", "shelves": ["cringe", "dnf", "cliché", "sexist"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1927302811", "review_id": "1927302811", "date": "Feb 28, 2017", "rating": 2, "user_name": "Amy Lenarz", "user_url": "/user/show/5885659-amy-lenarz", "text": "Cute enough story, but it read like someone trolling for a movie deal. The ending in particular felt like deja vu to every 90s feel-good romantic comedy ever made. The dad isn't likeable enough to be a romantic lead, and he's not real enough to feel like a character in good literature.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3696723709", "review_id": "3696723709", "date": "Dec 15, 2020", "rating": 4, "user_name": "Meenakshi", "user_url": "/user/show/100509438-meenakshi", "text": "This book was a good read and I read it in a day because it compelled me enough to not stop. However, it wasn't anything fantastic. It was about a man who cheats on his wife and raises his son for a bit while his wife goes to Japan since that was always her dream and the man was the one who she dropped the dream for. The man is a piece of shit but since its from his POV, I never found myself thinking he was a POS and instead I was rooting for him throughout. Writing this out, I can see how usually the wife's character would be the good choice for the MC but I still enjoyed the book. Ultimately, he doesnt realize his mistake at the end of the book but is decent enough to do right by his son. I like these kind of books where the setting is completely ordinary and I am in a character's mind throughout. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1894174244", "review_id": "1894174244", "date": "Feb 20, 2017", "rating": 4, "user_name": "Cat Parker", "user_url": "/user/show/41463903-cat-parker", "text": "Man and boy is a story about love, life and loss. Harry Silver seems to have it all until one night when an error in judgment costs him his \"perfect\" life. He finds himself separated from his wife, jobless and looking after his son, Pat. This change in circumstances forces Harry to re-evaluate his parenting, his views on love and what it is he really wants from life. The story is well written, realistic and refreshing.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/252357219", "review_id": "252357219", "date": "Dec 28, 2011", "rating": 3, "user_name": "Raz", "user_url": "/user/show/6125695-raz", "text": "[Some spoilers, but very early in the book and also discussed in the book's own blurb.]Man and Boy is a book about relationships, love, and the difficulties when your life doesn't quite go to plan. I think I would place this book in a genre of 'emotional' writing that deals with life events that happen to a lot of people (marriage, break ups, children, death, family). Despite the main character, Harry, being male, I do think this book is predominantly aimed at a female audience. That's not to say that all women will enjoy it, or that all men wouldn't, but I feel that this genre of writing is seen as more female-oriented. The main relationships in the story are those between Harry and his father, a fairly traditional man who is tough (his tattoos are constantly mentioned), and between Harry and his young son Pat. I found that these two relationships were very well-written, emotive, and touching stories. I found that my main problems with the book came when Harry's relationships with women were discussed. His marriage breaks down early on and his wife moves to Japan. I felt that the descriptions of this felt like exactly what they were: a precursor to the author's desire to describe the father-son relationship and have a little tug on our heartstrings. I think this is why Harry's brief encounter with a colleague and his wife's discovery of it seem to cover so few pages; this seems strange in a book that deals with emotional/traumatic life events. I did not particularly enjoy this part of the book, although perhaps both Gina and Harry's actions would be more familiar and empathetic to readers who had their own children, especially if arguments surrounding custody were involved.Overall I found that the bits that really did make me cry & laugh (as the blurb/reviews promised) were the parts nearer the end between Harry and his father, perhaps because I can see parts of my own relationships with my dad/grandad in the text. A quick read (I steamed through it in about 4 hours cover to cover), but still enjoyable and emotive. I think the book achieved what it set out to do.", "num_likes": 0, "sort_order": "default", "shelves": ["romance"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/978599599", "review_id": "978599599", "date": "Jun 26, 2014", "rating": 4, "user_name": "John Read", "user_url": "/user/show/7371582-john-read", "text": "I've always been a fan of kitchen sink dramas: aka. 'Saturday Night & Sunday Morning.' 'Cathy Come Home.' A Taste Of Honey.' 'Look Back In Anger.' etc, I like the gritty social realism. I've also been a long time fan of writer Tony Parsons. He has that same earthy, 'call a spade a bloody spade' quality that is missing from too much of our modern air kissing Z list celebrity world. So when I saw his book, 'Man And Boy' in my local Acorns charity shop for £1 it was a no brainer. It is the best £1 I've spent in a long time - apart from seeing that the book is fifteen years old ! Surely not ?But it has aged well and didn't let me down. His descriptions of family life and growing up in the 60s in working class England is my world. Sadly, the adult mess that unfolds is the modern world personified. Wanting it all, never realising that what you have in your hand is the happinness you dreamed of as a kid. Losing site of the real world and chasing the greener grass that doesn't existThis book is funny, sad, touching, melancholy, bitter. All human life on the page.Tony Parsons has an all seeing eye that recognises the human condition and writes it into a page turner of a book. I would have given it 5 stars but there is just a little too much bad language for my own taste. I suppose that too is the modern world.In the past year, my own writing has been compared to Dickens (really) Dahl and C.S.Lewis I'd be extremely happy if one day someone compared me to Tony Parsons.Highly recommended.... if you haven't read it fifteen years ago.NB. Many years ago I had cause to write to Tony Parsons after something he'd written in his newspaper column. (I can't even remember what.) Several weeks later I got a charming hand written reply on a holiday postcard. It looked as though he'd interrupted his holiday to respond to a stranger. How many 'celebs' would do that ? He talks the talk and walks the walk. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2800504987", "review_id": "2800504987", "date": "Apr 27, 2019", "rating": 4, "user_name": "Thomas", "user_url": "/user/show/86483654-thomas", "text": "For me this book was a thoroughly great read and I just didn't want to put it down until it was finished. Well written and engaging, there were so many poignant moments but in addition, there was a scattering of laugh-out-loud parts too. The story around his father's funeral and the realisations it brought out in Harry were superb and highly in touch with reality - so many readers will be able to identify with such an unfortunate and inevitable part of life. The journey he goes through with his young son which ultimately leads his unselfish decision to allow his ex-wife full residency was highly touching and this will resonate strongly with any fathers out there, especially ones with broken families.There is a kind a sadness associated with the book around the fact that modern life seems to be so tolerant of married couples giving up on each other, with children often being the main victims as a result. It may seem obvious but if couples were able to see the negative impact brought upon children from separation, surely they would think twice about having them in the first place - at least until they are reasonably sure they are able to make a life together first.Harry does succumb to adultery in the form of a one night stand at the start of the book - an action which might automatically cause the reader to believe that he deserves everything he gets. However it is pretty much impossible to maintain such a feeling as we unravel his character through the story. His moral and often unselfish behaviour on multiple occasions is highly admirable. This is also supported by the fact that his wife Gina really did seem to be looking for any excuse to get away from things and live her own life.In summary, a highly enjoyable but also important read for anyone who might be considering giving up on their family. Furthermore, well worth reading for couples who have not yet brought children into the world.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1884388947", "review_id": "1884388947", "date": "Jan 18, 2017", "rating": 3, "user_name": "Hannah Polley", "user_url": "/user/show/33809991-hannah-polley", "text": "This book centres around Harry Silver, a man who married and had a baby too young, and as he approaches 30, he starts to wonder what he is missing in life. His life is perfect as it is but he manages to mess it up in one night when he has a one night stand and his lovely wife finds out and leaves him. This is the beginning of the book and it certainly did not make me warm to the main character. I cannot stand men who have a midlife crisis and need to fill their lives with something else, plus 30 is way too young for this self pitying nonsense! Also, Harry never considered that his wife might be unhappy looking after their son everyday and giving up her career. However, when Harry's wife leaves him is where the book really comes into its own. As Harry's wife heads to Japan to try and regain the life she lost, Harry is suddenly left as a single father with not much of a clue as to how to do this. This section of the book was my favourite and I loved reading the developing bond between Harry and his son. When Gina (Harry's wife) comes back four months later, I was a bit annoyed with her as she is the one who left, however, Harry's attitude began to annoy me again. Gina did all this stuff for 5 years until Harry messed it up, Harry then looks after Pat for 4 months and reckons he makes a better parent? However, Harry pulls this back by willingly giving custody to Gina and although I didn't think he would deserve it, a little bit of me was hoping for a Gina and Harry reunion! I struggled to buy into the romance between Harry and Cyd and didn't like that they ended up together.As a side story, Harry's lovely dad develops lung cancer and passes away. This was very moving and incredibly sad and I would have liked the book to have focused on it more. ", "num_likes": 0, "sort_order": "default", "shelves": ["fiction", "tony-parsons", "parenthood"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1654331077", "review_id": "1654331077", "date": "May 31, 2016", "rating": 2, "user_name": "Corey", "user_url": "/user/show/3699250-corey", "text": "I really didn’t enjoy this book very much. It’s now over a month since I finished it and I can’t remember many details. Cynically, about the only thing I remember thinking is that this just seemed to me like a man jumping on the chick lit bandwagon. I couldn’t get away from the feeling that this book was the equivalent of a man borrowing his friend’s puppy to pick up women in the park – as if the author felt that there’s a lot of money to be made in that genre and it surely can’t be that hard. Or even that he made a bet with a friend that he could write a proper chick lit book from the perspective of a single dad and have all the women swooning and empathizing with him – as though to prove that women as a demographic are that simple to manipulate.That aside, assuming this author’s intentions were innocent, this book did not make much of an impression. It had a very simple rom com plot and set of characters and very few saving graces. To summarize for myself… the main character is nearing 30 and has been married for quite a while to a woman who had wanted to be a Japanese translator. They have a very cute son together. The man works for a shock-jock type TV talk show. He inexplicably sleeps with a co-worker and causes his marriage to fall apart. His wife, who had (resentfully) carried the brunt of the child-rearing responsibilities, goes off to Japan to see whether she can revive her career. The father becomes the primary parent in his son’s life and it, of course, changes him. Meanwhile he meets an American manic pixie dream girl who is waiting tables and has some very sassy one-liners. Blah…", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1918011133", "review_id": "1918011133", "date": "Feb 19, 2017", "rating": 5, "user_name": "Lucy", "user_url": "/user/show/52425876-lucy", "text": "Superb read. Sensitive and emotional. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/74305758", "review_id": "74305758", "date": "Oct 12, 2009", "rating": 3, "user_name": "Jessica", "user_url": "/user/show/139334-jessica", "text": "I don't know what it says about this book, or me for that matter, but I had utterly forgotten I'd read this until I was halfway through the second go. That said, this time I was reading it from a different place. The first time I read it, I was single. Now I'm the age of the protagonist and his wife when they split up. Not only that, but I've been with Jeff just as long and kiddo is the age of their son.The second time through, knowing what I do now, I had far less sympathy for the protagonist. I found myself rooting for his wife as she headed off to Japan to pursue the career she had forgone for her husband and baby, and again when the couple gets into a custody battle. Over and over, the narrator reminds the reader that this mother had put her career before her family for four months -- and I found myself responding, \"But the dad put his career first for four years!\" I also found myself rooting for the narrator's girlfriend as she set restrictive rules about their relationship to protect her daughter (also the same age as kiddo).All along, I had been rooting for the mothers in the story -- but when the narrator ultimately relinquishes his custody battle to allow his son to be with his mother, I cried. So in that way, the book got to me.I'll also give this book credit for bringing home an important theme -- the toll divorce takes on kids and their parents -- albeit in a rather heavy-handed way.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/57467961", "review_id": "57467961", "date": "May 27, 2009", "rating": 2, "user_name": "siti rahmah", "user_url": "/user/show/2357927-siti-rahmah", "text": "Curiosity is the reason why I choose to read this book. Everything is looking up to Harry Silver – he has a beautiful wife, a young son and a great career, so why did he let it all go? or more appropriately HOW can he let it all go? It is very disappointing to read later that the reason being was him having a premature mid-life crisis (his solution is to go out and buy that red-two-seater sports car!) and indulged in a one night stand with a new colleague. At that moment, I just felt like putting the book down and stop there. If it is about infidelity, regrets and wallowing in self-pity then I just don’t want to know.But as I continue reading the book, it became clear that Harry ‘grew up’ (though in my opinion in a passive way) and learn more about parenting, about being a son to his loving and supporting parents, and about love. . . if you really love that someone, you need to know when to let it go and when not to let it slip away.It has a happy ending, but as I try to put myself in Harry’s shoe, I can’t help but to wonder if he would make another silly mistake once his new life gets too monotonous or too complicated? Will he still question about life not being perfect all the time? After all, he is too much a romantic at heart to sometimes be realistic.The book is easy to read. And it felt real. But I didn't like it so much. You probably will like it anyway.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/11847590", "review_id": "11847590", "date": "Jan 06, 2008", "rating": 4, "user_name": "Nilam Fitriah", "user_url": "/user/show/239241-nilam-fitriah", "text": "It tells us that a marriage is just not 'i love you, you love me, let's stay together with a commitment.' There is time when love is not the reason to keep a marriage, and when we are not sure we can find that reason, it's better to not too rush. That's true, marriage is not about love, but live together and commited to each other.There are 3 statements i noticed:-'I knew women cut her hairs to symbolize sth important, but i don't remember what it is.' I think it's right! I don't even realize that i often cut my hair when i need a new spirit and wanna releave because of sth.-i like this part:'how you can move on after losing Dad? I mean, you always with'm. I hardly imagine what does it feel to fill that great hole.''you won't be recovered, of course you won'. I miss'm. I'm alone. Sometimes i was afraid. And i still have to sleep with the ligt on. But you must learn to release. That is the risk, isn't it?''what risk?''risk to love someone. Really love. If you love someone, you not look at them just as your part. You don't love'm for your sake. Love means know when is the time to release the one you love'What a wise..-and this part that successfully touched me:'i proud that you're my son' when he release his son to live with his ex-wife.", "num_likes": 0, "sort_order": "default", "shelves": ["romance"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/136012559", "review_id": "136012559", "date": "Dec 21, 2010", "rating": 3, "user_name": "Alisha", "user_url": "/user/show/4037717-alisha", "text": "To start off with this seemed like an interesting enough book, man screws up, woman leaves, he’s left to care for his young son.It was a nice easy read, although nothing that special that I would defiantly remember in say a couple of years time, some people compare it a lot to Kramer vs. Kramer, although I haven’t seen the film other reviews say it copies it an awful lot which I am a little disappointed in, If you are to write a book you should do it on a completely original idea that you have thought of yourself. A review on the front cover states ‘I cried five times and laughed out loud four’ was a complete understatement, I didn’t cry nor even come close, it was sad when the granddad did die although it wasn’t written in such a way it would make that much of an effect on me, as for the laughing out loud, well a couple of smirks at times but I didn’t feel it was as funny as some make it out to be.On a lighter note, I did like the way Parsons described and wrote about Pat in quite a cute way, although he seemed like a very advanced 4 year old lol, I also enjoyed the relationship between Harry and Cyd. To be fair the ending was a bit of a let down, there was some suspense and it practically led to what, a hug?", "num_likes": 0, "sort_order": "default", "shelves": ["books-i-own"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/206069171", "review_id": "206069171", "date": "Sep 07, 2011", "rating": 3, "user_name": "Ian", "user_url": "/user/show/3652044-ian", "text": "I used to enjoy Tony Parson's often coruscating funny writing in the NME in the punk and post-punk era, so I was looking forward to reading this novel. It was an engaging tale based around 30 year old Harry, who after being caught playing away from home finds himself all at sea as a single parent to his 4 year old son after his wife walks out on them.I enjoyed it, often finding it funny although in a much more gentle Richard Curtis sort of way, related to the era and the cultural references and some of the father son conundrums in a post separation world. But it was all a bit too cute and I can't say it really tugged at my heartstrings that much, because since the plot was so, so similar to the US film Kramer v Kramer, there wasn't much mystery as to the eventual outcome. There were also strident echoes of Four Weddings and a Funeral with Harry and Cyd interchangeable in my head with Hugh and Andie. On a more personal note my West Highland Terrier bitch was called Cyd before this novel was written, and just like Hugh's American love interest she was named in honour of Cyd Charisse, so can I have some of the royalties please Tony? RIP Cyd.....sniff. Someone pass me the tissues.", "num_likes": 0, "sort_order": "default", "shelves": ["modern-novel", "family-relationships", "funny", "a-kindle"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/522518217", "review_id": "522518217", "date": "Jan 31, 2013", "rating": 2, "user_name": "Stevedutch", "user_url": "/user/show/17001694-stevedutch", "text": "After finishing this particular slice of banality I wondered why I’d bothered to waste these precious few hours of my life on a coming of age saga that failed to shed any light, whatsoever, on the mysteries of human experience. Moreover, the experience wasn’t entertaining but simply downright depressing. I suppose, Parsons wasn’t out to produce great literature but simply to cash in on the seeming market for what might be regarded as just another stage in the evolution of the realist novel, a la Bridget Jones. Whatever his motivation and indeed inspiration he appears to have successfully produced a barely diverting saga in which the protagonist, the son of Baby Boomers who missed the Boom, recounts the sorry consequences of a ‘night on the tiles’; ‘rush of blood to the head’; ‘moment of madness’ – pick your own cliché – that causes him finally to grow up, face his parental responsibilities and be a man like his dear old ‘salt of the Earth’, Diamond Geezer’ dad. The reader is left wondering, however, if his dad should have paid more attention to his own parental responsibilities rather than popping round the pub on a Friday night ‘cos he deserves his drink’ and stayed home, more often, to give his son the ‘right royal’ slappings he so obviously missed!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/577651117", "review_id": "577651117", "date": "Apr 01, 2013", "rating": 1, "user_name": "Marie", "user_url": "/user/show/5889446-marie", "text": "Sentimental drivel is the phrase that comes to mind but I might be being a Little hard?Easy Reading, killed the book in a couple of evenings which is why I finished it rather than throwing it out. Why was the book not for me, well first the main cahracter is a man who decides to have a min midlife crisis at thirty. Oh for gods sake says the over 45 year old. Second the wife he cheats on is a stay at home wife who states at that she hates how working mothers treat her. As a working mother I Think they have a good Point.The third area that irritated me was how quickly both fell into relationships with other people, After only four months after a seven year marriage. They deserve all the misery they bring on themselves if they can't have a decent mourning period for thier marriage. Then the man realises his Deep love for his Child, great wonderful, but wasn't this all done by Dustin Hoffman in Kramer vs Kramer? Finally after leaving in Sweden for so long I find it incomprehensible that the UK still has such antiquated views on Child 'right to residence' ie who gets the kid. Is it really still 90% going to the mother with only visiting rights every other weekend? Bloody antiquated.Don't read unless you fancy ove emotional chewing gum experience.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/779655236", "review_id": "779655236", "date": "Dec 03, 2013", "rating": 4, "user_name": "Charles Perfecto", "user_url": "/user/show/25142968-charles-perfecto", "text": "Parsons wrote this book from a point of view of a man. I think Parsons want the readers to realize that even you already have everything you wanted, it is not permanent. Maybe you spent years and years to have all of that but you can lose it all with just a blink of an eye. Knowing and appreciate what you have isn't always enough. You have to know how to keep them. This story is about a messed up man, a messed up husband, and a messed up father and how he learned the real meaning of life and love the hard way. Just to talk about broken marriage is too painful. Too painful for the husband, too painful for the wife but most painful for their child. It hurts that when you do something good, it's seldom remembered but when you had a mistake, you can lose everyone and everything. Maybe everyone deserves a second chance but not everyone gets a second chance. This story is about a messed up man, a messed up husband, and a messed up father and how he learned the real meaning of life and love the hard way. It's a good book and it's well written. It will make you sad and happy at the same time. It will surely touch your heart. At the end, it will make you realize how little things are so important and what life and love are all about. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/891502322", "review_id": "891502322", "date": "Mar 25, 2014", "rating": 5, "user_name": "Sarah Obsesses over Books & Cookies", "user_url": "/user/show/2070861-sarah-obsesses-over-books-cookies", "text": "It's not often I am able to browse a bookstore for the sheer purpose of finding a book. I go through all these rituals of checking reviews and reading sample chapters so i don't feel like i am wasting time or money on a book. To just walk and look at titles and pick something and look at it just as it is is a huge gamble of the literary sorts. But that's how I came across Tony Parsons book Man and Boy and I'm so happy I did. A plain looking book with just shoes, a mans and boys shoes and a couple of blurbs were enough to make me want to risk using the rest of my gift card and hope for the best. 2 days later and I'm in love in the same way I loved Nick Hornby's British style of writing in the domestic issues from a man's POV. I love these books - life like stories with hints of humour throughout. I liked Harry Silver. He's flawed (of course) but the story goes and is edited in just the write places not droning on too much and not skipping too much either. It's about making a crappy stupid mistake and then moving on but also dealing with the aftermath. It's a chick lit/dick lit read that I am happily moving on to the 2nd in the series (yay!! so happy there was a follow up)carry on, readers, carry on. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/50123262", "review_id": "50123262", "date": "Mar 22, 2009", "rating": 3, "user_name": "Louise", "user_url": "/user/show/2143983-louise", "text": "For a \"first\" novel by this author, I thought he did a pretty good job. A 30 year old man has a one night, one time stand and throws his marriage away. He suddenly finds himself trying to raise his 4 year old son on his own and soon discovers it's not as easy as it looks!From the dust jacket: \"Harry Silver has it all: a beautiful wife, a wonderful son, a great job in the media-but in one night he throws it all away.Just yesterday Harry gave himself a shiny red sports car for his thirtieth birthday. Today he faces the baffling questions of a suddenly single dad:* How do you wash a four-year old's hair?* Should he eat green spaghetti forbreakfast?* What do you tell his Mommy from theemergency room phone?In this poignant and witty novel, Harry has to bring up his child alone, look after this parents, work out his relationships and hold down a job.As millions of women have discovered before him, that is not as simple as it may have seemed.Man and Boy is by turns funny, sharp, warm and heart-wrenching. It is a brilliantly engaging novel from one of the most gifted and influential commentators writing today.\"", "num_likes": 0, "sort_order": "default", "shelves": ["fiction"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/300496826", "review_id": "300496826", "date": "Mar 25, 2012", "rating": 4, "user_name": "Fuka-chan", "user_url": "/user/show/5333518-fuka-chan", "text": "This book has every cliché that you could think of. Tell me, wedding runaway, the run for a flight catch, an annoying and irresponsible father, stupid mistake, happy ending for everyone, everything. For someone who decided not to ever read a popular book based on everyone’s recommendation because it was “so nice and touching”, surprisingly I enjoyed the book. I was thinking of rolling my eyes every time something predictable happened. Well surprise surprise. I didn’t. It was a nice touch without being overly annoying. Cliché cliché. But why people keeps coming back to cliché? Why the summer romance movies that showed such a predictable ending ever have a big hit? Personally, I think sometimes, we need a bit of a happy ending ourselves. We need that assurance that happy ending is still there, still achievable, although it seems like that was impossible these days. So many heartbreaks and tears. Anyway! I don’t know why I have bought this book for so long (close to two years I think) and never read it. Maybe it was because this book is so commonly seen in every bookstores I have ever been to. Well now I know that a book is a best seller for a reason! ;)", "num_likes": 0, "sort_order": "default", "shelves": ["book-challenge"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/461294952", "review_id": "461294952", "date": "Nov 22, 2012", "rating": 4, "user_name": "Allison Renner", "user_url": "/user/show/4911840-allison-renner", "text": "Harry Silver is on the verge of his thirtieth birthday, and is having a bit of a breakdown. He married young, and now has a four-year-old son with his wife. He works long hours as a television producer, which gives him even less time to be with his family. After making a wrong move, Harry finds himself raising his son alone while his wife tries to follow the dreams she gave up when they first married. The writing is so well-done that you're sucked into the story immediately, even if there is a slight lack of emotion when it comes to Harry's relationships with women. His relationships with his son and parents are extremely vivid, however, and they make up for his passive romantic relationships.     It's an amazing book and I'm excited to read the next two in the trilogy. The trilogy is: Man and Boy, Man and Wife, and Men From the Boys. I say this because if you want to read the trilogy, do NOT look it up on Goodreads. If you're like me, your eyes will scan the blurbs and you'll know spoilers about what happens in book two that kind of messes up your reading of book one.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/65860649", "review_id": "65860649", "date": "Aug 02, 2009", "rating": 5, "user_name": "Yee Mey", "user_url": "/user/show/2070993-yee-mey", "text": "I really enjoyed the book and cannot wait to read the sequel, Man and Wife. Parsons does such a great job telling the story of Harry Silver who, for all his faults, has the redeeming quality of loving someone honestly and completely ie, his son. What I liked from following Harry's journey between his wife leaving him and his realization of what love means, is how easily the story moves along. Through the simplicity of language and plot, sincere and honest emotions really shine through, which is why this book really works for me. It's also worth noting that Man and Boy isn't just about the relationship between Harry and his son, but also between Harry and his dad. His acute observations of how families and parental roles change, and how relationships evolve are very spot-on. To quote from the back of the book, \"A finely constructed novel that says more about human relationships than a library of psychology manuals, hitting the funny bone and the emotional jugular at one and the same time.\" (Irish Times)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/197999154", "review_id": "197999154", "date": "Aug 13, 2011", "rating": 4, "user_name": "Mitchell Waldman", "user_url": "/user/show/6026309-mitchell-waldman", "text": "This is a wonderful, can't-put-it-down till the end book, in which the author, with great humor, tenderness, and humanness, describes the break up of a relationship, the role the father takes in raising his child, and all that happens afterwards. It's a story, in part, about a father's role as parent, and, to some extent, the injustices in a system that assumes the mother is the parent of choice in custody matters. However, this is really not the main thrust of the story. It's simply a story about a man who loves his son, who is devoted to raising him, and the love between them and the trials that follow as he attempts to raise his son as a single parent. Extraordinary (yes, slightly sentimental, innocent, and touching -- but when did all that, with all our culture's current cynicism -- become a bad thing?) Very touching and very much recommended. (Nick Hornby-esque, for sure).    __________________________________________________________________________________________________________ ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/518418327", "review_id": "518418327", "date": "Jan 27, 2013", "rating": 5, "user_name": "Serena Liu", "user_url": "/user/show/14526739-serena-liu", "text": "I got this book from a friend of mine. I wasn’t expecting anything after seeing quite a few negative reviews and rating here and on Amazon, but it turned out to be really good. I did cry a few times. If anyone only reads a few pages and decides to give it up, my suggestion will be -- It’s worth reading it to the end. Especially, after knowing the story was mostly based on Tony Parsons’s personal life experience, it really touched me a lot. As I've experienced living with a single parent family (I'm from a core family, but have rent a room living in a single parent house) and having some single-parent friends, I've seen and can understand the struggles between the children and the parents. I feel sad this modern society has changed a lot that divorce becomes so easy and the young children are always the victim of their parents' divorce. Before thinking about the divorce, have the two adults ever thought about what is the best for their children? Have they ever thought about how badly it hurts their children's little hearts and affects their future relationships?", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/790882289", "review_id": "790882289", "date": "Dec 15, 2013", "rating": 4, "user_name": "Ainur", "user_url": "/user/show/8967827-ainur", "text": "the title said it all. man and boy. a story of a man and his son and his father. a journey of the main character, Harry as his life change from a career guy to a single father who has to look after his son. along the way he saw the responsibility, the job, the work his father had done raising him up, being the hero in his family, being the saviour, the protector, the man in the family. he tried so hard to be like his father, but he knew he can never be like one. i love the way the writer wrote the good relationship that Harry had with his father. i love guy who has a good relationship with his parents, especially with his dad. though they are very different characters, while the father is more bold, braver, the one who can do it all, Harry is more like the guy who is learning, the guy who is adopting to the father's world, a timid one i assumed. a story of a family, two different worlds, different generations. a beautiful reading, a perfect story. 'love means knowing when to let go.'", "num_likes": 0, "sort_order": "default", "shelves": ["contemporary", "2013-read", "4-fucking-awesome-stars"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/833861950", "review_id": "833861950", "date": "Jan 25, 2014", "rating": 5, "user_name": "Aisyah Samuin", "user_url": "/user/show/1727856-aisyah-samuin", "text": "I love writing a review right after finishing a book. I literally had just turned over the last page a few minutes ago. With a content sigh. :)I don't know. Maybe I'm just like the main man in this book. That's why I love it so much. Always the romantic. Always beating ourselves for things that we are not able to do. But always trying our best to redeem the shortcomings. Yeah, maybe that's why I love Harry.He ain't much. I even tsked tsked at him initially for doing what he did that causes his marriage to fall to pieces. But I sort of understand how that could happen.This book gave me a warm, fussy feeling. It's a bit similar to The Nanny's Diaries with less heartbreak and frustration.A caption I really like from the book:\"If u love someone then you don't just see them as an extension of yourself. You don't just love them for what's in it for you. Love means knowing when to let go.\"An overall feel good book. For those who love a good happy ending, I recommend this!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/75704838", "review_id": "75704838", "date": "Oct 25, 2009", "rating": 3, "user_name": "Elisabeth", "user_url": "/user/show/635721-elisabeth", "text": "I purchased Man and Boy at Waverly Railway Station while waiting for my train to London. Seven years later I finally got around to reading it. Man and Boy is an entertaining and easy read, making it a perfect book for traveling. The book chronicles the unraveling and reconstruction of Harry Silver's life after his third-life crisis in which he, a once career-minded family man, becomes a single father in the course of one day. The novel focuses on the post-nuclear family in the era of divorce, what it means to become a man/adult, and what it means to love. Neither Harry nor the novel reaches any new, unexplored conclusions about life, love, maturity, sacrifice, and life. But then I again this book is on my \"books to real while traveling list.\" What I like most about Parson's writing are his pithy endings to sections and chapters. He has mastered the art of using a single sentence to capture life in all its complex brutality and beauty. ", "num_likes": 0, "sort_order": "default", "shelves": ["books-to-read-while-traveling"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/100718746", "review_id": "100718746", "date": "Apr 30, 2010", "rating": 1, "user_name": "chucklesthescot", "user_url": "/user/show/3426724-chucklesthescot", "text": "Harry has a great job,adoring wife and young child.Then one night it all goes wrong.The host on the talk show he produces attacks a guest,Harry has a one night stand with a girl who works on the show,and his raging wife walks out on him after seeing a message on his mobile phone.Harry faces a fight to try and win his wife back but when she decides to start a new life in Japan,it is his son that he is now fighting for. Oh poor woe-is-me Harry,failing to understand why his beloved wife won't give him another chance as it was 'just one night'-I felt no sympathy at all for his whining as he slowly loses everything.Should've kept your trousers on then shouldn't you buddy!A slow moving and not very interesting account of the single dad trying to get by without his wife there to do everything for him.One dimensional characters,very little of interest-didn't finish it and won't be reading any more by this author.", "num_likes": 0, "sort_order": "default", "shelves": ["abandoned", "contemporary", "fiction"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/119069847", "review_id": "119069847", "date": "Aug 28, 2010", "rating": 3, "user_name": "M", "user_url": "/user/show/13167-m", "text": "A begrudging 3 stars for ultimately having keen insight, while the writing being a cross between Nick Hornby and Jonathan Tropper yet more the latter than the former.The storyline is nothing special - man married too young, hits thirty and freaks out, has one night stand that effectively ruins his life as his wife leaves and now he has to take care of his son only to then stand to lose him in a later custody battle.The turn of events calls into question the man (Harry?)'s emotional immaturity and desire for things he cannot have, lack of interest in that which he does have, and overall romantic and unrealistic expectations. It touches on a lot of the intricacies of love and relationships quite nicely.That being said, the dialog is super immature and forced. The lines are fed one character to the other, the characters say and do such unbearably stupid things, the book reads more like a bad sitcom than real life, all the while trying to develop real life themes.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/290285558", "review_id": "290285558", "date": "Mar 07, 2012", "rating": 5, "user_name": "✿ Deni", "user_url": "/user/show/2959849-deni", "text": "This book came as a surprise for me, as it's the kind of book I would have never bought; I got it from a friend who was getting rid of most of her things and she gave me many books.What I loved about this book is that it shows a different point of view to parenthood: normally it's always the mother who fights to keep her children with her when the father goes away. This case is totally different, as it's the mother who actually goes away (because the father cheated on her) and leaves the kid with his dad.I liked the way Harry (the dad) changed his life to accommodate his child's needs, which he wasn't that interested in before and how it showed us that (some) men are also sensitive and it's not only women who love and want to be with their children.It has been compared to About a Boy, but I haven't read it so I can't say anything about that.", "num_likes": 0, "sort_order": "default", "shelves": ["2012"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/380947406", "review_id": "380947406", "date": "Jul 31, 2012", "rating": 4, "user_name": "Rosemary", "user_url": "/user/show/4635525-rosemary", "text": "Tony Parson's \"Man and Boy\" is a fantastic novel about a young British tv executive whose life is turned upside down when his young, unhappy wife runs off to Japan to find herself, leaving him in charge of their four-year-old son, Pat. Harry, our narrator, loses his job shortly after a brief affair at work, and suddenly finds himself an unemployed, single dad. Other great characters in the novel are Harry's parents, particularly his father. Harry himself is a very flawed, complex character, but he is ultimately redeemed by his unconditional love for his son, Pat. Man and Boy is a great novel that really prompts a whole series of questions - is Harry selfish? Naive? Did Harry's idyllic upbringing lead him to expect too much from his wife Gina? Would Harry's marriage to Gina have been stronger if he had not been so enraptured by his parents' traditional lifestyle? Harry certainly loves his beloved Pat to pieces, but is Harry really a good father? Read it and see! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/947666602", "review_id": "947666602", "date": "May 25, 2014", "rating": 3, "user_name": "Mradula", "user_url": "/user/show/10700203-mradula", "text": "Life is all about growing up: growing up as a kid, growing up as an adult, growing up as a child, growing up as a parent, and eventually, growing up as a human. An average guy's not-so-average life revolves around one theme - his family. The everyday challenges you face, which otherwise go unnoticed, have been beautifully crafted out in this book by Tony Parsons.What makes you connect instantly with the narrative is its pace and simplicity. It's a light read with a dash of humor about how a perfect life can go awry.Though some events and characters get predictive, the story doesn't fade out. What stands out in this book is the detailed expression of the human emotional turmoil; however, it isn't something I'd recommend you to read if you are depressed or lonely. It'll just be a little too much for you.Nevertheless, it's worth giving a shot to appreciate and value the blessings and perils of leading an ever-demanding life", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1717126878", "review_id": "1717126878", "date": "Aug 02, 2016", "rating": 3, "user_name": "Natasha Hinkson", "user_url": "/user/show/25583279-natasha-hinkson", "text": "Basically a chick flick on paper, with a male protagonist. Don't expect any real depth or for the book to make you do any soul searching. However something about the writers style really engaged me. Apart from his witty one-liners and likable characters he managed to bring true emotion to life through the characters. The description of Harry's feelings after his father's death and especially when he went to the viewing of the body really touched me as the author managed to superbly capture how I myself felt in similar circumstances. Th struggle we saw little Pat go through, being too young to fully comprehend what his parents were going through but emotionally smart enough to know it was significant was also incredibly real. I have to admit that despite the simplistic storyline and predictable end, I did enjoy this read at a time when I just wanted something entertaining and easy to pass time. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/67038272", "review_id": "67038272", "date": "Aug 11, 2009", "rating": 4, "user_name": "Beejay", "user_url": "/user/show/1054578-beejay", "text": "While it doesn't stack up to Tony Parson's beautifully tender \"One For My Baby\", this book, \"Man and Boy\" is an excellent conversation about dealing with loss, longing and re-evaluation of life's priorities. The main character, Harry, is so well drawn that he feels familiar: you are sure you know him, and his parents; or perhaps he was the guy who dated your second cousin for a while and you chatted to him at the Christmas Party 3 years ago; or maybe he was the guy you spent 4 hours talking to on a flight to Hong Kong; or did you live next to him when you were a student? You just feel that you know him, if only you could place where you know him from. It's an easy book to read, and I'm sure will particularly appeal to parents of young children because of the beautiful way Harry expresses his feelings towards his son, Pat. Recommended.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/137708825", "review_id": "137708825", "date": "Jan 01, 2011", "rating": 3, "user_name": "Natalia Pì", "user_url": "/user/show/4560712-natalia-p", "text": "A pleasant surprise and a very bittersweet read. I appreciated more than I thought I would.It's the story of how a father - left by his wife after he cheated on her on a one night stand - has to suddenly learn how to be a good father for his 4-year-old son. From washing his hair to taking him to the park, to cooking healthy food for him, and have the boy actually eat it.It was a quick read, and I loved the characters. It's a bittersweet book about relationships, about fathers, about growing up and finding a direction in your life. The final part is soberly tragic, it had me hold my breath while reading, because I could relate, and because of how well the writer could convey the way one feels in certain moments in their life. Touching, but not melodramatic, so, beautiful.I recommend it: it's a good, intelligent, entertaining and heartening read :)", "num_likes": 0, "sort_order": "default", "shelves": ["uk"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/154269354", "review_id": "154269354", "date": "Mar 14, 2011", "rating": 4, "user_name": "Joe Stamber", "user_url": "/user/show/4900418-joe-stamber", "text": "Tony Parsons writes in a style that makes it seem like a friend is telling you about their experiences. Everything about his style makes his books incredibly easy to read. So much of what he writes sounds familiar, almost as if he knows the reader and is recounting an event from his past. As Harry, the main character, stumbles through his life, trying to raise his young son and looking for happiness round every corner, the reader will smile, laugh and perhaps shed a tear or two. Parsons doesn't try to be funny, this isn't like the many books filed under \"humour\" that fall flat through trying too hard. Instead, he just tells his tale and the reader can't help smiling and occasionally laughing. He does the other end of the spectrum too, and hits the nail on the head so well that anyone who has had similar experiences can't help but brush away a tear. Excellent stuff.", "num_likes": 0, "sort_order": "default", "shelves": ["read-2010s"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/171896171", "review_id": "171896171", "date": "May 28, 2011", "rating": 3, "user_name": "Hunny", "user_url": "/user/show/4928211-hunny", "text": "It's about a man and boy. The character of Harry (the man) I'm enjoy reading this book from page to page and lessons I could get from this book. It's more or less like a novel story but at the same time full of values, advice and the enrichment of life. The lessons learned from this book. The relationships between Harry and his dad, which makes a different on how they'd survived and lived in different era. The relationships between Harry and his son, lives in a broken marriage of his farther and mother. Thus, to live separately. The relationships between the son (Pat) with the grandfather (Harry's dad). But then, it is not about relationship, but also family issues. Full of the emotion of \"man\", though. I think the man themselves should read this book - to know the truth what is in them as a matter-of-factly. ", "num_likes": 0, "sort_order": "default", "shelves": ["on-shelf", "2011-marathon"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/936969195", "review_id": "936969195", "date": "May 14, 2014", "rating": 4, "user_name": "Faye", "user_url": "/user/show/31379935-faye", "text": "After deciding that I needed a brief break from horror fiction, I decided to take a chance on what I presumed to be diluted male chick-lit that exists solely for the purpose of making grown women cry. But I was pleasantly surprised by 'Man And Boy', mainly because it taught me a lot about my own emotions in regards to my personal life which almost mirrors Harry Silver's in parts. Tony Parsons perfectly captures the difficulty of a relationship breakdown, parenthood, new romance and the taking on of a partner's child from a previous marriage with remarkable ease and flair.The last thing I expect from a fiction book is self-help and the ability for me to understand myself better but, for the first time ever, I got that from 'Man And Boy'. A very rewarding and personal reading experience for me.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1568808822", "review_id": "1568808822", "date": "Mar 04, 2016", "rating": 3, "user_name": "Anna Dorywalska", "user_url": "/user/show/14136038-anna-dorywalska", "text": "A very solid three starts, bordering on four.Great writing style. I cried, I laughed, I worried what's going to happen next and wondered what I'd had done if I was Harry (or Gina, or Cyd, or Pat).Harry is a cheater, worried son, carrying farther and loving man. He's had it all and suddenly lost it (did he?), and is now trying to adapt to the new reality. None of what happens is revolutionary, but it's beautiful and true, and I didn't need more. It's a story about love and choices one has to make for the sake of it. It's a story relevant to those building a family and those who (for whatever reason) needed to start from scratch. I can think of so many moments when, while reading a paragraph, I shouted out loud 'that's exactly how I feel!'. And that's what made it so good - anyone who reads this book will at least once shout 'I get it!'.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2470303330", "review_id": "2470303330", "date": "Jul 27, 2018", "rating": 5, "user_name": "Steve", "user_url": "/user/show/33814375-steve", "text": " A Modern MasterpieceOk let's get one thing straight out there, yes its a Kramer Vs Kramer rip off and he knows it he even reference the film in the book, but is that a bad thing? absolutely not as Parson gives it a new spin and I would say makes it better.At the heart of the story for me ‘Man and Boy’ is really about three men, two fathers and two sons. Harry himself his Dad and Harry son Pat this is the story of how Harry comes to terms with his life and learns self-respect, bringing up his son alone and, gradually, learning what words like love and family really mean.This is a must-read it made me laugh out loud and brought tears to my eyes on more than one occasion. Parsons gives you a reality jolt and a subtle reminder not to take anything for granted because in the blink of an eye you could lose it all. Well worth your time and hard-earned cash.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/2714206967", "review_id": "2714206967", "date": "Feb 13, 2019", "rating": 2, "user_name": "Henrik Uherkovich", "user_url": "/user/show/93532189-henrik-uherkovich", "text": "Average Joe has a beautiful, smart and somewhat shallow trophy wife, then goes for a ONS with a colleague - trophy wife is not amused, leaves husband and son and finds a position in Japan, where she starts an affair with a married schmock - whilst Average Joe has to take care of his 4 year old son, and his terminally ill dad, besides loosing his job.... Average Joe then finds a married lady from Texas, living separated from her husband and mother of sons friend from school.... Average Joe and Texas lady have occasional sex, then Texas Lady decides to go back to her husband only to finally end up in the arms of Average Joe, who in the meantime decided to give back custody of son to trophy wife who's employer in Japan had to lay off the foreigners... a feelgood book for a summer vacation at the beach, but not much more", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/10121214", "review_id": "10121214", "date": "Dec 07, 2007", "rating": 4, "user_name": "Darin", "user_url": "/user/show/668075-darin", "text": "I was reading Nick Hornby's \"About A Boy\" when a stranger with an English accent approached me and said that this book was better. While both novels tackle similar themes, it is difficult for me to choose which is better. Hornby's book is about a character who does not want a child or any people involved in his life, but learns to adjust without trying or wanting to try. In Parson's novel, the main character is a father and not necessarily the most active family member. When certain circumstances create more responsibilities for him, he learns what is truly important to him. Instead of being about a single, secluded person (\"About A Boy\"), \"Mand And Boy\" is about a man who needs to be reminded of some of life's lessons.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/26890768", "review_id": "26890768", "date": "Jul 10, 2008", "rating": 5, "user_name": "Robert", "user_url": "/user/show/317979-robert", "text": "There was no personal recommendation for this one. I just found it on the library shelf and it stood out. I guess that's a win for the marketers. I studied up on it after I's already started reading it. I was startled to read the comparisons between this book and About a Boy by Nick Hornby. In fact, most called Man and Boy  the better book. I don't know which is the better book, but I truly enjoyed this one. It's well written and a great read. With Gilead a few weeks ago, it makes two books in the month about fathers and sons and both make me think of my own father and I. This one also made me think of my daughter and I, too.It's an honest book about divorce and death and I could relate.", "num_likes": 0, "sort_order": "default", "shelves": ["wouldreadagain"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/72158581", "review_id": "72158581", "date": "Sep 22, 2009", "rating": 4, "user_name": "Julie", "user_url": "/user/show/615542-julie", "text": "This funny, touching book set in England centers on Harry Silver, who upon reaching his thirtieth birthday finds his life turned upside down by losing his wife and his job, and is threatened with the possibility of losing his son as well. The whole crisis is precipitated by his entering into a one night stand with one of his co-workers. His wife promptly leaves him and heads to Japan to follow her dreams and he is charged with the sole care of his four year old son, Pat. The book focuses on his growth as a parent, his relationship with his own parents, and his journey into realizing that a mature relationship goes further than romance, and only gets more complicated as families split up and try to remake themselves the best they can. Parsons has been compared to Nick Hornby. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/196140976", "review_id": "196140976", "date": "Aug 08, 2011", "rating": "", "user_name": "Jenna Walker", "user_url": "/user/show/5831468-jenna-walker", "text": "This was a good book but for a while I was thinking 'whats the point of this' There were some really well written areas and some areas that were not so well written. And many typos and grammar mistakes. I loved the characters. There we some reviews i read that i didnt agree with. One was that they didnt feel sorry for the main character but honestly i dont think you were supposed to. He was supposed to be growing not asking for sympathy. There were times when i laughed out loud and times when i was very sad. So overall this was a very emotional book and it was very fun to read. I dont think it will be on any school reading lists anytime soon but it was still fun to read and i would keep it and perhaps read it again one day.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/240797123", "review_id": "240797123", "date": "Nov 28, 2011", "rating": 4, "user_name": "Iva", "user_url": "/user/show/1837720-iva", "text": "This is a nice book about learning the value of something in the moment when you lose it and having to build your life from scratch and knowing that you've got no one to blame because it's all your fault. It is interesting because it is from a man's point of view and also a single father's and if you read between the lines you can see a bit of criticism for Britain society on the topics of adultery, divorce, single parenting, battles for custody etc. I like the book because I think it's realistic nor positive nor negative and the characters are very \"alive\" they sound like the real people you could meet tomorrow on your way to work. This book could have easily slip into a melodramatic soap opera/TV movie kind of thing but it didn't and thank God for that.", "num_likes": 0, "sort_order": "default", "shelves": ["own"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/264953180", "review_id": "264953180", "date": "Jan 20, 2012", "rating": 3, "user_name": "Judith Lewis", "user_url": "/user/show/6758199-judith-lewis", "text": "Lightweight, perfectly enjoyable little book, that is a sort of Kramer v Kramer or book equivalent of a Richard Curtis film. Although the main character is a man, it does feel more like a girly book. I'm not sure that the female protagonist [girlfriend, not the wife] is entirely believable - there are too many inconsistencies in her, e.g. she has certain standards, but then employs an entirely inadequate child-minder with no apparent guilt or concern. And the main character's father is treated with a certain amount of idealism and even sentimentality, a harking back to an earlier and better time in history. I doubt if I will read it again, but would be happy to read another Tony Parsons, especially if I needed something lightweight and heart-warming while under the weather in future.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1061956311", "review_id": "1061956311", "date": "Sep 22, 2014", "rating": 5, "user_name": "Courtney", "user_url": "/user/show/13112569-courtney", "text": "This book. wow. not the usual book i'd go for but I don't really know if you can put this book into a genre. I picked this up randomly and turned to the first page and all I can see was the word fuck repeatedly and knew I had to buy it and what a purchase. I thoroughly enjoyed this book. The swearing for one, Harry did not hold back. The views of Harry were impeccably similar to my own, I could relate to this character in a cynical way. The choice of words, sentences, quotes spoken by each character just really helped to build up the story. the plot of the story was unordinary in which I liked, it helped me to view the situation in different ways and to empathise with the main character. I understood things in a way I wouldn't before. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1126643397", "review_id": "1126643397", "date": "Dec 08, 2014", "rating": 3, "user_name": "Shannon", "user_url": "/user/show/3297545-shannon", "text": "In my mind this story was about two things, infidelity and child custody. I thought the author did a fabulous job of showing the progression of Harry moving from the role of “traditional” Dad (while Mom stayed home and took care of young Pat) into the role of primary caregiver (when Mom took off for Japan). There was discovery, difficulty and great tenderness in the transition, and I saw the truth of it. On the other hand, I was very disappointed at the representation of the subject of infidelity. If men wander as easily as was presented and when the resulting chips fall, have as little self-reflection and self-accountability as Harry did, I just don’t know what to say about it. I sincerely hope it represents only a tiny fraction of men. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3598906", "review_id": "3598906", "date": "Jul 26, 2007", "rating": 3, "user_name": "Jane", "user_url": "/user/show/221760-jane", "text": "\"Part of what it means to love someone. To really love someone. If you love someone then you dont just see them as an extension of yourself. You don't just love them for what's in it for you.\"\"Love means knowing when to let go\"Aren't they just one of the most cliche saying?Well, it was until I read this book that I thought these saying could actually mean something. Parson puts these saying in a non cheesy context.You may get annoyed by the main character then again you think I know quite a few people that are like that.Which makes this story more real.I would say that this book is an enjoyable read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/167618477", "review_id": "167618477", "date": "May 12, 2011", "rating": 2, "user_name": "Pete daPixie", "user_url": "/user/show/1779598-pete-dapixie", "text": "Well for one thing this fiction stuff is not really my genre. It's quite a few years back since I read the book. I just pulled it off the library shelf...must have been depressed or something.However, my recollection tells me that this was a quick easy going read. I thought it was a quite well written story, which as Tony Parsons is a professional journalist in the ranks of the British press corps, he should be on top of his game with fictional writing.So...MAN is married with small child, living in Larrndon. He plays away from home, marriage breaks, job crashes, so he is left alone with BOY.Don't let this review put you off reading the book. It's just not my cup of meat.", "num_likes": 0, "sort_order": "default", "shelves": ["fiction", "20thc-english"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/172243992", "review_id": "172243992", "date": "May 30, 2011", "rating": 3, "user_name": "Mega", "user_url": "/user/show/5535064-mega", "text": "A simple and heart warming story about a man who did one wrong and his well life suddenly broken into pieces. He lost his wife, his job, and had to make a deal to take care his son all by himself, and how he met his other love. Though it is interesting, this book has a predictable ending and the story are somehow familiar. Yet, the chemistry between The Man (Harry) and The Boy (Harry's son) and also Harry and his father are touching. Enough to shed my tears. Well, this book taught lessons about family, relationship, and how we have to consider first about the risks before we act, before it's too late to fix it up.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/180257815", "review_id": "180257815", "date": "Jun 28, 2011", "rating": 3, "user_name": "Kieko Keikohss", "user_url": "/user/show/5272557-kieko-keikohss", "text": "it is brilliant of Parsons to bring out such a great story. in fact, this story really related to nowadays kind of relationships. i hate it when Gina couldn't forgive Harry's fault. but, to think out of it, i might do the same thing as Gina had done. i really can't understand what in Pat's mind? maybe because i don't have this kind of situation when i was growing up. but deeply inside of me i want this story that the real parents stay together at the end and care for their own child and live together forever. but, Cyd might the one for Harry. anyway, this book is worth buying for, and i didn't regret that i've gone through all the words that printed out. :) ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/821702936", "review_id": "821702936", "date": "Jan 12, 2014", "rating": "", "user_name": "Julia", "user_url": "/user/show/4989196-julia", "text": "For some reason, the main character drove me nuts. I think it was a combination of his immaturity (which was needed for the plot, so that's just my problem) and his insistence that \"blood\" makes the difference for how you feel about a child... when anyone could see that the differences he kept seeing/experiencing were from having the child from birth vs. meeting the child later.I feel like this is a book that I should have truly enjoyed (and certainly I did enjoy parts of it), but I couldn't get around the above issues.I did already check the sequel out of the library, so I may give it a go anyway.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/872615410", "review_id": "872615410", "date": "Mar 05, 2014", "rating": 4, "user_name": "Inna Zaichenko", "user_url": "/user/show/17300657-inna-zaichenko", "text": "The book touches the heart-breaking changes in the society, where family values are dying out. Why? Just because couples no longer fight for their mutual happiness. It's way easier to cheat, leave, indulge into some religion and then end up it all together. Who suffers? Children, who learn to be emotional diplomats.Three generations. One stemming from another. The apples might be alike, but the orchard has changed.With the idea coming from the man's mind, reading becomes even more gratifying. It's all put in a less fluffy, and more matter-of-fact manner. Great balance of actions and musings. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/916371390", "review_id": "916371390", "date": "Apr 21, 2014", "rating": 4, "user_name": "Céline", "user_url": "/user/show/11816520-c-line", "text": "I found it very easy to get caught up in this lovely story and enjoyed having a man's point of view on raising a child and going through divorce. It raises questions that all of us have already asked ourselves at some point in our life: will this relationship go the distance? I am really happy in this relationship? How can my mariage be a success when it seems that most mariages fail nowadays? Do I give in to temptation? How do I live up to my parents' seemingly perfect relationship? Am I making the most out of life or am I missing out on something? ...It was also nice to read a story set in the 90s as it brought me back to my childhood. I very much enjoyed it :-)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/964918869", "review_id": "964918869", "date": "Jun 11, 2014", "rating": 3, "user_name": "Lia", "user_url": "/user/show/29553190-lia", "text": "It was good. I even experienced a love-hate relationship with harry silver. I hated him with burning soul when he slept with another woman. I felt glad that he was so depressed after gina left. I was on gina's side. But then I got all sympathetic once his father got sick and dying. I hate him again knowing that he got cyd after all. I seriously want harry to have a sad life since he betrayed his wife. But aside from the fact that I hate the main character's gut, this novel really speaks real life. The dialogue is natural, the ups and downs are smooth; the kind you have in real life. After all, I cried and burned in rage when reading this piece of parsons. It's a good emotional novel", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1027664769", "review_id": "1027664769", "date": "Aug 15, 2014", "rating": 3, "user_name": "Diya", "user_url": "/user/show/25023708-diya", "text": "For some reason I simply couldn't relate to the protagonist in this story. Perhaps because he is male? A father? An adulterer? There were points in the book where I was downright frustrated with this character. Not only does he cheat on his wife, he then whines about how she treats him because of his infidelity. That being said the last few pages of the book were beautifully written. Tony Parsons does have a way with his words. While I wouldn't go so far as to say that I \"cried five times and laughed out loud four\", Parsons does depict beautifully a son's adulation of his father and a father's adoration of his son.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1338539474", "review_id": "1338539474", "date": "Jul 18, 2015", "rating": 1, "user_name": "Cha", "user_url": "/user/show/9163571-cha", "text": "Something I could get out of a poorly-written soap -- Boring, predictable, trying hard to be funny, lacking prose or even some form of contemporary tone you'd find in a Coupland.. I couldnt believe it is / was a best seller (or maybe for the reasons that it was boring, predictable and trying hard that made it to that kind of list). BUT Id be lying if I'd say the emotion between father and son was totally unrepresented.. Somehow there's that tinge of genuine writing in that aspect. But the storyline of the grandfather-father relationship? could might as well been taken from some better-written Mitch Albom book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1413078912", "review_id": "1413078912", "date": "Oct 10, 2015", "rating": 3, "user_name": "Jill Holliday", "user_url": "/user/show/15893981-jill-holliday", "text": "This was very much an impulse buy when I realised that I'd be sitting around for a while at an appointment this week so bought the first book that appealed to me from the adjoining secondhand bookshop. The main character, Harry, is engaging and the whole story is from his perspective. All of the characters are portrayed sympathetically, though I did feel that the females lacked depth. As we engaged in Harry's impressions of them rather than their own thoughts that did seem okay. I felt that the relationships between Harry, his father and his son were perceptive, sometimes funny and very touching. It was skillfully written and a smooth read. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1508573898", "review_id": "1508573898", "date": "Jan 13, 2016", "rating": 4, "user_name": "Nick Davies", "user_url": "/user/show/51454575-nick-davies", "text": "Really enjoyable. I don't think I'd read any Tony Parsons before, but was aware of him and his books from adverts I'd seen and from him appearing on 'Newsnight Review'. Barely fifty pages into this book I could already tell that he would be a writer I would enjoy - the right mix of intelligent comments on life as a bloke, wit and humour, and characters which rang true and which the reader would care about. This one also hit the nail on the head with regards the storyline - though not something I was going through at the time, the sort of \"What if?\" questions and challenges which most blokes worry about at some point. Excellent.", "num_likes": 0, "sort_order": "default", "shelves": ["2007-and-previous"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1893057232", "review_id": "1893057232", "date": "Jan 28, 2017", "rating": 5, "user_name": "Laraine", "user_url": "/user/show/7445887-laraine", "text": "This is such a wonderful book. I'd rate it a 4 1/2-5 star read. My friend lent me her copy with a strong recommendation and I have to say I loved it. I laughed out loud, I cried, I enjoyed every page. This is the story of Harry, a wonderboy tv producer who has it all...perfect wife, perfect child, perfect life. Until he screws up and loses it all. But what he finds is hard fought for but wonderful. Harry's evolution from part time father to full time Dad is hard but so meaningful. I was delighted to find that this is the first book in a trilogy and can't wait to find out what happens next. A great read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4343269", "review_id": "4343269", "date": "Aug 09, 2007", "rating": 4, "user_name": "Lincoln", "user_url": "/user/show/102196-lincoln", "text": "I thought this was a good book. Well written, believable, if a little bit predictable, but still enjoyable and, for me, thought-provoking. And stirring. The scenes with the father at the end of the book were very moving to me.The main thought: that there are men out there that aren't the best father that they can be, but they are the best father that they have to be, b/c the mother is there.A second main point: that as you get older, get married, settle into a career, have children, your options narrow, is the way I think it was put. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/42880826", "review_id": "42880826", "date": "Jan 13, 2009", "rating": 1, "user_name": "Courtney Williams", "user_url": "/user/show/1842160-courtney-williams", "text": "The main character was so unsympathetic I gave up after a chapter or two.I had a wonderful life, then I randomly had an affair so my wife left me - I screwed up my job as well. Now I have to look after myself and the child I had an equal hand in creating. POOR ME. (Also my wife is totally at fault yu gaiz.)-- definitely an actual quote from the bookHowever much a character grows, if they start off believing rubbish like that, I probably won't stick around long. Too many other non-ragequittable books to read.", "num_likes": 0, "sort_order": "default", "shelves": ["bbc-big-read", "rage-quit"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/99851075", "review_id": "99851075", "date": "Apr 24, 2010", "rating": 4, "user_name": "Zillah", "user_url": "/user/show/3430722-zillah", "text": "l would rate it 4 and 1/2 * actually!l read it about a year ago, and l remember it took me such a short time to finish it.. parsons' writing style is very comprehensible, without big words and phrases and yet everything is said!unlike many other books (and esp series these days) that talk about women raising children on their own, this one leads us into the world of a man left to pick up the pieces of his life after his wife leaves him and their child..beautiful book that will make you laugh, feel sad and maybe even shed a few tears..", "num_likes": 0, "sort_order": "default", "shelves": ["books-l-own"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/188764309", "review_id": "188764309", "date": "Jul 24, 2011", "rating": 4, "user_name": "Jayne Charles", "user_url": "/user/show/5862079-jayne-charles", "text": "An amusing, unchallenging read. Rare to find such a 'touchy feely' book written by a man. Of all the relationships depicted in the novel, the one I found the most 'real' and the one that brought a genuine lump to the throat was the one between the central character Harry and his father. Superb characterisation. On the other hand, I found Harry's wife's family harder to swallow - how come she was so different from them? All in all an enjoyable read, though, one I would recommend. I'll definitely read the follow-up one day.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/204276321", "review_id": "204276321", "date": "Sep 01, 2011", "rating": 3, "user_name": "Maria", "user_url": "/user/show/5869732-maria", "text": "This book was an easy read, but I found it to be a little unrealistic. I don't know many mothers who would leave their son and go across the globe to another country, in pursuit of their career, only to return later and demmand that he now lives solely with her and not his dad. Also, the fact that the dad gave the son up with no hesitation. And that the mom (Gina) expected him to give up Pat and let him live in Japan, therefore Pat never getting to see his father. The book was OK, but nothing I would reach for again.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/221934195", "review_id": "221934195", "date": "Oct 11, 2011", "rating": 4, "user_name": "Sean McVeigh", "user_url": "/user/show/6614796-sean-mcveigh", "text": "Not my normal genre, but I really enjoyed this frank portrayal of life and all that follows from a moments lust. Some simply stunning descriptions and reflections. One that brings a lump to my throat, is when the lead character states we try to protect are children from harm, wrapping them in cotton wool from all of the nastiness in the world. Then without a thought the person who harms them the most is me, a lustful father, who rips his son's world apart. Men, the next time you feel lustful, think on and read this book!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/430566899", "review_id": "430566899", "date": "Oct 08, 2012", "rating": 3, "user_name": "Harmonie", "user_url": "/user/show/12181243-harmonie", "text": "It always pains me to see happy marriage/relationships break apart because of the slight moment of giving in to temptations. When reading the book, I can't say I blame Gina even the slightest of their broken marriage. As the story continues to Man and Wife, I'm starting to see I was right. Harry was a confused 30 year old and always with the urge to seek more of something new and exciting as well as risky. But I can't say I \"loved\" this trilogy, it just simply taught me a lesson in life: Family is everything.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/650945276", "review_id": "650945276", "date": "Jun 25, 2013", "rating": 3, "user_name": "Cynthia  Sanders", "user_url": "/user/show/17252019-cynthia-sanders", "text": "This was a quick read, and I enjoyed watching the father mature in this & other relationships. The boy was portrayed as heart broken, though I wonder if the impact on him would have been greater. I did not feel that the mother's characterization was addressed much or what kind or relation she had w the boy that she could leave him. But the main purpose was accomplished. The father and how he met each situation was very well done. Although it was heart-warming in places, I think the ending was somewhat cliche.", "num_likes": 0, "sort_order": "default", "shelves": ["love-stories"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/671613145", "review_id": "671613145", "date": "Jul 19, 2013", "rating": 5, "user_name": "Judit", "user_url": "/user/show/22263346-judit", "text": "This book surprised me. I don't remember why I had bought it (in the old no e-book times), what had caught my attention about it. But I do remember that it put such thoughts into words that were same as mine just never occured to me to speak it out loud. I also liked to get into a man's mind. How Harry lived through his divorce... His emotions and raw honesty. I liked it.It's not heavy weight literature but not even lightweight. It's in the entertaining but still meaningful middle. Do not miss it:)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/682860994", "review_id": "682860994", "date": "Jul 31, 2013", "rating": 2, "user_name": "Gill Winter", "user_url": "/user/show/10918716-gill-winter", "text": "Was a bit disappointed with this one as I had high hopes. Having read About a boy this book just lacked luster for me, I was surprised it was written by the same author to be honest. Nothing really inspiring or revealing the only part that resonated was the death of his father but other than that I couldn't really empathise or connect with his character, as a few have commented after Kramer vs Kramer this book really doesn't hold any water. Ok story & writing but not on a par with his other works I'm afraid :(", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/840331032", "review_id": "840331032", "date": "Jan 31, 2014", "rating": 5, "user_name": "Sergey", "user_url": "/user/show/24812157-sergey", "text": "I'm not a regular reader of this sort of books(everyday life of a modern man, romance, family and such stuff) but reading 'Man and Boy' was a wonderful experience. It really draws you in and keeps tight till the very end, hooking both with a good plot to follow and with author's witty manner of narrating. But what's even more important, Parsons deals with serious matters like love, responsibility, fathers and sons, in a light but at the same time wise manner. This books really moved me, going beyond schemes and dry ideas, and reading it was certainly not a waste of time.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/906683699", "review_id": "906683699", "date": "Apr 10, 2014", "rating": 3, "user_name": "Amy", "user_url": "/user/show/10724903-amy", "text": "At first, I had a bit of trouble getting into it. It seemed like all the other books like this that I'd been reading lately (One Day and The Republic of Love come to mind). But then, it got better. So much better. It became what I'd always wanted those other books to be. I felt for the characters and I just wanted to keep following their lives.The only reason I'm not jumping into the sequel is that I need a break from fiction. Other than that, I'd already be 1/4 through it!This was a very good read.", "num_likes": 0, "sort_order": "default", "shelves": ["series", "fiction", "real-life"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/976267318", "review_id": "976267318", "date": "Jun 24, 2014", "rating": 4, "user_name": "Simona", "user_url": "/user/show/32236568-simona", "text": "Ok. Call it chick lit for boys. Bla bla bla. But this book definitely gives you characters that are visceral. It gives you journeys. Development. You're opinion keeps changing and evolving and you feel you're really along for the ride.A little predictable in certain \"reveals\"... At times I was 3 pages ahead. But it redeems itself with the ending - as I found that to be unexpected.If you want a smooth read, in easy manageable chapters, that'll give you characters you can invest in- this book is for you.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1000507939", "review_id": "1000507939", "date": "Jul 19, 2014", "rating": 1, "user_name": "Julia", "user_url": "/user/show/14551105-julia", "text": "LIFE'S TOO SHORT TO READ BORING BOOKS. it's not a \"bad\" book per se but it's awfully boring and predictable. it's one of those books you read when you have absolutely nothing else to read. i didn't quite finish it because it was just too painful to read, so i skipped some chapters but still got to the 'important parts' (were there even any? ). anyway, i wouldn't recommend it to anyone, unless you like reading pointless, unoriginal stories that don't bring anything to your life and that don't challenge your mind.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1310204499", "review_id": "1310204499", "date": "Jun 17, 2015", "rating": 3, "user_name": "Kathryn Beek", "user_url": "/user/show/41654560-kathryn-beek", "text": "I picked this up off our book swap table at work. Published in 1999, it's a bit dated now, which is why I am perhaps rather unfairly giving it three stars instead of four. It's true that it did make me laugh, cry and think, which are all good things, but I feel as though the novel tapped into the cultural zeitgeist of 1999 and the world has moved on since then. Recommended holiday reading if you're interested in love, romance and families and want something a bit more thoughtful than the standard fare. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1431775573", "review_id": "1431775573", "date": "Nov 02, 2015", "rating": 4, "user_name": "Joff!", "user_url": "/user/show/47882293-joff", "text": "This was recommended to me because someone though I wrote in a similar style to Parsons. I wish I'd have discovered it sooner as I thoroughly enjoyed it. The basic story involves a father and mother - separated after he had a one-night stand - and the ensuing fight over their young son. Not the most inspired idea of course, but it's dealt with in a really encapsulating way. I enjoyed Parsons' turn of phrase and the numerous poignant moments - many of which really resonated with me and my own life. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1123223", "review_id": "1123223", "date": "May 09, 2007", "rating": 3, "user_name": "Casey", "user_url": "/user/show/80407-casey", "text": "I thought this was okay. I read it while I was in Ireland, and it seemed as if everyone had a copy. The bookstores on High Street were really pushing it. It's funny, the wife is hugely unlikable, though it's the husband who's at fault. I thought the author handled that one well. I also liked the grandfather. He was great. The writing felt a little too paired down, summary-ish. Verdict: cute, but pretty unsurprising.", "num_likes": 0, "sort_order": "default", "shelves": ["adults"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/5330527", "review_id": "5330527", "date": "Aug 29, 2007", "rating": 4, "user_name": "Kelly", "user_url": "/user/show/202160-kelly", "text": "A delightful and moving novel about Harry Silver who has everything going for him: a good job, loving wife and adorable son. One night and one irrational decision changes all this. Harry is left dealing with a separation and raising his young son when his wife leaves for Japan. It is the touching tale of a man who learns to become a wonderful and caring father while learning to build relationships again. A must and fast read. ", "num_likes": 0, "sort_order": "default", "shelves": ["booksreadin2003"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/63948052", "review_id": "63948052", "date": "Jul 17, 2009", "rating": 2, "user_name": "Tanya", "user_url": "/user/show/1276107-tanya", "text": "This book reads like a true story and that is also the problem. Who wants to read a story about lost love, divorce and all its hardships and to top it off death. I read for entertainment value not to be depressed by other peoples self inflicted stupidity.Perhaps the main character might have thought twice about cheating on his wife if he knew what he had to lose. The story just aggravated me because it wasnt far from the truth and i cannot tolerate stupidity.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/113737606", "review_id": "113737606", "date": "Jul 27, 2010", "rating": 2, "user_name": "Caroline", "user_url": "/user/show/2693141-caroline", "text": "I couldn't possibly say that this was not a good book because it kept me engaged and I finished it which is not something I do with a majority of books I pick up. When I surveyed the cover, it proclaimed that this book had the potential to make me both laugh and cry even harder (or vice versa something) but I only got misty eyed once. Maybe. A contemporary story with lots of witty, casual English banter. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/131751738", "review_id": "131751738", "date": "Nov 21, 2010", "rating": 5, "user_name": "Faridahyunos", "user_url": "/user/show/4033103-faridahyunos", "text": "okay the James Brown from Observer said he cried five times and laugh out loud four when he read this book. Guess what? I cried six times and uncountable number of laughing out loud, thanks to Tony Parsons who wrote this book brilliantly. :D Never thought that I would cry reading a novel, but here I am saying that I cried for the first time reading this book. Thumbs up! :DI will continue reading novels written by him. \"Love means knowing when to let go\" ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/155526794", "review_id": "155526794", "date": "Mar 20, 2011", "rating": 2, "user_name": "Samarpita", "user_url": "/user/show/5138528-samarpita", "text": "I had read so much about Tony Parson and hs \"May and Boy\" that I actually had high expectations.Result: DisappointedCharacters were not defined prperly.A couple split up and no one bothered to ask WHY.And the worst part was that the man cheated on his wife, but the entire novel went to do show how good a single father he is, his trials in the process of bringing his son up and how careless the mother is. IT was forgotten what the man did.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/170160855", "review_id": "170160855", "date": "May 22, 2011", "rating": 3, "user_name": "Rosemary", "user_url": "/user/show/4723954-rosemary", "text": "I liked this but I thought it had said all it had to say by about half way through. The guy is made out to be a hero for being able to look after a child ... right. And of course he has the kind of career where he can work part-time and earn plenty for the two of them to live on ... right. But somehow he is still amazing for doing this ... which thousands of women do in much more difficult circumstances. Still it is interesting to hear the man's point of view even if it seems a little whingey. ", "num_likes": 0, "sort_order": "default", "shelves": ["ultimate-teen-guide"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/189521145", "review_id": "189521145", "date": "Jul 25, 2011", "rating": 5, "user_name": "Maja", "user_url": "/user/show/4138278-maja", "text": "It's about love, all kinds of love. It's about children, parents, grandparents; it's about roots, and belonging, and growing up and growing strong. It's also about friends, and lovers, and small London cafes and streets. It's about Star Wars, and Meredith Brooks, and suburban backyards, and bikes that have names. It's witty, it's warm even when it's tragic. And the author treats his characters and their world with outmost respect. It's everything I like in a book. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/192900723", "review_id": "192900723", "date": "Aug 01, 2011", "rating": 2, "user_name": "Karen", "user_url": "/user/show/5915498-karen", "text": "Maybe it was just my female heckles rising at the almost casual way in which Harry buggered up his marriage. Maybe it was how the stuff about attitudes to men at the school gates - possibly true in the 90's but the ratio at our school is closer to 70:30 - made the book feel somewhat dated. Or perhaps aspects of the story did hit a little too close to home for comfort.Whatever it was, I just didn't enjoy it as much as 'One for my Baby'.", "num_likes": 0, "sort_order": "default", "shelves": ["second-hand", "gave-away"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/221165343", "review_id": "221165343", "date": "Oct 09, 2011", "rating": 3, "user_name": "Alison", "user_url": "/user/show/6082688-alison", "text": "It took a while for me to get into this book, I started it then put it down for a month or so without missing it. An interesting look at single parenting, parts reminding me a lot of my childhood. I enjoyed that parents aren't painted as perfect people and some aspects of the book make more sense to me at my present age than it would as a young adult.Not my favourite book of the year but enjoyable reading none the less.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/258396577", "review_id": "258396577", "date": "Jan 08, 2012", "rating": 4, "user_name": "Ruth", "user_url": "/user/show/4666351-ruth", "text": "Right from the very start, this story has a tone of regret, of a life that could have been, should have been, different. Harry's life has changed and the only thing he knows for certain is that he loves his son and wants to do what is best for him - but just what that is he doesn't know. Not by any means a feel-good story but one which reflects the emotion and sadness of a family break-up and how the ripples spread out through the extended family. ", "num_likes": 0, "sort_order": "default", "shelves": ["kindle"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/288262811", "review_id": "288262811", "date": "Mar 04, 2012", "rating": 2, "user_name": "Nattaya", "user_url": "/user/show/8003623-nattaya", "text": "It is quite a boring book. Well, let me restate, it is supposed to be a book you borrow from a library or a friend, not a book you buy. That way, you can give it back anytime you feel like it. I bought this book from a store in Bangkok. I picked it up from the lowest bottom shelf (no wonder why it's there). Now I just wanna sell it or ask the store to give me back my money. The story is too light and not at all interesting. Maybe it's my fault to pick up a book that didn't suit my liking. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/350785939", "review_id": "350785939", "date": "Jun 18, 2012", "rating": 2, "user_name": "Kerry", "user_url": "/user/show/10222355-kerry", "text": "First time reading Tony Parsons and this first book didn't really do it for me. I found some parts of the story to be mis-matched with what I felt was going on with the story. It also, on occasion, jumped from one scene to the next without any indication of what was going on.After my recent delights of reading Mike Gayle's books I also found this one to contain too many unnecessary swear words throughout.", "num_likes": 0, "sort_order": "default", "shelves": ["owned-books"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/381814580", "review_id": "381814580", "date": "Aug 01, 2012", "rating": 5, "user_name": "Zoe", "user_url": "/user/show/11465517-zoe", "text": "Man and Boy is a great book! One of my favourite books. I read this on holiday and have fond memories of it. I loved the simple moments of a British family summer. The books really does make you laugh out loud, and feel frustrated with the main character, Harry! It is a comfortable read, that you want to read in one sitting, and more then once. I found myself getting very absorbed with the characters. There are strong family characters in the book. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/416347117", "review_id": "416347117", "date": "Sep 17, 2012", "rating": 2, "user_name": "Bigsna", "user_url": "/user/show/1384536-bigsna", "text": "Nothing in this book seemed new to me. The moment I started reading it, I could guess exactly where the story was going. Very very predictable. Very very formula and the story felt too familiar. Nothing really stood out in the book for me. I did not like the lead character - I thought he was quite a sissy. But in the end since he was the \"hero\" he had to get a happy ending.Its like an updated rip off of Kramer vs Kramer - except that book had more feel to it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/451150076", "review_id": "451150076", "date": "Nov 07, 2012", "rating": 3, "user_name": "Charlie Yarwood", "user_url": "/user/show/14376637-charlie-yarwood", "text": "There were points where I felt like hurling this book across the room and I don't know if it's a good thing. I just wanted to shout at the characters for being silly, or not saying something they could and should have said. I can't decide if that's because I was getting sucked in by it or not. I'm not sure that it left me wanting to pick up the sequel though, even though I do admit I did enjoy the book. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/478885022", "review_id": "478885022", "date": "Dec 16, 2012", "rating": 2, "user_name": "Karel", "user_url": "/user/show/11497287-karel", "text": "Just couldn't like this one, even though the writing flowed smoothly. It felt like it was trying too hard to me. Trying to be poignant, trying to make moving observations, but just ended up with a handful of sweeping generalizations. Half the things the narrator observes might be true, but only for HIM and some others. A lot of the times when he's talking about how men are like X and these women are like Y and these people are like Z, I can't help but feel that it's an unfair generalization.", "num_likes": 0, "sort_order": "default", "shelves": ["srzbznz"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/549273330", "review_id": "549273330", "date": "Mar 01, 2013", "rating": 4, "user_name": "Nancy G.", "user_url": "/user/show/16664689-nancy-g", "text": "I loved it. Some parts brought a smile to my lips, and other parts brought tears to my eyes. Written in a smooth, simple way, a journey with Tony Parsons that will definitely touch your heart in some part of it. You'll get angry at Harry (the main character), like him, sympathies with him...I had so many different feelings towards him. But definitely looooved other characters like his father and his lovely son. Peggy was beautiful one as well :)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/616327368", "review_id": "616327368", "date": "May 15, 2013", "rating": 3, "user_name": "Corrina Townend", "user_url": "/user/show/20028464-corrina-townend", "text": "I quite liked the way we got to know the characters, though believe most dads are switched on these days. The problem I had was with the story being set in London, a big city where you don't just bump into a waiter from where you dined at the night before and her daughter happens to go to school with your son. It would have worked better if the author had chosen a country town where people are connected closely to each other. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/648322421", "review_id": "648322421", "date": "Jun 22, 2013", "rating": 5, "user_name": "Harvey", "user_url": "/user/show/3172914-harvey", "text": "- I almost cried, more than once . . . seriously!- from the jacket: \"Man and Boy is by turns funny, sharp, warm, and heart-wrenching.\" (with which I agree completely)- the plot revolves around Harry Silver, who starts out by having it all: a beautiful wife, a wonderful son, a great job in the media - but in one night, throws it all away by having a one-night-stand. The characters are all well fleshed out, and quite plausible.- I really enjoyed reading this.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/738989135", "review_id": "738989135", "date": "Oct 11, 2013", "rating": 2, "user_name": "Laura", "user_url": "/user/show/9809507-laura", "text": "I had a hard time getting into this book, the first half was a chore. I ended up connecting with characters about halfway in and cried my eyes out a couple of times as well. I can't imagine many women will have much sympathy for the man having an affair, letting his kid get seriously injured due to lack of supervision, letting his kid listen to very inappropriate music, sit in the front seat of a sports car, etc.. so I did not identify with the dad in this book at all. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/745307212", "review_id": "745307212", "date": "Oct 20, 2013", "rating": 1, "user_name": "Amps", "user_url": "/user/show/15642385-amps", "text": "A great portion of this book is all man, and little (a few chapters left) boy. The selfishness of the protagonist ruined the story for me. The whole book is about a man who whines and bitches about how old he was getting and how boring his life was getting, and how he decided to ruin his whole family with another woman whom he showed no particular interest in. Oh, and the author throws in a kid to the story, too. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1008062433", "review_id": "1008062433", "date": "Jul 27, 2014", "rating": 4, "user_name": "Kate Millin", "user_url": "/user/show/2630710-kate-millin", "text": "A story about the relationships between fathers and sons, and also about how a father can change his life successfully to become a single parent. It includes a side story about mothers and children - including a lot of respect for all single parents as well as a celebration of the traditional family group. I enjoyed it, although the main character was a little self obsessed and I found the style of writing a little frustrating. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1255298699", "review_id": "1255298699", "date": "Apr 14, 2015", "rating": 3, "user_name": "Iqa Chan", "user_url": "/user/show/18970140-iqa-chan", "text": "Very well and smooth ideas presented by the author. This is a story about a man, Harry who has everything in his life. He has beautiful and intelligent wife, a son and well-paid job; so-called a perfect life of a man who will turn 30. However in one night, he lose everything. Since then, the journey of his life begins. Life that will teach him on how to matured in love, marriage and of course being a single father.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1711731098", "review_id": "1711731098", "date": "Jul 28, 2016", "rating": 4, "user_name": "Nafeesa Malik", "user_url": "/user/show/49124686-nafeesa-malik", "text": "At some point it was tedious but it sure was a gripping read. ' But you have to learn to let go, my mother said, 'That's part of it, isn't it?''Part of what?'Part of what it means to love someone. To really love someone. If you love someone you just don't see them as an extension of yourself. You don't just love them for what's in it for you.''Love means knowing when to let go,' she told me.<3 ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1738801661", "review_id": "1738801661", "date": "Oct 18, 2016", "rating": 4, "user_name": "Grace", "user_url": "/user/show/15945766-grace", "text": "Beautiful read, so close to the reality of a lot of relationships! Loved it genuinely and whilst in a fantasy world, would have loved for Harry to fight for Pat, I realize that in the complexities of modern life, he made the best decision, ever! A decision that most fail at hence the increase in numbers of children who grow up to be skeptic to the notion of love and marriage. The pain and joys are what, in MOP view as a life fully lived. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/3728499232", "review_id": "3728499232", "date": "Dec 30, 2020", "rating": 1, "user_name": "Gerald", "user_url": "/user/show/127333620-gerald", "text": "That this book was awarded 'British Book of the Year' (according to the cover) seems completely unbelievable to me. I thought it was awful. I cannot think of any saving grace for it. It is a weak and shallow book with implausible and under-developed characters including a sad self pitying main character who seems to take no responsibility for anything he does. I don't actually want to waste any more time writing this review to be honest.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/4000031", "review_id": "4000031", "date": "Aug 02, 2007", "rating": 4, "user_name": "Melia", "user_url": "/user/show/249247-melia", "text": "Harry had a brief moment of stupidity which created a major impact on his life. Parson's attention to detail and his ability to describe a 4 year old boy's emotions along with a confused suddenly single father's are wonderfully accurate. I loved that the book didn't offer a typically nice neat happy ending, although I was satisfied with the way Parsons chose to end the book.", "num_likes": 0, "sort_order": "default", "shelves": ["fiction"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/8863779", "review_id": "8863779", "date": "Nov 08, 2007", "rating": 2, "user_name": "Tasha", "user_url": "/user/show/120681-tasha", "text": "This book was utterly predictable. I don´t think even one \"plot twist\" occured that I didn´t see coming. I normally wouldn´t bother putting in on a book review, but have decided to add all books I´ve read while traveling. This means that sometimes I have to add books that I´ve read simply because they are convenient, there aren´t a lot of choices for English language books in Latin America. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/16057436", "review_id": "16057436", "date": "Feb 21, 2008", "rating": 3, "user_name": "Sharlie", "user_url": "/user/show/859781-sharlie", "text": "This book was an interesting insight into a single parents life. It was set in England so had lots of fun British words (Mum, etc), but it also had a lot of foul language. It showed an interesting perspective of someone dealing with adultry, being a single parent, death of a parent and learning about life. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/17150010", "review_id": "17150010", "date": "Mar 06, 2008", "rating": 4, "user_name": "Godzilla", "user_url": "/user/show/737004-godzilla", "text": "A real page turner.He dealt with some big issues, which as a father and husband I can really relate to.The father son relationship is explored on two levels, and it made all the more painfully aware that I've missed out on an awful lot, with my father dying 16 years ago, and so have my children. ", "num_likes": 0, "sort_order": "default", "shelves": ["2008"]}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/43332159", "review_id": "43332159", "date": "Jan 17, 2009", "rating": 2, "user_name": "Ryan Dilbert", "user_url": "/user/show/78100-ryan-dilbert", "text": "I started this off thinking it was the poor man's \"About A Boy,\" but it ended up being (as Bill Simmons would say) the homeless man's \"About A Boy.\" It's a touching yet affected story that is a page turner though not the tear-jerker/knee-slapper the flap suggests it will be. This is beach reading material that at it's best, is not bad. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/74306713", "review_id": "74306713", "date": "Oct 12, 2009", "rating": 4, "user_name": "Sunkissd1 Base", "user_url": "/user/show/2833106-sunkissd1-base", "text": "I'd give it a 4.5 star. I also highly recommend Man & Wife. They are good, fun reads, well written, but not fluff reads. It's written from a man's perspective as he goes through a divorce caused by his brief indiscretion, job loss and trying to raise his son. The story is very real, heartwarming and engaging. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/89546978", "review_id": "89546978", "date": "Feb 13, 2010", "rating": 2, "user_name": "Stuart", "user_url": "/user/show/2458771-stuart", "text": "I read this a few years back. To be honest I really don't remember much about it other than that some Star Wars figures featured in it somewhere. I guess you could say this was a rather forgettable novel. My only other abiding memory was resolving not to bother reading another book by Tony Parsons. To date I have stuck by that decision. Can't say I am filled with regret.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/158630638", "review_id": "158630638", "date": "Apr 03, 2011", "rating": 3, "user_name": "Tom", "user_url": "/user/show/710541-tom", "text": "This is a good fictional account of a marriage gone sour. I would recommend the book to couples who are having marital problems and/or contemplating divorce. It presents a fairly accurate account of the difficulties experienced by the couple as well as the repercussions and heartbreaks for children, extended family and friends. As a marriage manual I would give this book 5 stars.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/192842099", "review_id": "192842099", "date": "Jul 31, 2011", "rating": 3, "user_name": "Katie", "user_url": "/user/show/4727648-katie", "text": "I liked this book, but it felt a lot like a story told a hundred times before. I knew what was coming at the end, so it lacked an element of surprise that I like in books. The ending was terribly cliche and has been done a million times. Overall, it's a pleasant read, but not really anything I'd recommend.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/201644988", "review_id": "201644988", "date": "Aug 23, 2011", "rating": 4, "user_name": "Adam Beddoe", "user_url": "/user/show/4463886-adam-beddoe", "text": "Chick-lit is the biggest selling genre of books selling at the moment and this is clearly the male alternative (Man-lit?). The main protagonist is a man struggling with modern life, making honest mistakes and dealing with life that isn't the same as the Hollywood blockbuster tells us it should be. Immensely readable and enjoyable. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/358031770", "review_id": "358031770", "date": "Jun 29, 2012", "rating": "", "user_name": "Natalie M", "user_url": "/user/show/10517160-natalie-m", "text": "This book was on my 'to read' list for a while, just because it seemed to get positive reviews! Am left slightly disappointed because in between I read 'One Day' by David Nicholls and found that i was comparing the two all the way through. 'Man and Boy' was never gonna win! It was good but not THAT good!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/367775963", "review_id": "367775963", "date": "Jul 13, 2012", "rating": 3, "user_name": "Geourska", "user_url": "/user/show/7298919-geourska", "text": "I had a hard time getting into this book. Initially, I was turned off by Harry Silver's one-night stand and I wasn't sure that I wanted to read any more. After a day or two, I picked up the book again and continued to read. It's a nice story and the main character did redeem himself, but ultimately, I'm not sure why it won any prizes. It was really just an average book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/380565391", "review_id": "380565391", "date": "Jul 30, 2012", "rating": 5, "user_name": "Fred Chamberlain", "user_url": "/user/show/6447489-fred-chamberlain", "text": "Having read a few reviews of this book, it appears that I took a much simpler message away from this book, which I found powerful and engaging with every paragraph. Simply put, this story is about fear (In this case, fear of aging), consequences of careless behaviors driven by fear and rediscovering oneself...... Simple, yet especially meaningful in it's importance.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/464614862", "review_id": "464614862", "date": "Nov 27, 2012", "rating": 4, "user_name": "Amanda Lykke", "user_url": "/user/show/14543452-amanda-lykke", "text": "A really nice book! I imagined it as a movie almost the whole time. The kind of movie yoy wanna watch on a lazy sunday or a weekday night when you're tired and just want to relax and eat some good snacks. The book is well written and sometimes it's just nice to read about ordinary people and how they live their lives. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/511858116", "review_id": "511858116", "date": "Jan 20, 2013", "rating": 4, "user_name": "Aisyah", "user_url": "/user/show/11324108-aisyah", "text": "Read this at a time when I was looking for a sign, as cliched as that may sound. It taught me the things I've always wondered, about love, fidelity, the attraction between and older man and a younger woman and if there will always be a way around every screw up. Must say it was an amazing read. Real, yet hopeful", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/551321750", "review_id": "551321750", "date": "Mar 03, 2013", "rating": 5, "user_name": "Alexianne", "user_url": "/user/show/7065738-alexianne", "text": "ABSOLUTELY FANTASTIC!it's a beautiful touchy story that has left the author to write a series of books of this sort but nothing beats this one... and for the GUYS - please do read it, it involves you and your way of how to deal with parenthood, the woman beside you and so much more ... all conveyed in small anecdotes of everyday which makes this book all so special!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/655753964", "review_id": "655753964", "date": "Jul 01, 2013", "rating": 2, "user_name": "Akmal Bakeri", "user_url": "/user/show/10396236-akmal-bakeri", "text": "Just some ordinary, banal story, about a recently divorced man and subsequent problems that follows. Many reviews claimed that the story can make you cry and laugh, and it was misleading. True, there are many heart rending moments, but I didn’t find any single funny bit. Or maybe there are, but I couldn’t understand them. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/704861020", "review_id": "704861020", "date": "Aug 27, 2013", "rating": 3, "user_name": "Sara", "user_url": "/user/show/18404235-sara", "text": "It`s been a really great book to read. I like how the author goes trough the modern society in the UK and puts it all in the perspective of the real world. It makes sense how the main character sees things with no hopes nor dreams due to his past and maturity, but there are great considerations and \"what if`s\".. Great conjunction of more realities. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/716893199", "review_id": "716893199", "date": "Sep 11, 2013", "rating": 4, "user_name": "Kirsty", "user_url": "/user/show/4373728-kirsty", "text": "I started not liking the character but as the book progressed I think I understood him more. Also his wife ... two wrongs don't make a right so I had little sympathy with her when she started her new life in Japan.Eventually two poignant poi ts bought a tear to my eye and as soon as I finished this I downloaed the sequel to my Kindle.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/724074642", "review_id": "724074642", "date": "Sep 20, 2013", "rating": 3, "user_name": "Dennis Raffaelli", "user_url": "/user/show/21312715-dennis-raffaelli", "text": "This author makes the mistake a lot of modern authors make. They use crudeness for its own sake. This book could have been a great book dealing with real issues if he did not use vulgarity for its tiltilating value.The them of man and boy could have been expanded on. This author is an example of why there are few great authors now a days. They come short of it for commercial reasons. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "47345.Man_and_Boy", "book_id": "47345", "book_title": "Man and Boy", "review_url": "https://www.goodreads.com/review/show/1013589343", "review_id": "1013589343", "date": "Aug 01, 2014", "rating": 2, "user_name": "Lisanne", "user_url": "/user/show/1144065-lisanne", "text": "I picked this from a pile of books at the rental house we were staying in and was hoping it might be a good summer beach read in the vain of Nick Hornsby. There is chick lit and I would classify this as dick lit. It was just barely readable and very cliché. I got suckered in with the sick Dad part because I always do but other than that pretty forgettable.", "num_likes": 0, "sort_order": "default", "shelves": []}]