[{"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3731869946", "review_id": "3731869946", "date": "Dec 31, 2020", "rating": 5, "user_name": "Sandy *The world could end while I was reading and I would never notice*", "user_url": "/user/show/30817744-sandy-the-world-could-end-while-i-was-reading-and-i-would-never-notice", "text": "EXCERPT: And into this (pub) one day wandered a guy called Gordon, with his vertical-stripe velvet coat, his shoes that turned up at the front, his Brylcreemed hair, his Ascot tie and his violin. And a wierd look about his face. I became instantly friendly with him. Gordon only had one eye - he'd lost the other one in a motoring accident in Spain - but that's not when we discovered it, that came later. We found that out one day when it was somebody's birthday in the pub. 'Happy birthday!' - chink-chink - 'Happy birthday! All the best!' - chink-chink - 'Yeah, happy birthday to you!' - chink-chink. And Gordon went; 'Yeah, happy birthday!' and he lifted his glass and chink-chinked it with his glass eye. We were amazed: 'Did you see that? He chinked the glass off his fucking eye!'He was a crazy bloke. He drank Guinness and when he needed to pee, he'd take his eye out and put it in the foam, because there were a lot of thieves in the pub. We called them 'mine-sweepers', because they'd go up and grab somebody else's glass, saying, 'That's mine!' Well, they'd try it with Gordon's - 'That's mine!' - and then they'd see this eye floating in the foam: 'Aaaggghhh!'Well I was walking through the pub one day, and he came in the door with his arm in a sling. I said, 'What happened to you?' He said, 'You'll never believe it. I was driving up Sauchiehill Street, I was scratching my good eye, and I ran into a bus.' He'd thought because his artificial eye was so expensive he could see through it!ABOUT 'TALL TALES AND WEE STORIES': In December 2018, after fifty years of belly-laughs, energy and outrage, Billy Connolly announced his retirement from live stand-up comedy. It had been an extraordinary career.When he first started out in the late sixties, Billy played the banjo in the folk clubs of Scotland. Between songs, he would improvise a bit, telling anecdotes from the Clyde shipyard where he'd worked. In the process, he made all kinds of discoveries about what audiences found funny, from his own brilliant mimes to the power of speaking irreverently about politics or explicitly about sex. He began to understand the craft of great storytelling. Soon the songs became shorter and the monologues longer, and Billy quickly became recognised as one of the most exciting comedians of his generation.Billy's routines always felt spontaneous. He never wrote scripts, always creating his comedy freshly on stage in the presence of a live audience. A brilliant comic story might be subsequently discarded, adapted or embellished. A quick observation or short anecdote one night, could become a twenty-minute segment by the next night of a tour.Billy always brought a beautiful sense of the absurd to his shows as he riffed on his family, hecklers, swimming in the North Sea or naked bungee jumping. But his comedy can be laced with anger too. He hates pretentiousness and calls out hypocrisy wherever he sees it. His insights about the human condition have shocked many people, while his unique talent and startling appearance on stage gave him license to say anything he damn well pleased about sex, politics or religion.Billy got away with it because he has always had the popular touch. His comedy spans generations and different social tribes in a way that few others have ever managed.MY THOUGHTS: I bought this book from a small independent bookstore in Russell, northern New Zealand, when we were up there on holiday over the 2019/20 Christmas/New Year period. I love Billy Connolly and was lucky enough to see him live last time he toured New Zealand. I came out of his show with my mascara all down my face, and my sides ached for days. Billy writes exactly as he talks, so I could hear him as I was reading. Some of the stories were familiar to me, some were new. All were entertaining. No one escapes his attention. Not his wife, daughters, friends, workmates, or the scone loving, brogue, twinset and heather coloured tweed wearing elderly ladies of Scotland. If you're a Billy Connolly fan, or simply need a good laugh, this is the book you need. It has joined The World of Pooh: The Complete Winnie-The-Pooh and the House at Pooh Corner by A.A. Milne as my all time favourites. They are never put away on a shelf, but instead are always somewhere close at hand where I can pick one up and while away a few minutes, or hours. ⭐⭐⭐⭐⭐THE AUTHOR: William \"Billy\" Connolly, Jr., CBE is a Scottish comedian, musician, presenter and actor. He is sometimes known, especially in his native Scotland, by the nickname The Big Yin (The Big One). His first trade, in the early 1960s, was as a welder (specifically a boilermaker) in the Glasgow shipyards, but he gave it up towards the end of the decade to pursue a career as a folk singer in the Humblebums and subsequently as a soloist. In the early 1970s he made the transition from folk-singer with a comedic persona to fully-fledged comedian, a role in which he continues. He also became an actor.It is as a stand-up comedian that Connolly is best known. His observational comedy is idiosyncratic and often off-the-cuff. He has outraged certain sectors of audiences, critics and the media with his free use of the word \"fuck\". He has made jokes relating to masturbation, blasphemy, defecation, flatulence, haemorrhoids, sex, his father's illness, his aunts' cruelty and, in the latter stages of his career, old age (specifically his experiences of growing old). In 2007 and again in 2010, he was voted the greatest stand-up comic on Channel 4's 100 Greatest Stand-Ups.Connolly has been married to comedian and psychologist Pamela Stephenson since 1989. In the book Billy, and in a December 2008 online interview, Connolly states he was sexually abused by his father between the ages of 10 and 15. He believes this was a result of the Catholic Church not allowing his father to divorce after his mother left the family. Due to this, Connolly has a \"deep distrust and dislike of the Catholic church and any other organization that brainwashes people\". In a 1999 interview with \"The Sunday Herald\" Connolly condemned the SNP as \"racist\" and the new Scottish parliament as a \"joke\".In November 1998, Connolly was the subject of a two-hour retrospective entitled Billy Connolly: Erect for 30 Years, which included tributes from Judi Dench, Sean Connery, Whoopi Goldberg, Robin Williams, Dustin Hoffman, and Eddie Izzard. DISCLOSURE: I own my copy of Tall Tales and Wee Stories written by Billy Connolly and published by Two Roads. All opinions expressed in this review are entirely my own personal opinions. For an explanation of my rating system please refer to my Goodreads.com profile page or the about page on sandysbookaday.wordpress.com This review and others are also published on Twitter, Instagram and my webpage https://sandysbookaday.wordpress.com/...", "num_likes": 54, "sort_order": "default", "shelves": ["2020", "5-star", "humour", "slice-of-life"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3801191570", "review_id": "3801191570", "date": "Jan 31, 2021", "rating": 3, "user_name": "Diane S ☔", "user_url": "/user/show/4159922-diane-s", "text": "Rude, lead and crude, with quite a bit of profanity thrown in, but entertaining nonetheless. I've never watched his stand up routines, but became aquatinted with this comedian by watching PBS. If you've watched his stand up you may already have heard some of the tales in this book. From his growing up in a tenament in Glasgow to his Catholic schooling, there are incidents that left me laughing. I sent to Catholic school, and could identify even if we were schooled county's apart.His travels and opinions of other countries, I particularly liked his explanation on why the Swiss yodeled. Too funny! Some of course fell flat, the nature of the heart where comedy is concerned, but there is plenty within for one to find comedic gems. Like I said though, he does not mince nor minimize his words, opinions, profanity at all. A much welcomed comedic break.", "num_likes": 38, "sort_order": "default", "shelves": ["nf-2021"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3230228193", "review_id": "3230228193", "date": "Mar 24, 2020", "rating": 2, "user_name": "Richard Newton", "user_url": "/user/show/19540749-richard-newton", "text": "I'm a big fan of Billy Connolly, as a comedian, a storyteller and just generally as an all round interesting good bloke who is great to listen to. But this book did not do a lot for me, except make me reflect what a great performer he is. The book made me think of scientific reductionism - that tendency of some scientists to break a problem into tiny parts and see the solution in terms of those tiny parts instead of retaining some holistic vision. For Billy Connolly is more than the sum of his parts. If you read these stories without any idea who Billy Connolly was, I suspect you would find them neither terribly interesting nor amusing. In fact, I was surprised how comically thin many of these tall tales and wee stories were. And yet some of them I think I can actually remember him telling and laughing at.I think this comes down to the fact that he is overall a brilliant performer. And to understand this brilliance you need to hear his voice, see his face, sense his energy levels when he was performing, - and so on. The words written down on paper just don't do it for me on their own - but if you add him back into them, they will. There were a few bits which were either slightly amusing or interesting, but slim pickings from a 320 or so pages long book. My advice, give this a miss. He has written other stuff - I'd say go for that.", "num_likes": 33, "sort_order": "default", "shelves": ["thinking-about-life", "memoir-or-biography"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/2975994730", "review_id": "2975994730", "date": "Nov 17, 2019", "rating": 5, "user_name": "Bill", "user_url": "/user/show/41874806-bill", "text": "Over the years I've seen Billy Connolly's numerous stand up routines on TV, but I've always regretted not seeing him live on stage. To make up for this in a small way I treated myself to a signed copy of this brilliantly entertaining book.Connolly has put together his best \"tall tales & wee stories\" from a lifetime of stand up comedy. There are a few stories here that are new to me, but even the routines I know well still made me laugh out loud. The stories all flow beautifully & so many of them are classics it's impossible to choose any favourites. A great collection of tales from a real legend.", "num_likes": 19, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3924816649", "review_id": "3924816649", "date": "Apr 17, 2021", "rating": 4, "user_name": "Thomas Stroemquist", "user_url": "/user/show/32669562-thomas-stroemquist", "text": "One of the reasons I love Billy Connelly’s stories is that he tells them just like I do myself - only funny. Unnecessary background, side tracks, lost threads, missed points, picked up threads, another side story, completely unrelated facts about characters in the story, oh and look - there’s the punchline! I was wondering a little if there could be something in what some reviewers said that these would work less well in written form, but that went out the window at the end of the second sentence and by the end of the second paragraph I was huffing snd puffing and laughing out loud. Can honestly not remember when a book made me do that last time. The missing star is mainly because I felt the book lost pace towards the end and the last few chapters would actually have been better to leave out. Billy (as I expected) also veers a tad close to slapstick and/or toilet humour at times. It’s a great read though and very strong four stars.", "num_likes": 16, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3251090824", "review_id": "3251090824", "date": "Jan 03, 2022", "rating": 4, "user_name": "Paul", "user_url": "/user/show/11951948-paul", "text": "I have been a fan of Billy Connolly for as long as I can remember and sadly never took the opportunity to go and see him live before he retired in 2018. I have seen many of his recorded performances though and I think all of his travelogues as he has been around various parts of the world.This book is a collection of some of his best-known stories that he tells as part of his sets. He is a very human comedian, he is as happy to rip the piss out of himself as he is to call out the hypocrisy of others whilst giving you a stitch laughing about it so much.Some of the tall tales and wee stories in here I have heard before. That doesn’t make them any less funny though. One of my favourites was his description of swimming in the North Sea as a Child! Provided you don’t mind a bit (ok a lot) of profanity then there is almost certainly something in here that will make you laugh. Great stuff and thanks for all the laughs, Billy.", "num_likes": 14, "sort_order": "default", "shelves": ["2022"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3528653621", "review_id": "3528653621", "date": "Sep 27, 2020", "rating": 3, "user_name": "Chris Steeden", "user_url": "/user/show/21637893-chris-steeden", "text": "I love Billy Connolly having seen him live two or three times and watched all his television programmes including the excellent 'World Tour' series in England, Scotland, Australia and New Zealand. I also have a few of the live DVDs.So I was looking forward to this book. It is a let down. If, like me, you have seen all the above then you will know the majority of the tall tales and wee stories he tells here. There are some I have not heard before though but that does not really make up for it. It is a dip in-and-out book for sure.He says that when you read the book you will hear him and that is so true. Who is this book aimed at? I am not really sure. For Connolly fans it is going over old ground. For someone that does not know him I would say get the 'World Tour' DVDs.", "num_likes": 12, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3049171806", "review_id": "3049171806", "date": "Nov 14, 2019", "rating": 5, "user_name": "Jo", "user_url": "/user/show/3077040-jo", "text": "Tall Tales and Wee Stories: The Best of Billy ConnollyBilly Connolly, is one of those comedians who everybody knows and loves, his innate honesty and sharp wit, have had audiences in stitches for five decades. I read this on the bus on the way to and from work and was giggling all the way there and back. The drivers must have thought I'd lost by mind. Highlights include a trip to Births Deaths and Marriages and a chapter on why multiple orgasms have put tremendous pressure on men and women have no idea. This book is typical Billy and I loved every word of it.", "num_likes": 9, "sort_order": "default", "shelves": ["reviewed"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3253006102", "review_id": "3253006102", "date": "Mar 29, 2020", "rating": 3, "user_name": "Lee", "user_url": "/user/show/6361389-lee", "text": "Good fun running through transcripts of a lot of the better routines (and some that don't translate very well, falling flat on the page, the absence of the performer of a text never so keenly felt). The ultimate realisation is that Connolly was an even better stage presence than imagined to have elevated some of this way beyond its merit. Ultimately, great spending time with that voice again.", "num_likes": 8, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3098215901", "review_id": "3098215901", "date": "Jan 03, 2020", "rating": 4, "user_name": "Kasa Cotugno", "user_url": "/user/show/2345554-kasa-cotugno", "text": "What makes the inhabitants of Glasgow so eternally fascinating! Here, Billy Connolly gives insight through his tenement childhood through his life, told in short vignettes, some laugh-out-loud hilarious. In fact, his secret to enjoying life without fail is to be sure not to lose your ability to laugh. At times curmudgeonly, at times kind, often very raw and profane, but always honest, and with that wee twinkle. Full disclosure - I never had the pleasure of seeing Sir Connolly's standup in person. In fact, I first became aware of him through his portrayal in the film Mrs. Brown, and didn't realize acting was only one of his skills, and not the one he was best known for. ", "num_likes": 6, "sort_order": "default", "shelves": ["genre-humor-satire", "arc", "subj-showbiz", "genre-biography-memoir"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4119651817", "review_id": "4119651817", "date": "Jul 17, 2021", "rating": 2, "user_name": "Beth", "user_url": "/user/show/37541875-beth", "text": "Ach, sorry Billy. This book just isn't that funny. Perhaps my expectations were too high.Connelly starts this book by conceding that he is no longer well enough to stand in front of an audience for over two hours. He is very open about living with Parkinson's Disease but he is also now 78 years old.He was always a very physical comedian; his act was slapstick in many ways with a lot of the humour arising from his gestures and facial expressions. It doesn't translate on to the page especially well. It is indeed a book of 'wee stories' - an there's a gey lot o' them. This is something to dip into from time to time for a wee smile rather than to read in one go.", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3179823453", "review_id": "3179823453", "date": "Feb 07, 2020", "rating": 2, "user_name": "Keen", "user_url": "/user/show/66635467-keen", "text": "CYNICAL, HALF-HEARTED RECYCLED CASH IN!Imagine one of your favourite bands or singers who had been recording music for around half a century, decided to put those songs in book form without any hint of the music at all. You would rightly be confused by the move. Beyond the cash generating aspect, what would be the point?...Well that is basically what Connolly has done here.The main problem with this book is that almost all of it has appeared in at least one, sometimes two previous books and a lot of his stand up. It really feels a bit cheeky and lazy when we are getting the exact same stories dragged out for two books in a row?...Surely the readership deserves some quality control?...instead of recycling the same old stories again and again.Of course this has its funny moments now and then, but the truth is that too many of these stories do not translate well onto the page at all. I’ve heard many of them on his stand up stuff and it is delivered a lot better, so much of it is lost when committed to the page, all the drama, nuance and volume stripped away it can feel incredibly dull and disappointing. On the positive side, this is a quick read and it’s an easy read, but overall there is a good reason why Connolly has not published too many books in his half century involved in the creative and performing arts. Some of these are really awful and not only fall flat but fail miserably and really don’t do the great man justice at all. ", "num_likes": 5, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3016186325", "review_id": "3016186325", "date": "Oct 19, 2019", "rating": 5, "user_name": "Amanda Provan", "user_url": "/user/show/10728284-amanda-provan", "text": "All my favourite stories in written form. Billy Connolly has such a special place in my heart and I always get really emotional talking about him but this one made me laugh rather than cry. I had tears running down my face reading my favourite skits I was laughing that much. It took me five minutes to read one bloody paragraph about the knitted balaclava because I was hysterically laughing. They are just as funny in written form as they are on stage. Love you big yin!", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3168138498", "review_id": "3168138498", "date": "Feb 01, 2020", "rating": 4, "user_name": "Suzanne", "user_url": "/user/show/105562311-suzanne", "text": "I saw Billy on stage a few years ago and I laughed until it hurt. I think seeing him live definitely helped while reading the book, as I could imagine him strutting round the stage telling his tall tales and wee stories. He's written the book exactly the way he talks, swear words and all.", "num_likes": 4, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3189392959", "review_id": "3189392959", "date": "Apr 05, 2020", "rating": 5, "user_name": "Wendy Bland", "user_url": "/user/show/108223597-wendy-bland", "text": "I t had me laughing out loud! Thank you Billy.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3847035699", "review_id": "3847035699", "date": "Feb 19, 2021", "rating": 4, "user_name": "Julie Morris", "user_url": "/user/show/55738288-julie-morris", "text": "I’ve been a massive Billy Connolly fan for many years. I’ve got lots of DVDs featuring his standup and travelogues, and I was lucky enough to see him live twice. He never fails to make me laugh, even just on a chat show. So it was with great sadness I heard about his retirement, although entirely understandable in his circumstances.I was looking forward to reading this book in which he has gathered many of his most famous stories for posterity. Billy never really told ‘jokes,’ they were always funny anecdotes and tales, often poking fun at himself or other absurdities he saw in every day life. He often talked about sex and bodily functions, and was very sweary and he makes no apology for that, so the book would not be for anyone who did not like this in his live shows because Billy is exactly the same in the book as when performing. If you did love his humour though, you will find many of your favourite stories within these pages.The book is split in to chapters on different, loosely connected topics, but otherwise it is fairly randomly organised with just little anecdotes and longer ones interspersed with comments, thoughts and musings on his life and career. Some people won’t like it because it isn’t a particular linear format, but then Billy’s comedy was never like that. He would start on a topic and then wander off at a tangent when other things occurred to him before looping back round to the original story (or sometimes not!), so the book is a good reflection of his style and really brought him to life for me.I could hear his voice telling these familiar, and some unfamiliar, stories very clearly. Parts of it made me laugh out loud and I had to keep stopping to read bits aloud to The Irishman who kept asking me what I was laughing at. It was a book that really cheered me up during this lockdown. However, it is not the same as watching Billy perform, and you realise how much his expressions and gestures and movements added to the comedy of his story-telling. The ‘Wildebeest’ example illustrates this best. It is many people’s favourite story of Billy’s, but it just isn’t as funny when you can’t see him doing the vacant expression of the wildebeest and the actions of the lions as they plan their attack.Overall, I really enjoyed reading this but it can’t replace Billy’s performances, and I for one will miss him terribly. I wish I could have met him in real life just once before Parkinson’s started to take effect. I’m sure it would have been great craic.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3203139745", "review_id": "3203139745", "date": "Mar 03, 2020", "rating": 1, "user_name": "Caleb", "user_url": "/user/show/82558681-caleb", "text": "The whole opening of the book leads you to believe that these are the stories that Billy really wanted to share and how important writing this book was.Its actually just a transcript of a bunch the Billy's comedy, which i feel takes away a lot of the fun of these humorous tales when you have to read misspelled words instead of hearing Billy's strong Scottish accent, or reading the gestures he did instead of seeing them. And not being surrounded by a laughing audience means that when one of these tales doesn't elicit a chuckle, you just sit there in the awkward silence this book invoked into the atmosphere and question where it's worth trying for another. A few chuckles did arise, but they were few and far between, to the point where i decided to just cut my losses and accept that as a young straight sober not Scottish guy, I'm probably not the target audience for this comedy or this book.", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3136439355", "review_id": "3136439355", "date": "Feb 11, 2020", "rating": 5, "user_name": "BeccaJBooks", "user_url": "/user/show/69224787-beccajbooks", "text": "Ah Billy Connolly is just such an icon. His comedy is timeless and classic. I have loved watching his stand up over the years on TV and once had tickets to see him live - which I so regret not being able to use. This book is a collection of small stories from his life, some we've heard before, some new. I found myself reading it in my head using his voice and I think this made it so much funnier. Please read this if you are a fan. Even if you aren't, you will probably enjoy it nonetheless.https://thebeautifulbookbreak.com", "num_likes": 3, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3106813299", "review_id": "3106813299", "date": "Jan 18, 2020", "rating": 4, "user_name": "Jamie Bowen", "user_url": "/user/show/27180091-jamie-bowen", "text": "Now that Billy has retired from stand up comedy, he’s finally been persuaded to write down some of his more well known stories. I was reading this and I had his voice in my head, and I was having to stifle laughter when reading this not to wake anyone up. Very funny stories and a great read.", "num_likes": 2, "sort_order": "default", "shelves": ["2020"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4143681214", "review_id": "4143681214", "date": "Jul 30, 2021", "rating": 5, "user_name": "Liz Mistry", "user_url": "/user/show/56738723-liz-mistry", "text": "Found myself peeing myself laughing at this one. I love Billy Connolly and this was just the ticket for a lockdown read to dip in and out of. I could visualise him delivering the lines and could hear his voice. I defy you not to grin like an idiot when reading this. LOVED IT!", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3741193531", "review_id": "3741193531", "date": "Feb 18, 2021", "rating": 3, "user_name": "Sarah", "user_url": "/user/show/121928259-sarah", "text": "So, if you're likely to be offended by the swearing, you may as well fuck off now.This is pure Billy. But it's one-dimensional.If watching Billy is like eating a delicious 3-course meal, then reading this book is like looking at the menu. ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3783374184", "review_id": "3783374184", "date": "Feb 13, 2022", "rating": 5, "user_name": "Chelsea Foster", "user_url": "/user/show/123827343-chelsea-foster", "text": "“…and laugh. Always look to laugh. Nothing else will ever keep you going like laughter.”No surprise but I laughed out loud the whole way through. ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3026796663", "review_id": "3026796663", "date": "Oct 30, 2019", "rating": 4, "user_name": "Celine Godfrey", "user_url": "/user/show/36964894-celine-godfrey", "text": "I love Billy Connolly! Always have, always will. First came to know of him whilst growing up outside Glasgow and my mum not allowing me to watch him on TV or listen to him on radio. And of course, being forbidden made me secretly seek him out. My first time seeing him on stage was in Bournemouth in the early 80s and some of the audience walking out!! He actually addressed me a couple of times cos he told some jokes that Glaswegians (or near enough) would REALLY get, so I was in hysterics and pretty obvious.Last time was in 2016 on his High Horse tour where the effects of Parkinson's was obvious, mostly because he pointed them out and made jokes about them! So having this book is great if you're a fan of the man and his legendary comedy. I've also watched him on TV interviews, his Audience With shows, listened to radio interviews, watched his movies (he's also a terrific actor) so many of the stories/anecdotes, I've heard before. Some remembered more than others and some I'd forgotten, but the way he writes them, you can visualise him performing it and hear his voice saying it, and they were just as funny as the first time I'd heard them .... and some even moreso. He really is a fabulous raconteur and, as he says himself, he's not really a joke teller as such, just shares his brilliant observations of and opinions on life, love, sex, rules, \"beige\", acting, his childhood and much, much more. It's been a while since any book made me laugh out loud (even whilst in bed reading at stupid o'clock in the morning when I didn't want to put it down)!A really easy, hilarious read. I'd give it a 4.5 out of 5.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3027099946", "review_id": "3027099946", "date": "Oct 27, 2019", "rating": 5, "user_name": "Colin Murtagh", "user_url": "/user/show/15240416-colin-murtagh", "text": "I grew up listening to Billy, I remember hearing the jobby weecher and the Crucifixion on records my elder brother would play while I was still in short trousers. He's been a part of my life for that long, and now he's retiring from the stage. But it's not all bad news, for he leaves us this, a collection of all his best stories, but written down. Given how much I've heard from him, anything I read, I hear in his voice, which when you include the sex noises is a little weird. He's the finest comedian Scotland has ever produced, this shows why.", "num_likes": 2, "sort_order": "default", "shelves": ["humour", "biography"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3604231851", "review_id": "3604231851", "date": "Nov 28, 2020", "rating": 5, "user_name": "Marc", "user_url": "/user/show/106893361-marc", "text": "I have had this book on the “to read” list for awhile now but it was the announcement that Billy Connolly will be streaming his “farewell” soon on TV which made me pick it up and I am ever so glad I did. A hilarious collection of Connolly’s stand up performances which are able to be enjoyed in written form without loosing any of their power.As a fan I was able to easily imagine him telling these stories as only he can, prancing and jumping around and found myself laughing out loud on more than a few occasions. ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3133142450", "review_id": "3133142450", "date": "Jan 09, 2020", "rating": 5, "user_name": "Jill", "user_url": "/user/show/22191795-jill", "text": "Bloody Brilliant. I was so lucky to have seen Billy perform live. It’s so sad that he’s given up live shows but this book captures some of my favourite stories and it’s a book I know I will read again and again and continue to laugh out loud!!!! ", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3119231010", "review_id": "3119231010", "date": "Jan 06, 2020", "rating": 3, "user_name": "John Stevens", "user_url": "/user/show/31808668-john-stevens", "text": "Always liked Billy Connolly but his humour, for me, is better live. The book covers a lot of stories that people, who like Billy Connolly, will already be familiar with.", "num_likes": 2, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3379804692", "review_id": "3379804692", "date": "Jun 07, 2020", "rating": 5, "user_name": "Laurie", "user_url": "/user/show/1050800-laurie", "text": "There is no plot to this book, but that’s okay. Connolly is one of the funniest people I know of, and his style of funny is not jokes or terse anecdotes; he starts talking about one subject, veers off in a Grandpa Simpson way (except the detour actually has a point), goes back to the main thread, veers again, finally gets to the end, in the process saying “f***” about 500 times and bringing sex into the story at least once. By the time I get to the end of the story, I’m lying on my side, tears running down, gasping and wheezing and trying not to wake my husband, because I stayed up a good deal of the night reading, unable to quit. So, yeah, I liked the book. I wish I could have seen Connolly perform live, but at least I’ve seen him on TV enough that, as I read the book, I heard it being told in his voice.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3613630855", "review_id": "3613630855", "date": "Nov 02, 2020", "rating": 5, "user_name": "Ilse Wouters", "user_url": "/user/show/19428868-ilse-wouters", "text": "When I did my PhD in West Yorkshire, I discovered Billy Connolly and I bought some tapes of shows of his, which made loads of trips very enjoyable indeed. And so, my husband surprised me with this book last week, and I just needed to read it immediately! Because of the tapes I even imagined the text as read by BC himself ;-) A lot of the stories I already knew, but most of them are just brilliant and I keep on laughing, even if I hear/read them for the 50th time. But there´s also some lesson to be learned, and I quote \"Acting your age is about as sensible as acting your street number. You can volunteer to take life seriously, but it´s going to get you anyway. it´s going to win against you in the end. It´s harsh, and you an either break down and complain about how miserable your life is, or you can have a go at it and survive. ... And laugh. Always look to laugh. Nothing else will ever keep you going like laughter.\" AMEN", "num_likes": 0, "sort_order": "default", "shelves": ["in-english", "humour"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3265389992", "review_id": "3265389992", "date": "Apr 17, 2020", "rating": 4, "user_name": "Ellie", "user_url": "/user/show/107992231-ellie", "text": "A half autobiography, a half story book!This is a book full of what I can only presume is Billy’s content when he used to be up on stage making people laugh out loud, which the book makes you do as well.You get glimpses of his life through stories and funny moments made all the more real by the Scottish words heavily sprinkled throughout. All in all and I credibly enjoyable story book - lots of swearing though so perhaps if that’s not what you enjoy it may not be as enjoyable for you. As a Scottish gal myself it doesn’t bother me in the slightest.The only thing I really didn’t like was that anytime he was talking about a noise, he spelt it out in full: eg ahhhhhhhhhhhhhh and honestly I HATE this 😂 I never hear a noise just see lots of letters, but that’s personal to me so probably won’t be an issue for anyone else!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3250279413", "review_id": "3250279413", "date": "Apr 20, 2020", "rating": 3, "user_name": "Simon Sweetman", "user_url": "/user/show/5869783-simon-sweetman", "text": "Every time I didn't think this worked at all I was suddenly cracking up at a familiar routine and hearing his voice - of course. The Big Yin. A gem. So many gems here. But still, it's not like seeing him live, nor reading his thoughts not meant for a stage, nor even watching a DVD or stream of his best live content. But it's a nice thing to have and hold dear as his life moves on its later stages. He's a legend and there's some great stuff here. That said, sometimes you cringe at the context-less or dated set-ups for rather flat punchlines too; the burden of 'reading' material that was shaggy-dog even if crafted, the burden of having an oral tradition tapped out on a computer for some sort of extra posterity. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4211031656", "review_id": "4211031656", "date": "Sep 12, 2021", "rating": 3, "user_name": "Jim", "user_url": "/user/show/5041353-jim", "text": "I'm a great fan of Billy Connolly the comedian, a lot of the stories in this selection, he has told on stage. Now he has retired from stand up as he has Parkinson's Disease, he is also in his late seventies. What works on stage doesn't work as well on the printed page. Live you would be hard pressed to find a funnier comedian, but it is not just the material; it is his unique delivery, the reaction to the audience and his reaction to their reaction which makes it hilarious. We are social animals, at a comedy club, we often laugh because those around us are laughing but when reading alone we rarely laugh out loud. Billy Connolly has an absurd take on life, which is amusing but works so much better on stage. ", "num_likes": 0, "sort_order": "default", "shelves": ["comedy", "short-story"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4249484763", "review_id": "4249484763", "date": "Sep 23, 2021", "rating": 3, "user_name": "Aled Owen-Thomas", "user_url": "/user/show/54299173-aled-owen-thomas", "text": "I wasn't going to read this but I got it as a gift. The thing is if you're a huge Billy Connolly fan (and I am) then the book is a bit pointless. You've already internalised the contents. The book comprises of transcriptions of his act over the years. I've been watching his DVDs since I was 14, so I skipped over most of the pages due to already knowing what was written in them.Having said that, there was still some stuff that was new to me, I still laughed a good bit, and the final chapters are rather touching. I'm still glad that I read it and I definitely don't begrudge Billy for the book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3887839491", "review_id": "3887839491", "date": "Mar 13, 2021", "rating": 5, "user_name": "Mary Wilson", "user_url": "/user/show/12667629-mary-wilson", "text": "It is a lovely book which I will treasure not just for all the stories, most of which I have heard several times but also about his whole approach to this book; he states that you can read it in his voice and I did, every word plus it's the twinkle he has in his eyes when he relates them, I could see that twinkle with every tale. I have loved Billy since the first time I saw him many years ago on a black and white telly - yes, that long ago on Michael Parkinson's show.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4144943862", "review_id": "4144943862", "date": "Oct 04, 2021", "rating": 3, "user_name": "Marcus Vetrano", "user_url": "/user/show/100934110-marcus-vetrano", "text": "A few good chuckles here and there. Started off good, middle was pretty bland and boring. But the end jokes were pretty damn good. I was going to rate it 2 stars but the last 100 pages were great. All of it was just just the same material from his live stand ups, so some of it wasn’t as good for me because I’ve already heard em a hundred times, but all in all, this book gave me a good chuckle. Wasn’t as good as I had hoped, but turned out to be okay in the end. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3414748013", "review_id": "3414748013", "date": "Jun 28, 2020", "rating": 5, "user_name": "Kieran McAndrew", "user_url": "/user/show/35270742-kieran-mcandrew", "text": "This collection of anecdotes and set pieces from the decades of Billy Connolly's stand up musings should be read carefully on the understanding that there will come at least one wee story which sneaks up on you and causes the laughter to explode out of your nostrils at the least appropriate time.Best read on a bus or train while surrounded by unaware commuters.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3742146156", "review_id": "3742146156", "date": "Jan 24, 2021", "rating": 5, "user_name": "Cathal Kenneally", "user_url": "/user/show/31913163-cathal-kenneally", "text": "HilariousFunny from start to finish. Because l have seen a lot of his shows, I know about 70% of the stories in this book. It's the fourth book, either featuring Billy Connolly or written by him that I have read. Anyone who liked a good laugh and can see the world through his eyes will not be disappointed. If you are easily offended this may not be the book for you. Like many great comedians he gives it straight. People sometimes don't like that. Otherwise it's a great read. ", "num_likes": 0, "sort_order": "default", "shelves": ["2021-reading-challenge"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3929028810", "review_id": "3929028810", "date": "Apr 06, 2021", "rating": 3, "user_name": "Ray Smillie", "user_url": "/user/show/127467550-ray-smillie", "text": "Very much a retelling of his funniest monologues, in print format. Now there were observations that I hadn't seen/heard before which did make me laugh out loud but this is probably best for those not familiar with the big yin. Not for the easily offended which I am not. Particularly enjoyed the dwarf story which was a new one to me.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3160167886", "review_id": "3160167886", "date": "Jan 25, 2020", "rating": 4, "user_name": "Victor", "user_url": "/user/show/7807897-victor", "text": "Just a short note... when reading this book, and I did read it in one day, you will hear Billy’s voice constantly (at least if you ever watched one of his live shows)I love his stories, I love his style! I love this book!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3171399269", "review_id": "3171399269", "date": "Feb 20, 2020", "rating": 4, "user_name": "Paul Irving", "user_url": "/user/show/107977601-paul-irving", "text": "A pleasure to read and 'hear' his voice in all the stories, familiar and new. For an ex-Glaswegian (if you can ever be) it was partly a road trip in memories and partly just an interesting perspective as always from Billy.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3829848039", "review_id": "3829848039", "date": "Feb 11, 2021", "rating": 3, "user_name": "Debbie", "user_url": "/user/show/102046680-debbie", "text": "Loved Billy’s Wee Stories at first, then got a little bored towards the end of the book. Not sure why? But I obviously finished the book. Don’t like to not complete a book. On the whole, glad I read it for Billy.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3968535066", "review_id": "3968535066", "date": "Jul 12, 2021", "rating": 3, "user_name": "Fiona Mccreath", "user_url": "/user/show/19415402-fiona-mccreath", "text": "I have always loved Billy Connolly. However, I don’t think most of this material reads well. For it to be really funny requires his brilliant delivery and physical presence. It just (mostly) made me want to watch his old shows. Strong ending though.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4369456668", "review_id": "4369456668", "date": "Dec 22, 2021", "rating": 5, "user_name": "Rebecca", "user_url": "/user/show/31555479-rebecca", "text": "Don’t read in public! I absolutely loved this book. I laughed my way through it. At times I had to put it down I was unable to continue reading for laughing! Definitely one to dip into if you need cheering up. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3143018342", "review_id": "3143018342", "date": "Jan 30, 2020", "rating": 5, "user_name": "Lawrence Paterson", "user_url": "/user/show/55756914-lawrence-paterson", "text": "I love Billy, so this was great for me. A collection of short stories, just like he is on stage :)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3107673438", "review_id": "3107673438", "date": "Mar 14, 2020", "rating": 4, "user_name": "Robert Turner", "user_url": "/user/show/107486005-robert-turner", "text": "Great but you had to see him live", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3308169106", "review_id": "3308169106", "date": "May 18, 2020", "rating": 5, "user_name": "diane fletcher", "user_url": "/user/show/75390691-diane-fletcher", "text": "Really enjoyed this with some laugh out loud tales ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3279040911", "review_id": "3279040911", "date": "Jun 30, 2020", "rating": 4, "user_name": "Heather", "user_url": "/user/show/7811484-heather", "text": "4.5. A treasure, full of my favorite stand-up routines Billy Connolly has ever done.", "num_likes": 0, "sort_order": "default", "shelves": ["books-i-own"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3794012797", "review_id": "3794012797", "date": "Mar 30, 2021", "rating": 5, "user_name": "Andy Martin", "user_url": "/user/show/14025721-andy-martin", "text": "Excellent read. It's mostly his stand up stuff but who cares? Brings back memories of seeing him live and all you have to do is imagine it's Billy himself reading it to you.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4331562906", "review_id": "4331562906", "date": "Nov 10, 2021", "rating": 5, "user_name": "Lucy Visocchi", "user_url": "/user/show/142684352-lucy-visocchi", "text": "I absolutely loved this book. Just lots of wee stories and what’s more I read the whole thing in Billy’s accent. Great story teller and all round legend", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4524684187", "review_id": "4524684187", "date": "Feb 21, 2022", "rating": 3, "user_name": "Will", "user_url": "/user/show/12132037-will", "text": "It was alright. I mainly read it because of a negative review on Amazon. Someone was appalled by the language and, yes, there is swearing in it but nothing too over the top. The style did wear after a while. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3445547794", "review_id": "3445547794", "date": "Jul 18, 2020", "rating": 4, "user_name": "Anne-marie", "user_url": "/user/show/10845944-anne-marie", "text": "And now for something completely different for me to read! At the outset, Billy Connolly states that ‘he writes like he talks’ and he really does. This book is laugh-out-loud funny; deep aching belly laughs. His comedy translates well to the written format. Connolly is a master of mixing unrelated topics and infers great humour from mundane life activities. I did not realise that his performances are totally unscripted (he only takes a short list of topics on stage) and he leverages his ‘list’ to see what direction his stories can go in, generating variety within his story telling. He follows where his brain takes him; a kind of stream of consciousness or improvisation approach. Overall a great read and a deep insight into a great mind.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3751750810", "review_id": "3751750810", "date": "Jan 06, 2021", "rating": 5, "user_name": "Mike Jennings", "user_url": "/user/show/21981612-mike-jennings", "text": "Can't go wrong with this one. Started it last night and was shaking with laughter (in bed) within a page - really. I think I was annoying the Wife with my shaking cos she's trying to read history, but I couldn't help it, every second sentence paints a funny image. Impossible to read with anything other than Billy's voice in your head, which just makes it more entertaining. This guy will be such a sad loss when he goes.Finished it now, and the strange thing is that if you force yourself NOT to hear Billy's voice as you're reading, then it isn't all that funny! It's his personality that makes these stories hilarious (or even poignant). The very last pages are the ones you'll remember the most: laugh as often as you can and don't worry about embarrassing yourself because \"you're a long time looking at the lid\". Aye!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3379007108", "review_id": "3379007108", "date": "Jun 07, 2020", "rating": 5, "user_name": "E.J.", "user_url": "/user/show/11969597-e-j", "text": "A collection of Billy's finest anecdotes: beautifully compiled but sadly the magic of his delivery isn't there. My head says 3 stars and my heart says 5. Today my heart wins.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3324055479", "review_id": "3324055479", "date": "Jul 04, 2020", "rating": 3, "user_name": "Dennis", "user_url": "/user/show/98498770-dennis", "text": "A good read. More of a written collection of the stories from his comedy gigs over the years. They are entertaining but it emphasises the point that it takes a good comedian to deliver a story to make them even funnier.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3765259800", "review_id": "3765259800", "date": "Jan 23, 2021", "rating": 5, "user_name": "David O'Reilly", "user_url": "/user/show/61004819-david-o-reilly", "text": "A great book indeed. I love that you can go to any page at all, & find a great story. I've never laughed like that at a book before.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4071210687", "review_id": "4071210687", "date": "Jun 21, 2021", "rating": 5, "user_name": "Zoe Urquhart", "user_url": "/user/show/33699699-zoe-urquhart", "text": "Very funny. Laughing to the last pages!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3101628941", "review_id": "3101628941", "date": "Sep 04, 2021", "rating": 4, "user_name": "Clint Banjo", "user_url": "/user/show/54697807-clint-banjo", "text": "Made me grin and giggle and at some points so funny my eyes would water and yes, get funny looks off people! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3426579466", "review_id": "3426579466", "date": "Jul 05, 2020", "rating": 5, "user_name": "Peter Wright", "user_url": "/user/show/102876979-peter-wright", "text": "Funny as ever. All The big yin's best stuff. I laughed at every page!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3863954514", "review_id": "3863954514", "date": "Apr 25, 2021", "rating": 5, "user_name": "Nikki Geary", "user_url": "/user/show/127456747-nikki-geary", "text": "I just loved this! I laughed so much whilst sitting in the waiting room for a hospital appointment that I had to put the book away as I was worried that they would wheel me off and keep me. You can really hear Billy talking to you just like during one of his shows and it leaves you with a big smile on your face. What's not to love!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3360983555", "review_id": "3360983555", "date": "May 28, 2020", "rating": 1, "user_name": "Rupert Wolfe-Murray", "user_url": "/user/show/78206240-rupert-wolfe-murray", "text": "I don't like giving this book just one star as it's nicely produced and well edited, but it's actually a bit of a cheat.What I mean by this is that all it is a collection of Billy's stand-up routines, all of which are hilarious when he delivers them on stage but they fall flat on the page. There are a few great stories but most of them are anything but; the fact that I knew most of them wasn't the problem as I can listen to him on YouTube indefinitely (in fact, I would take an audio recordings of his comedy onto my desert island).If only the publisher's had had the courage to be honest it could have made for a much better book; they could have had a preface by the editor who transcribed the material with a related commentary; or, if Billy actually did this mundane task himself, surely he'd say something about it in the intro. I've transcribed audio material before and it's really hard work, as is the editing that has to then follow.There's no clue on the cover or front matter about who did the dirty work but in the acknowledgements the first name to get a thank you (and his own sentence) is Nick Davies. Who is Nick Davies? I will ask Google right now ... it turns out he's a bigshot editor who's worked for some of the main London publishing houses. I assume he's too high and mighty to have done this transcribing task himself (maybe Billy actually did it?. Maybe one of his household minions?) What I do know is that publishers will sell their own mother to get their hands on a book by a celebrity of Billy's stature, as it's like making a sequel of a popular film -- there's a ready-made audience ready to buy it however indifferent its quality may be.This is what Nick Davies said in The Bookseller's puff piece about the book:“As his many millions of fans will know, Billy’s stories can be rude, warm-hearted, anarchic, joyful, angry, far-fetched, down-to-earth and everything in between. They are also beautifully constructed, brilliantly paced and deeply funny. I’ve written to Billy at various points over the last 15 years to ask if he would bring these stories to the printed page and I’m thrilled that he has finally agreed. Tall Tales is an absolute treat of a book that will delight readers everywhere.”In conclusion, it's important to get Billy's jokes in book form -- particularly for people like me of a Scottish persuasion. But I would have appreciated a description of how the book came together and who was the poor sod who did the actual work. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3753345255", "review_id": "3753345255", "date": "Oct 17, 2021", "rating": 4, "user_name": "Sebastian Radu", "user_url": "/user/show/12399672-sebastian-radu", "text": "3.5This was jolly good fun. It's got a lot of hilarious stories from Billy, classic bits from his stand-up, amazing folk tales and jokes. The thing is, Billy is a riot when telling these tales and they really come to life when he's enacting them, so by only reading them you don't get as much from them. Nevertheless, they're written in his style so you can almost hear him when reading. Great book for any Big Yin fan.", "num_likes": 0, "sort_order": "default", "shelves": ["shorts", "autobiographical", "british-isles"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3676184566", "review_id": "3676184566", "date": "Dec 07, 2020", "rating": 5, "user_name": "Vicki", "user_url": "/user/show/5694994-vicki", "text": "There was many occasions while reading this book where the dog looked at me strangely as I was laughing out loud so much I occassionally snorted. If you love Billy Connelly you'll love this book, there are some stories you'll recognise (scratchy wool and balaclava) and lots of new ones. 🤣🤣🤣", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3064158560", "review_id": "3064158560", "date": "Dec 08, 2019", "rating": 3, "user_name": "Allan", "user_url": "/user/show/12202864-allan", "text": "I laughed out loud (not the kindle edition but a real book).", "num_likes": 0, "sort_order": "default", "shelves": ["2019"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3857996808", "review_id": "3857996808", "date": "Mar 04, 2021", "rating": 5, "user_name": "Natalie Liddle", "user_url": "/user/show/2715513-natalie-liddle", "text": "More stars required - without doubt the funniest book I’ve ever read and I know already that I will re-read it. What an absolute legend. Laughed out loud throughout this book, laughing thinking back and I know I’ll continue to laugh. Mission accomplished Outstandingly good. Everyone should read this - in case you can’t tell I LOVED this book ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3037382241", "review_id": "3037382241", "date": "Nov 16, 2019", "rating": 5, "user_name": "David", "user_url": "/user/show/50843461-david", "text": "Brilliant !Funniest book I've read in ages. Although probably helps if you can \"ken a wee bittae Scottish\".", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4099203882", "review_id": "4099203882", "date": "Jul 31, 2021", "rating": 3, "user_name": "Scott", "user_url": "/user/show/85241103-scott", "text": "This was fun with many of Connolly's classics (Christmas Dinner, Dwarf on the Bus, etc.). I found it to be a slow read, though, as it was necessary to hear his voice in my head as I read. I wouldn't recommend it to anyone without any familiarity with his stand-up comedy, though. It also helped to read with a smart phone at the ready to look up all of the unfamiliar Scottish slang. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3037639478", "review_id": "3037639478", "date": "Nov 13, 2019", "rating": 4, "user_name": "Stephen", "user_url": "/user/show/4809022-stephen", "text": "A very light and amusing read featuring all his classic stories. Not quite the same as watching him tell them in the hilarious way that he does but still great fun.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3275999790", "review_id": "3275999790", "date": "Apr 12, 2020", "rating": 1, "user_name": "Nigel", "user_url": "/user/show/4578016-nigel", "text": "I've always liked watching Billy Connolly's stand up. He doesn't tell jokes as such. His humour is primarily observational with the addition of his own style of speaking and the language of the Clyde shipyards. On stage over the years that worked. In my opinion this does not transfer to the written form. This book is just a collection of the stories he has told over the years interspersed with some rants about modern life. These rants made him sound like Jeremy Clarkson, a comparison which I am sure Connolly would hate. I got the feeling that much of the material was just transcripts from his shows, collated and then printed as a book. When I read them, one after the other, most of them were not funny.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3019329069", "review_id": "3019329069", "date": "Dec 15, 2019", "rating": 5, "user_name": "Margaret", "user_url": "/user/show/10716214-margaret", "text": "After retiring from doing live shows at the end of last year, Billy Connolly was persuaded to put pen to paper and write some of his stories down.It says something about how may times I have seen the Big Yin on stage that I was familiar with the majority of the stories in the book.Still didn't stop me laughing until I was breathless and crying.", "num_likes": 0, "sort_order": "default", "shelves": ["humor"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3120900749", "review_id": "3120900749", "date": "Jan 05, 2020", "rating": 5, "user_name": "Linda", "user_url": "/user/show/407712-linda", "text": "I have never laughed so much as when I read this book. It’s inevitably read in Billy’s voice and his mad accent and take on life with sound affects to boot. Not so much a tale of his life but many hilarious anecdotes and wee stories. Some apparently true. This is one for the real fan. I bloody loved it!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3450840146", "review_id": "3450840146", "date": "Jul 19, 2020", "rating": 4, "user_name": "Emma Maclean", "user_url": "/user/show/28468694-emma-maclean", "text": "I read this book in a day, very nearly in one sitting. It’s been years (honestly about 15!) since I read “Billy” by his wife Pamela and I had reservations that this wouldn’t add much. Boy was I wrong. Having never been lucky enough to see Billy perform live this is probably the closest I will come, you can hear his voice as you read the anecdotes which I feel really adds to them. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3026535517", "review_id": "3026535517", "date": "Oct 26, 2019", "rating": 5, "user_name": "Stuart Chambers", "user_url": "/user/show/10161735-stuart-chambers", "text": "I love Billy Connolly, always have, always will and what a class act Billy really is. This is the best of the very best of the big man's, tall tales and wee stories as he told them on stage. Great reading, great man, great heart", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3101097092", "review_id": "3101097092", "date": "Dec 26, 2019", "rating": 5, "user_name": "Alice Chau-Ginguene", "user_url": "/user/show/19609738-alice-chau-ginguene", "text": "If you are a big of Billy, you probably have already heard of the jokes in this book on video or live. But still, it is a great experience to see all the famous jokes all line up together. If you are a fan of Billy, read this book, you will have a great laugh. (As always) ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3021270727", "review_id": "3021270727", "date": "Oct 26, 2019", "rating": 5, "user_name": "Tina", "user_url": "/user/show/9322342-tina", "text": "🙌Such a class act. Chuckling all the way through. Some proper classic tales and jokes in this book. Big Connolly fan? Then this is a must have 😂😊.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3020244388", "review_id": "3020244388", "date": "Oct 26, 2019", "rating": 4, "user_name": "Teresa", "user_url": "/user/show/4398812-teresa", "text": "A collection of some of his best stories. Not as good as seeing the man perform them but the next best thing. If you love Billy, you'll love this book.", "num_likes": 0, "sort_order": "default", "shelves": ["biography"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3114662433", "review_id": "3114662433", "date": "Feb 12, 2020", "rating": 4, "user_name": "Stuart", "user_url": "/user/show/92191902-stuart", "text": "Great to read through some of the classic Connolly stories, very funny ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3833765867", "review_id": "3833765867", "date": "Feb 28, 2021", "rating": 5, "user_name": "Terri Stephen", "user_url": "/user/show/91503986-terri-stephen", "text": "Absolutely brilliant. I had tears in my eyes and down my cheeks from laughter. Just a great book all round. So glad I picked it up.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3853972538", "review_id": "3853972538", "date": "Feb 22, 2021", "rating": 4, "user_name": "Brendan O'Brien", "user_url": "/user/show/8470613-brendan-o-brien", "text": "I think I’ve read and seen everything Billy Connelly’s ever done, so I’m well aware that he regularly pebbledashes his audience with copious amounts of colourful language. So I was surprised to find myself disturbed by his liberal use of the F word right from the start of his book. In fact on the first page he actually says if you don’t like the F word you can F off right now. Of course this might be because my ten year old granddaughter bought the book for me at Christmas and wants to borrow it, so maybe I was just a prudish grandad being over protective. Anyway, once I got over that hurdle I drove Jennifer mad with sudden outbursts of raucous laughter that got me confined to the conservatory, and I realised I wasn’t actually reading the book - I was hearing Connolly saying it loud and clear in my head as he strutted up and down the stage. Of course the stories are the same ones he’s told many times before, but as some comic used to say, it’s the way he tells them. Having been brought up on the west coast of Ireland in a small terrace house with outside toilet, three brothers and four sisters, I can relate to Connolly’s stories of his childhood in Glasgow. The story of the kid in bed shouting down that Eamon has his foot stuck in the sleeve of the overcoat, and the mortified mother shouting back in front of the visiting priest that it isn’t an overcoat, it’s an eiderdown had done the rounds in our town long before Connolly made us howl with laughter at it. I was even slapped around the head one evening by an inebriated neighbour who thought I was one of his and I should be at home in bed. Great days. The fact is, if you like Connelly you will love this book. But brace yourself – it’s a bumpy ride.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4408709019", "review_id": "4408709019", "date": "Feb 09, 2022", "rating": 3, "user_name": "David Campton", "user_url": "/user/show/6132768-david-campton", "text": "Largely read this during a period of covid-related self-isolation, when the short \"chapters\" was all I could concentrate on and the humour was a necessary tonic. Indeed some of the stories were laugh out loud funny... causing physical pain to my ribs which were already sore from coughing... Others were probably as funny, but I had either heard them before on old recordings of his gigs (on LPs - yes I am that old) and his TV appearances, or read them in his earlier \"Unauthorised Biography\". His material was never politically correct, even in the days before such a thing was unheard of... he always navigated the line of what was \"acceptable/shocking\" frequently crossing it... But there was never any overt sense of malice in his earlier material... even the cack-handed \"Last Supper/Crucifixion\" story that doesn't come across well on paper, without his distinctive delivery. He was never a \"political\" comedian... he usually found humour in the ridiculous, and especially the ridiculous that we accept as normal. However, some of his later material, perhaps in the light of the PC/woke climate and the reaction against that by some, comes across as lazily reactionary. He sees the PC/woke agenda as \"beige\" but instead of taking on substantial examples of this he focusses on reversing beepers on bin-lorries and ambulance being printed back to front on the front of said vehicles. Sadly this merely comes across as him as a relic of a former age raging at a world he doesn't feel part of any more... which is frustrating given that I too am a relic of that former age in which he was a giant. Indeed THE Big Yin.", "num_likes": 0, "sort_order": "default", "shelves": ["humour"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3646285843", "review_id": "3646285843", "date": "Nov 15, 2020", "rating": 3, "user_name": "Greenockian", "user_url": "/user/show/2839087-greenockian", "text": "Moaning about Billy Connolly will win you no friends apart from those of the Mary Whitehouse, Christian Fundamentalist persuasion who probably think he should be hung, drawn and quartered for having the audacity to swear and make fun of the whole religion and sex shebangs. My granny first cast some doubt in my fledgling mind many years ago when I told her I thought Billy was hilarious. \"Son,\" she said, \" Ah went tae see him at the Toon Hall. He wiz funny fur a while but Ah goat fed up wi' some o' the language. Ah tellt him tae. Ah said tae him, Billy, ye' kin be funny withoot aw the swearing. So, he stopped whit he wiz dae'in and said tae mi: Whit did you come fur if yi don't like ma swearin'? Ah said, that's no the point. Try no tae swear sae much: it's awe F this and F that wi' ye. Och c'mon on , he said, ye knew whit Ah wiz like before ye' came the night. Billy, Ah said, ye' should stick tae the banjo - sometimes yer patter's rotten\".And indeed, sometimes his patter is rotten: several of these stories fall very flat and probably come from his mid-Transatlantic-trying-to-please-Americans years. Personally I like Billy when he swears - it's earthier and more real. The softer stuff about grey pubic hairs and prostates just doesn't do it for me. Much better are the jobbie wheechers and Jesus sliding on dog shit - now that is REAL Glasgow humour.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3784437516", "review_id": "3784437516", "date": "Jan 30, 2021", "rating": 5, "user_name": "Alan Marston", "user_url": "/user/show/8502399-alan-marston", "text": "For those familiar with Billy Connolly and his way of telling his stories, complete with arm waving and wandering about on stage, this book revisits a great many of those stories. As he reveals in his introduction, sometimes he doesn't know exactly what he will talk about during his stand up sessions, but has perhaps a list of what might occur. The stories frequently ramble with many asides and digressions, as well as sound effects that the readers have to put in for themselves, but they are a true reflection of his stage performances, and for those who have seen those performances, the imagination will kick in and you can envisage him gesticulating and generally enjoying himself with his audience. Many of the stories involve rants that become increasingly amusing, and every story ends with some sort of punch line, but, as Billy himself says, he dose not actually tell jokes, he makes his stories amusing.For those not familiar with Billy Connolly, a word of warning. Billy believes that Keith Tynan did the English language, and television, a great service by being the first person to ever use the F word on television. According to Billy this was a liberating event, so much so, that he enjoys using that word quite liberally in both his stage appearances and this book. If you are easily offended, then this book is not for you. If you believe yourself to be broadminded, then you may well enjoy the ramblings of a truly amusing, and well informed, Glaswegian.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4065924219", "review_id": "4065924219", "date": "Jun 18, 2021", "rating": 3, "user_name": "Paul Whitla", "user_url": "/user/show/105301492-paul-whitla", "text": "I have never really been a big 'fan' of the Big Yin, although i do like him and do watch his concert movies whenever i happen to see them. I think he is indeed one of the great humourous story-tellers of the past fifty years and have huge respect for his abilities as an entertainer.This book is maybe not the best though, it does seem to be a word for word retelling of some of his stand-u stuff, much of it available on the concert movie 'high horse'. I am pretty sure that the book is a very slightly edited transcription of those routines as I doubt that these are 'scripts' that BC stuck to in his stand-up performances. To be honest, the material doesn't come across as well in book format as they do live, BC's huge personality (even in the afore-mentioned concert video where he was clearly limited in movement) is such a par of the stories - the delivery, the way he tells them - don't always come across when translated to the page.Of course there is some funny stuff here, how could there not be? And for many readers they will indeed laugh out loud. sadly there is some rather tired old stuff too - complaints about people using cellphones for example. The book has been marketed as the best of BC, but really the best is the live performances - stick to those, enjoy and laugh along.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3286922952", "review_id": "3286922952", "date": "Apr 29, 2020", "rating": 4, "user_name": "Tony Nielsen", "user_url": "/user/show/4759853-tony-nielsen", "text": "In December 2018 after years of dominating stages around the world for decades Billy Connolly announced that he was retiring from that part of his repertoire. The onset of Parkinson's disease which he was diagnosed with in 2013 had done what hecklers hadn't been able to.His career began in the 1960's and evolved into a unique presentation of monologues that often changed on the way through and never were the same from night to night. It made him a star, in spite of his fondness for intemperate language.What Tall Tales and Wee Stories sets out to do is to bring some of those very funny monologues to life on the page. If you can longer catch Billy performing then bringing the best of his very funny stories to you is definitely the next best thing.For a man who never wrote scripts Billy Connolly never seemed to be anything but spontaneous and highly entertaining. If you missed out on seeing one of the best comedians grabbing his audiences night after night, then this book is for you. Equally if you've had the pleasure of catching him live you might recognise some of these wee tales.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3300134088", "review_id": "3300134088", "date": "May 04, 2020", "rating": 3, "user_name": "Liz Chapman", "user_url": "/user/show/11534582-liz-chapman", "text": "The first part of this book had me laughing until I cried! Billy was his usual self and the Party story .... don't get me started or I won't stop laughing again. So far so good . Then a few stories some of which I'd heard quite a few years before and then the book went down hill. The F word was used in practical every sentence . Yes I know he warned us in the beginning of the book but this just became a bore . The last few stories just sound like an old man having a rant at our expense and it was off putting and rather dirty old man stuff .it seems unless you are some kind of weirdo , pervert or alcoholic Billy looks down on the rest of us and would probably tell you to F off if he saw you. Beige I understand that one , we have all met a BEEEIGEE person who has bored the socks off us , but he implies that 99% of us are rather below his standard . That is not acceptable. The last stories about his illness might have made me think more empathetically but the previous rants swearing and rather weird schoolboy dirty stories left me to a degree rather uninterested. Perhaps the last bit of the book was down to his illness as it was certainly different to the first half .", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3161486880", "review_id": "3161486880", "date": "Jan 26, 2020", "rating": 4, "user_name": "Cee Jackson", "user_url": "/user/show/45777756-cee-jackson", "text": "It's not possible to say anything bad about Billy Connolly. He's a national treasure.This book recounts many of the tales he has used in his stage shows over the years. So as a fan from his first double album 'Solo Concert' recorded in 1974, many of the stories were familiar to me. And for that reason only, did I not give this book the full 5 star rating.But there are still some priceless tales in here that will make you laugh out loud - especially if as Billy suggests at the start, you read the book in his accent. (Actually - try NOT to ... it's impossible!) :-DThe short tale of the Wildebeast is a case in point. Hilarious!Even though much of this is not new material, it is still an great read, and in fact, I love the idea of having the source of so much mirth being committed to written form.The words and humour will never leave.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3226839831", "review_id": "3226839831", "date": "Apr 15, 2020", "rating": 4, "user_name": "Caity", "user_url": "/user/show/28424883-caity", "text": "Billy released this book upon his retirement from stand-up comedy at the end of 2018. It’s a compilation of his best stories from his long career on stage, and it does what it says on the tin. It’s a very comforting read for long-time fans, although we all know his comedy is best in videos where he’s performed live. I very much enjoyed reading some old favourite stories that I’d nearly forgotten about, like when he got stuck doing yoga or got lost after his rental car’s GPS “got mad at him” for missing his turn and stopped working. Favourites from my childhood.He seems to acknowledge at the end of the book that he’s in his final years now as his health declines, which made for a bit of a heavy ending, but also a positive one. He’s at peace with his Parkinson’s and is happy with how he has lived his life, and he wants everyone to just keep laughing. What a special guy.", "num_likes": 0, "sort_order": "default", "shelves": ["owned-books", "read-in-2020", "non-fiction-memoir"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3646159356", "review_id": "3646159356", "date": "Dec 11, 2020", "rating": 1, "user_name": "Aude Moraux", "user_url": "/user/show/123019186-aude-moraux", "text": "Not for me,I bought this book because I saw some of his performance on video and wanted to get to know more of a native Scottish view on Scotland before visiting, you know trying to relate a little.. I smiled through the first pages and then tried really hard to read past the first 1/3, but as a non-native English and not familiar with the Scottish language, I was quickly disconnected not knowing the references and not understanding all the expression. Plus, some stories were so unreal that I had a hard time believing it really happened..Hence, it is difficult for me to give a rating as I would say that this book was just not for me in the first place and I will keep on laughing at his video performance when I cross some but try to relate with Scotland vision of another author writing more in a Queen's English language type.. ;) Sorry Billy", "num_likes": 0, "sort_order": "default", "shelves": ["not-for-me"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3878453153", "review_id": "3878453153", "date": "Mar 07, 2021", "rating": 3, "user_name": "David Cameron", "user_url": "/user/show/76627767-david-cameron", "text": "I must start by saying that I have been a fan of Billy since I was a teenager and I have seen him perform live. I have also enjoyed him as an actor and presentor, and so I looked forward to reading this book even though I knew what to expect.Alas, I have been sadly disappointed as I believe that this is just a transcript of his performance stories and if you hoped to find out more about the man himself this is not the book for you. He speaks from the pages, but there is little to help create the mental images of the stories he tells and there appears nothing new.It is probably as much my own fault as I probably expected too much, but in reality I have heard it all before. Health and time is catching up with Billy and he will no longer perform, and so for those new to him this is a good substitute. I did find his drawings interesting and I wish him well.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4094716056", "review_id": "4094716056", "date": "Jul 04, 2021", "rating": 3, "user_name": "Paul", "user_url": "/user/show/10051523-paul", "text": "I’m not normally a fan of northern comedians, especially ones which use potty humour and tends to swear a lot. But this autobiography is quite interesting. Connolly does tend to digress a bit (of which we are forewarned) and often it takes a while to get back to the original subject. But what does come out of these musings is a long zest of a life well lived and some interesting and colourful characters found in the most common of places. And he’s never afraid to talk about his hometown roots, or anything really, as there’s rather a lot of talk about poo. But hey, it’s all natural. Everyone loves it when people lose their rag and ends up being a bit naughty, and you gain a sense that a lot of people don’t really grow up at all. It’s a good read to pass the time and you get a sense of Connolly’s lifestyle and act; but there few moments that make you want to smirk or laugh out loud. It’s probably a good idea that I didn’t go and see his act really.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4320478009", "review_id": "4320478009", "date": "Nov 03, 2021", "rating": 3, "user_name": "Tristan Sherwin", "user_url": "/user/show/48534204-tristan-sherwin", "text": "2 and half starsEver since being a lad, I’ve always found Billy to be a fascinating, down-to-Earth, humorous storyteller.Sadly, this doesn’t translate well into words in this collection. I did laugh! But mainly because I could recall Billy’s tone and mannerisms when he’s delivered some of these stories on stage. As another reviewer has said, what you have here is a transcript of oral delivery—but it doesn’t flow well enough for a reading experience, which is a real shame. Sometimes, it just feels disjoined, the “sound effects” don’t work most of the time, the expletives don’t carry any weight (and often feel like unnecessary distractions), and the tangents don’t elevate the main stories as well as they could.Hopefully, one day, someone will edit this collection and rearrange these wee stories so that they can deliver the impact that they have had when performed.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4299247003", "review_id": "4299247003", "date": "Jan 24, 2022", "rating": 2, "user_name": "David Nelson", "user_url": "/user/show/24756706-david-nelson", "text": "This didn't do much for me. I thought it would be a bit more autobiographical but it's more like a transcript of how he might tell a story at a show, and as I understand it many of the stories in this collection are actually ones he's used as material over the years. The end result frequently isn't funny at all and totally falls flat. If anything this probably highlights what a natural performer he is - a gifted story teller that uses charisma, timing and nuance that could make reading the phonebook funny. As it is it's a collection of observations and pub jokes without much punch.I'd also say a solid 5% of this is onomatopoeic noises. If there wasn't a section about his hatred for computers and technology I'd have guessed he wrote this by using Voice To Text software and just allowing it to interpret his various impressions of fart noises like \"PFFFFFFFTTTTTOOOOoooRP\".", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3173787487", "review_id": "3173787487", "date": "Feb 10, 2020", "rating": 5, "user_name": "Jak", "user_url": "/user/show/1044380-jak", "text": "Tall Tales and Wee Stories and Billy Connolly transcribing many of his best stand-up jokes/tales. As a big BC fan, this was familiar ground for me and great fun. During the books into BC that you’d read the book in his accent and I found it impossible not to do so. I also frequently ‘watched along’ as I picture his actual stand up so still got is great ‘physical’ story telling and facial expressions. I did wonder if this was hand to someone who had never seen any of his stand up if they would get just how funny many of the jokes are? I.e. half the time it was how Billy told the joke or stomped round the stage etc that added to the humour. Would what for me is a belly laugh be a wry smile for the uninitiated? Either way, I loved it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3279768960", "review_id": "3279768960", "date": "Apr 17, 2020", "rating": 3, "user_name": "Patricia", "user_url": "/user/show/55682555-patricia", "text": "Puny in Farts? Funny in parts?I have always loved Billy C, after seeing him live in 1980. His natural talent coupled with his ability to observe humour in everything is unique and wonderful. But so much of Billy’s humour is visual and that doesn’t translate easily into writing. That said, I did enjoy reading this book even though I had heard most of the stories before and some certainly don’t improve in re-telling them on paper. If Billy still feels the need to try to make his audience laugh in order to prove something to himself (or pay the tax man) then that’s sad. He certainly doesn’t need to prove anything to his audience...He is and always will be one of the funniest men to have lived. Thank you for the tall tales and wee stories. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3319214266", "review_id": "3319214266", "date": "Jun 17, 2020", "rating": 3, "user_name": "Ian Pruce", "user_url": "/user/show/94110546-ian-pruce", "text": "This is a dip in and out book. I'm glad it's not one I chose for a holiday or long flight. There are stories in the book which made me shake with laughter and others that I didn't bother finishing.The thing is, when you've seen him live on stage and you are one of hundreds of others on a night out he has the knack of telling the story that links you to life and those around you. Common understanding and you laugh at yourselves and with him. If the audience doesn't respond to his takes he knows to change or move it in a different direction.Probably, in truth, the reason I was disappointed was because of my own expectations and not because of the writing. The key thing is that I still regard him as a good laugh! Thanks Billy.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3948630050", "review_id": "3948630050", "date": "Apr 18, 2021", "rating": 2, "user_name": "Harry Burnside", "user_url": "/user/show/28245904-harry-burnside", "text": "Much as I have loved Billy's career since first seeing him and Gerry in the Glasgow Folk centre in 1968 I can only say thatthis book was mostly a rehash of material from albums, television appearances and they were good but have been round the block many times. The newer things were quite peurile. Billy seems to have a desire to tell everyone else that they are wrong and he wants to prove he is a big boy and the amount of his swearing was diabolical. It seemed like somebody who may have attended school but forgot to the English classes when he can't use the language on a higher plane.Disappointed me and the most joy I got from the book was knowing that I found the for £1 at a charity shop instead of having to pay the cover price of £20 to be so disappointed", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3957545608", "review_id": "3957545608", "date": "May 08, 2021", "rating": 5, "user_name": "Lucy", "user_url": "/user/show/17121050-lucy", "text": "Bill Connolly is, above all else, a master storyteller with incredibly funny bones, and one of my comedy heroes. I’ve listened to his records (thanks Dad), and watched his stand up on television. My only regret is the fact I’ve never seen him live. Sadly, that won’t be changing. Tall Tales and Wee Stories is a marvellous collection of some of his best sketches ever, peppered with his unique style of art. You cannot read this book in any other accent than his. Impossible. On the odd occasion I’ve put the book down (not often, I can tell you), I’ve got straight back into it. It’s put a smile on my face and raised more than a few hearty, belly laughs. I highly recommend it to anyone in need of a good chuckle. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3727397507", "review_id": "3727397507", "date": "Dec 31, 2021", "rating": 2, "user_name": "Rachel", "user_url": "/user/show/5918786-rachel", "text": "2 1/2 * The thing about Billy Connolly is it was all about his performance; his accent, the way he used his voice, his swearing, the way he flicked his hair, the way he strode around the stage. Reading this I’m almost entirely convinced that it’s transcribed from comedy routines I’ve seen on TV (surely the park the bike story was taken from his interview on Parky?) or recordings of his gigs. I don’t think for a minute that Billy Connolly sat down and wrote this out word for word at some point, or even dictated it. A lot of the material seems quite dated now, but amusing enough if you can hear his voice or remember seeing him tell the story. But not good enough to continue past 66% of the book.", "num_likes": 0, "sort_order": "default", "shelves": ["humour"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3207500854", "review_id": "3207500854", "date": "Mar 01, 2020", "rating": 5, "user_name": "Keith CARTER", "user_url": "/user/show/15485096-keith-carter", "text": "A laugh out loud rendition of Billy Connollys stand-up routine. The book flows so well and his stories appear so spontaneous. His comedy is so fresh and he obviously thrives in front of a live audience.He covers all aspects of life from his job as a welder in the shipyards of Glasgow to multiple orgasms. Connolly is a unique comedian and it is so sad that he has been diagnosed with Parkinsons disease, (which is a subject he covers in the book, with humour) but it does not get him down, as he says in his book \"thank you for laughing with me. And please keep it up\". Definitely a book worth reading. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3340779711", "review_id": "3340779711", "date": "May 16, 2020", "rating": 4, "user_name": "Richard Barnes", "user_url": "/user/show/4322945-richard-barnes", "text": "Lots of this is very funny but as someone who has been lucky enough to see the great man on stage, it's not as wonderful as experiencing these stories with all of the attitude, fury and warmth that he musters.There are plenty of gems here - the Last Supper as it happened in Glasgow, the Jobbie Weecha, Hotel Room in Perth and more.Along the way there are little sneaks of Connolly's philosophy of life - how to be on constant guard against beigeness, the joy of swearing.It is sad, but inevitable that Billy will not perform live again but this book, at least, gives is a slice of the magic whenever we reach for the bookcase.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3423965715", "review_id": "3423965715", "date": "Aug 01, 2020", "rating": 5, "user_name": "Haley Craig", "user_url": "/user/show/37284033-haley-craig", "text": "I'd give this so many more stars than 5 if I could!! Honestly was absolutely brilliant and just what I needed. It reads like watching his standup, tall tales and wee stories is exactly what it is and its amazing!!One thing I enjoyed was the fact that there was no plot to follow, no characters to remember and nothing to figure out. It was relaxed reading at its finest. No matter where you stopped you picked up and carried on without having to remember what previously happened. I laughed so much at this book! I've honestly never read anything that has made me laugh til tears ran down my face like this did. This will remain a firm favourite read of this year!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3815454676", "review_id": "3815454676", "date": "Feb 13, 2021", "rating": 3, "user_name": "Kyle Blackwood", "user_url": "/user/show/25506930-kyle-blackwood", "text": "I’ve loved Billy Connolly since before I should really have been listening to Billy Connolly. I remember asking my Gran what his VHS ‘Erect for 30 Years’ meant and not quite understanding why she was so coyish about it. This book is essentially a collection of all the most famous stories he’s told in his many years of stand up comedy. I wasn’t really expecting anything other than that but it still ended up falling a little bit flat. Some of the stories are still great to read and will produce a few belly-laughs but this feels like something for a time machine in case all recordings of the Big Yin have perished over time. Don’t get me wrong, its’ a good read - and a quick one - but it’s just not the same as hearing and seeing Billy tell it. I think it’s worth remembering the words of another comic - Harry Carson - when he said “It’s how I tell ‘em” when you pick this up. My advice - go to YouTube and watch the man in person!", "num_likes": 0, "sort_order": "default", "shelves": ["2021-52-book-club-challenge"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3835528550", "review_id": "3835528550", "date": "Mar 15, 2021", "rating": 3, "user_name": "Lawrence Patterson", "user_url": "/user/show/61408550-lawrence-patterson", "text": "Billy Connolly is funny and at times hilarious but probably this book full of stand up stories is best on the stage with an audience breaking its sides. Some of the stories lose something when put on paper and a number I have witnessed on the TV but any book that makes you laugh out loud every two or three pages is still worth reading. The language and the subjects can be a bit course but to enjoy the humor you have to take the rough with the smooth. Mutch of this book was taken in sessions before dropping off at night but none of the stories gave me sleepless nights - I'm not sure if that's praise or not for someone who's no bad storyteller!", "num_likes": 0, "sort_order": "default", "shelves": ["humour"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3119658005", "review_id": "3119658005", "date": "Jan 03, 2020", "rating": "", "user_name": "GEOFFREY W", "user_url": "/user/show/108104779-geoffrey-w", "text": "Might not work so well if you haven't seen TBCOAT (The Best Comedian Of All Time) preforming some of the routines (eg incontinence Pants, drinking Zombies) because of the sheer physicality of some of the humour. If, however, you have seen live or TV performances, your imagination will take you straight there. Although, as the man says, he's not been a great teller of jokes, my eternal thanks to Billy and his editors for including what is beyond disputation the best punchline gag in the known Universe EVER - Ivan the Terrible.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3282152692", "review_id": "3282152692", "date": "Apr 15, 2020", "rating": 5, "user_name": "Mr Andrew Brown", "user_url": "/user/show/90377688-mr-andrew-brown", "text": "A laugh out loud bookThis book was worth the five stars just for the anecdotes. But added to that the fact that Billy included a section on his Parkinson's disease and being Bill had to make a joke of it. I would recommend this book for everyone who is feeling down, and especially with what the world is going through at the moment. You will smile all day even if you just read story by story. My problem was I couldn't put it down and read it in 3 days...... But I will re-read it just to make me smile.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3417472650", "review_id": "3417472650", "date": "Jul 04, 2020", "rating": 2, "user_name": "Andy Lopata", "user_url": "/user/show/2997272-andy-lopata", "text": "A depressingly poor book. One of my comedy heroes but his on stage genius doesn’t translate to the page other than a handful of stories and asides. This is a collection of classic skits reproduced verbatim, some (nowhere near enough) amusing or occasionally funny stories and far too many musings that leave you grimacing and wondering what the hell that was and how you can reclaim the time you’ve just wasted. After the first few pages I committed to finishing the book and I stuck to that. We all make mistakes. Do yourself a favour and stick vintage Billy on the telly instead. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3427686730", "review_id": "3427686730", "date": "Sep 22, 2020", "rating": 5, "user_name": "alison bell", "user_url": "/user/show/54703592-alison-bell", "text": "What's not to like about this national treasure? This book is a collection of tales, some you will know from his various tv shows, some from his Audience With Billy Connolly but some are new snippets out in there to have you stifling your chuckles whilst Kay in bed next to your sleeping other half. Personally I love Billy and always have, he sees the funny side of mundane every day occurrences and that to me is priceless. Give yourself a chuckle under the eiderdown or maybe it's an overcoat and your leg's down the sleeve!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3569667380", "review_id": "3569667380", "date": "Oct 02, 2020", "rating": 5, "user_name": "Haldoor42", "user_url": "/user/show/10723836-haldoor42", "text": "Billy Connolly is my hero. He's his unapologetic self in this wonderful collection of stories from his life as a stand-up comedian, and if you don't find much to tickle your funny bone in this book, then there's something wrong with you! One of the things I love about Billy is that he's still just an ordinary approachable guy - or at least that's the way he comes across. However, 'ordinary' is really the last thing he is - he has such a unique and frankly honest view of things without being cruel. I'd read anything by him.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3589330954", "review_id": "3589330954", "date": "Oct 10, 2020", "rating": 2, "user_name": "Nick Brett", "user_url": "/user/show/2970422-nick-brett", "text": "A brilliant performer and a British National Treasure. But this didn’t really work for me which surprised me a lot. Firstly you must read it while “hearing” Billy’s voice and accent but it still falls slightly flat. When you see his stories/jokes/tales written down you miss the delivery and the way he riffs between stories or goes off at a tangent, because here they lack the delivery and the performance, they fall surprisingly flat.He is a lovely, warm and witty guy, but this didn’t work for me at all.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3783559722", "review_id": "3783559722", "date": "Jan 23, 2021", "rating": 5, "user_name": "Joanna", "user_url": "/user/show/89510182-joanna", "text": "This was brilliant. I laughed out loud many times, I \"read\" it in his voice and could often picture what he'd be doing while telling the stories. I read this in the space of a couple of days but it could just as easily work if you're someone who just liked to be able to pick up a book read for ten minutes or so and then put it down again. I'm going to see if they have this on Audible and I'd he's reading it, in which case this would be a must have. I think this is a book you could return to often.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3742575063", "review_id": "3742575063", "date": "Jan 31, 2021", "rating": 4, "user_name": "Joan", "user_url": "/user/show/108496511-joan", "text": "Not really an autobiography, just a collection of stories some of which might even be true, about Billy Connolly's life which he had in the past used as stage material in some cases. So a collection of short stories/wee tales about events in his life, or his opinions on topics. Some were hillarious and it was very easy to read them with his voice in your head which makes them even funnier. I could only read one or two in a session sometimes as I was too busy laughing at one. An enjoyable collection of amusing tales. ", "num_likes": 0, "sort_order": "default", "shelves": ["autobiography"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3761024727", "review_id": "3761024727", "date": "Feb 07, 2021", "rating": 5, "user_name": "Audrey Haylins", "user_url": "/user/show/20380375-audrey-haylins", "text": "Have you ever laughed out loud at something you’re reading? And I don’t mean a snigger, or a giggle, or even a chuckle. I mean an explosive, snort of a laugh. A joyous, spontaneous release. The kind of laugh that makes everyone else around you smile, even though they have no idea what the joke is. Well, this gem from the master raconteur Billy Connolly will have you cackling like a hyena on almost every page. Nobody, and I mean nobody, tells stories like Billy Connolly. And this collection, curated from the thousands he’s told on stage, is the best of the best. Many of them you will have heard in one version or another. Here, they are retold almost as transcripts of a live performance, complete with all the weird and wonderful diversions and exclamations he’s famous for. And, amazingly, the essence of Billy Connolly is so well contained in these pages, that you cannot help but hear his voice in your head as you read. No matter whether you’re Scottish or not, this is a book that demands to be read in a broad Glaswegian accent. Billy’s genius is that he views life through an unfiltered lens. He talks about what he sees and asks the questions that nobody else would dare. He speaks with unabashed candor about anything and everything. No subject is taboo, his observations on people and life shrewd and relentlessly funny. I’m so happy to have all these wonderful anecdotes collated and saved for posterity. This is a book I will return to time and again whenever I need a pick-me-up. And it’s one I’d highly recommend to each and every Big Yin fan. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3715177978", "review_id": "3715177978", "date": "Apr 21, 2021", "rating": 4, "user_name": "Dave McAlister", "user_url": "/user/show/45929880-dave-mcalister", "text": "As I read I could hear Billy's voice in my head which was great. Sometimes though the jokes that were great in his shows were a little flat in the reading. That's actually a complement to Billy though. It shows that is not just the joke that's important but also the person telling it. I've re-told a few of my favourites of his jokes over the years and, while they are still funny, they're not a patch on the Big Yin's version.Finally, he ends the book with some very poignant words about growing old. Words I'll try to learn from and live by.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4145879852", "review_id": "4145879852", "date": "Jul 31, 2021", "rating": 2, "user_name": "Carolyn", "user_url": "/user/show/28844783-carolyn", "text": "As already mentioned, an nteresting good bloke who is great to listen to. But this book did not do a lot for me.Many of these tall tales and wee stories are thin but I can actually remember him telling and laughing at them out loud. He is a great performer and ad libs and creates fantastic scenes to draw us in. Some I have heard a dozen times but on paper they lose vibrancy and spontaneity.I would add that his explanation of Parkinson's is extremely helpful as it strips away the humbug and tells you what it feels like", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4508403208", "review_id": "4508403208", "date": "Jan 26, 2022", "rating": 3, "user_name": "Sare W", "user_url": "/user/show/51224741-sare-w", "text": "This very funny man gives us exactly what the title promises: Tall Tales and Wee Stories. While he shares stories from his life and his insights on humanity along the way, this book is more like the Best of Billy. It's a written version of his stand up shows... rants, characters, and mid-story sidetracks included. It's funny, furious and foul-mouthed. His voice (and accent) jumps off the page. I thoroughly recommend it if you're looking for a laugh.Also good for dipping in and out if your time or attention span for reading is limited.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3103503785", "review_id": "3103503785", "date": "Jan 04, 2020", "rating": 5, "user_name": "Calvin Turton", "user_url": "/user/show/96233618-calvin-turton", "text": "Not going to lie, shed a tear at the end.Billy Connolly is one of my all time favourite comedians. I've been watching him since I was little and this book is a well rounded experience for anything Connolly does.At its heart, its a best of book but there's nothing wrong with that. Billy imparts his wisdom (and it is wisdom) through his life experiences and anecdotes, there's also some fresh stories, especially towards the end...Well worth a read, had me in stitches throughout.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3205218691", "review_id": "3205218691", "date": "Feb 29, 2020", "rating": 3, "user_name": "Michael Hastings", "user_url": "/user/show/21043458-michael-hastings", "text": "I like Billy Connolly. I think he's probably the best stand up comedian of my life time but I never got to see him in the flesh and now he's retired so I never will.This book is, as it implies, a collection of the stories Billy wove on stage over the years. Many will be new to you others will be familiar with but you will enjoy them again anyway. You will 'hear' these stories in Billy's voice (if you try a little) and you will laugh. Job done.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3217155778", "review_id": "3217155778", "date": "Mar 03, 2020", "rating": 4, "user_name": "Kerryn Lawson", "user_url": "/user/show/26158357-kerryn-lawson", "text": "The man is a legend. I think if you didn’t have any familiarity with him this book would go over your head completely. But then if you had no idea about him you probably wouldn’t pick it up in the first place! Many laughs and giggles as I pictured footage of Billy going telling these tales on stage. Not all the stories translated well in written form but many more of them did. I am now off to borrow as many Billy Connolly DVD’s from my public library as I can.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3285455817", "review_id": "3285455817", "date": "Apr 17, 2020", "rating": 5, "user_name": "Rachel", "user_url": "/user/show/110630416-rachel", "text": "Loved this book! You can’t help but read this in a Glaswegian accent, Billy’s ‘voice’ and vitality spring from the page. I found myself reading bits aloud to my husband and both of us were giggling away. This is not a biography, it is basically a transcript of Billy’s gigs - I’ve googled a few on YouTube since and you can actually hear him telling the same gags! But it’s great and funny and almost lyrical in its enjoyment of language.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3534460782", "review_id": "3534460782", "date": "Sep 11, 2020", "rating": 4, "user_name": "Jason Cotton", "user_url": "/user/show/57919979-jason-cotton", "text": "A very good and very funny book. Most people who have seen Billy over the years will already have heard most of the material in this book, but its great to see them all in one place. Its great that even though there are no 'images and videos' that are usually associated with a lot of the material its still very , very funny. He pulls no punches, so if you don't like swearing or any mention of sexuality then don't read this. You have been warned LOL", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3535155801", "review_id": "3535155801", "date": "Sep 12, 2020", "rating": 2, "user_name": "Lynda", "user_url": "/user/show/7614528-lynda", "text": "I like Billy Connolly. I like his brand of humour and his delivery but this book finally for me was an overload. Too many of the same sorts of tales feels almost too repetitive. I had some good wee laughs as I read but it became more of a struggle as I got on. Just too much. It felt a bit like, you had to be there to get the real feel of the humour. Dip into it, read bits but gorging on the whole thing felt bad for my health.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3549928723", "review_id": "3549928723", "date": "Sep 22, 2020", "rating": 3, "user_name": "Aaron Brück", "user_url": "/user/show/58696002-aaron-br-ck", "text": "Years ago I had the \"Best of Billy...\" compilation that was lodged permanently in my DVD player to be played to no end. Whilst I've enjoyed reading his books chronicling adventures across continents & across the seas, sadly this is merely a transcription of said DVD with a few other stories thrown in, and I mean verbatim! There's not too much to be felt here, to newer followers maybe a few laughs, but a series of tall yarns told in no particular order has left me somewhat underwhelmed.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3646280055", "review_id": "3646280055", "date": "Nov 23, 2020", "rating": 5, "user_name": "Jack Haugh", "user_url": "/user/show/16022269-jack-haugh", "text": "He's one of Glasgow's greats but, having been born a little too late for the peak Billy Connolly years, I've always struggled to quite get the hype. Now, I know just how cardinal that sin was. In ways, this is the perfect introduction to the living legend and found myself bursting out laughing at so many of his wee tales/stand-up routines. A must read for anyone who loves the Big Yin or, like me, wants to see just what they've been missing.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3763935597", "review_id": "3763935597", "date": "Jan 14, 2021", "rating": 5, "user_name": "A.B. Finlayson", "user_url": "/user/show/23437359-a-b-finlayson", "text": "Absolutely fantastic! Apart from the intro and end the whole thing is more like a transcript of the Big Yin's stage stories than a regular narrative. It's almost as though someone grabbed the subtitles from the tv and added a bit of punctuation. That might put some people off... the style is very unique. But you probably won't be reading this if you aren't already a fan of Billy Connolly and if you are, you're going to love it. I laughed out loud numerous times. Fantastic little book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3120855954", "review_id": "3120855954", "date": "Jan 27, 2021", "rating": 3, "user_name": "Joanne Inglis", "user_url": "/user/show/10568208-joanne-inglis", "text": "Billy Connolly's stand up routines were a large part of my upbringing because my dad could perform them so well. Long before I ever saw him on TV, I'd been hearing his words through my dad, who resembles him a bit. Not all of his humor has aged well, sadly, especially when it comes to women. Still, it's Billy and he maintains an endearing undertone throughout. Was lovely to revisit some of the stories I already knew verbatim and to read some new-to-me gems.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3276018783", "review_id": "3276018783", "date": "Feb 15, 2021", "rating": 2, "user_name": "Jennie Pease", "user_url": "/user/show/82368037-jennie-pease", "text": "I love Billy Connolly and have seen several of his live shows. He is a consummate storyteller with a sharp eye for observation and has a delivery all of his own. I was really looking forward to this book as he retired two or three years ago but was disappointed. I don't know whether it is because I have heard many of these tales before, but they fell flat without Billy's exuberant performance. The most I managed was the odd chuckle. I wish I hadn't bothered, to be honest.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3750655498", "review_id": "3750655498", "date": "Feb 15, 2021", "rating": 2, "user_name": "Colin Henderson", "user_url": "/user/show/13121378-colin-henderson", "text": "I really wanted to love this, but this book just misses Connolly’s incredible delivery that makes his such a loveable comedian. There are some great stories scattered throughout this book (“easy listening... how can something passive not be easy?!”) but this is by no means a biography of his life. Still, anyone from Glasgow will appreciate the humour and wit offered here in his life after stand up.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4201811936", "review_id": "4201811936", "date": "Aug 27, 2021", "rating": 4, "user_name": "Ian Pindar", "user_url": "/user/show/18703401-ian-pindar", "text": "If you have never had the honour of watching Billy Connolly live, this book is basically all the best bits of stage performances over the years. It is nowhere near as funny as watching him live or on a screen, but I felt a great sense of sadness that Billy is deteriorating before our eyes as I read this late at night, and I'm not sure that is good for pre-sleep psyche?His comic genius and talent is diluted on the page, so watch the clips.Ian M Pindar", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4517062398", "review_id": "4517062398", "date": "Jan 30, 2022", "rating": 5, "user_name": "Mark Cameron", "user_url": "/user/show/70212621-mark-cameron", "text": "Big Yin, Huge LaughsI love Billy, always have so maybe a bit biased but who cares? He says at the start as you read you'll hear his voice and its true. Full of fantabulous tales, some told many times, some that were new but all told with his amazing sense of mischief. Buy this book, read it in 3 days like me or take your time. One thing is fsure, if you are having a bad day this book will cheer up even the most miserable!! Enjoy", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3138503080", "review_id": "3138503080", "date": "Jan 20, 2020", "rating": 5, "user_name": "Trisha", "user_url": "/user/show/2145245-trisha", "text": "Great to relive some of the oldies and to read some new funnies. The conclusion left me with a stupid feel good grin. I'm happy I got to see the Big Yin live, it's very hard not to laugh out loud with this book, so reading it while your partner sleeps next to you may or may not be a good idea, you only live once, make it funny.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3237658722", "review_id": "3237658722", "date": "Mar 19, 2020", "rating": 4, "user_name": "Phil Aldis", "user_url": "/user/show/107914185-phil-aldis", "text": "Some of this was laugh out loud funny. It annoyed Bernie as I read in bed. Other parts were some of his old well known stories and as you knew the punchline they did not work as well. And then some left me a little uncomfortable. His lack of political correctness was great however some of it to my mind does cross a line.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3237383138", "review_id": "3237383138", "date": "Apr 02, 2020", "rating": 5, "user_name": "Stevie Turner", "user_url": "/user/show/23693312-stevie-turner", "text": "Thanks to Billy for the laughs in these trying times. Especially liked the tall tale of his schooldays and how he went to a Catholic school called 'Our Lady of Perpetual Pre-Menstrual Tension', and how it was f*****g hard going! Billy's voice was in my head as I read these stories, some of which I'd heard on TV. Keep it up, Billy!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3343355462", "review_id": "3343355462", "date": "Jun 16, 2020", "rating": 3, "user_name": "Tony Dunn", "user_url": "/user/show/108420364-tony-dunn", "text": "The only reason I didn’t give this book a better rating is because I’ve been a massive Billy Connolly fan my whole life and I already knew about 80% of the jokes that were published in here. If you’re slightly less of a fan, or even if you’re in my shoes, this will give you a right good laugh. And let’s face it, that’s what we all need right now ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3419044595", "review_id": "3419044595", "date": "Jul 03, 2020", "rating": 2, "user_name": "Sean Ollett", "user_url": "/user/show/97927220-sean-ollett", "text": "2 stars because there were a few funny lines in it. Sadly, it is just a load of his stuff from his stand up over the years in book form. On the page they are not as funny as when he performs them. I remembered a number of the routines and it was rather demoralising to realise that the stuff was that old!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3451028042", "review_id": "3451028042", "date": "Jul 19, 2020", "rating": 1, "user_name": "Agnes Jackson", "user_url": "/user/show/70506334-agnes-jackson", "text": "Bought at a charity sale in mint condition. Would never normally have purchased it. Very disappointing. Most of the tales I had heard before and many do not transfer well onto the page. Raised the occasional smile but no laughs. I feel this was just a money spinner, anyone wanting to enjoy Billy’s humour should stick to DVDs.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3498635492", "review_id": "3498635492", "date": "Aug 16, 2020", "rating": 1, "user_name": "Roberta", "user_url": "/user/show/12648924-roberta", "text": "Billy Connelly and I do not seem to share a sense of humour. There was the odd anecdote I found amusing, but most were tedious. A few just sounded like a bitter old man having a rant. His attitude to women in some of the sections is appalling.However, if you’re a fan, this is probably a hugely entertaining book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3508624473", "review_id": "3508624473", "date": "Aug 21, 2020", "rating": 4, "user_name": "Joseph Walters", "user_url": "/user/show/107576022-joseph-walters", "text": "What a a manGreat little read. Some parts of this book had me absolutely howling with laughter. The sort of things that make you want to tell someone straight away. My wife had to deal with those bits most of the time. Gutted I didn't get to watch this guy live in his prime. Thanks Billy. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3480520183", "review_id": "3480520183", "date": "Aug 26, 2020", "rating": 5, "user_name": "carol matthews", "user_url": "/user/show/67861408-carol-matthews", "text": "What a laugh. What a laugh I had reading this book most of which was read in my garden, and now the neighbours probably think that I am madder than I was before. As I spent hours out there laughing uncontrollably and wiping the tears from my eyes. What a fab time i had. I shall miss having you in my garden with me Billy. Loads of love to you. X", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3529646715", "review_id": "3529646715", "date": "Sep 03, 2020", "rating": 2, "user_name": "Trent", "user_url": "/user/show/96842896-trent", "text": "Aside from a few little insightful bits and pieces, the book is literally just a transcription of Connolly's performances. Sadly text doesn't even go close to doing his talent justice - so much of Connolly's performing is based around slapstick, gesticulation and onomatopoeia that it translates poorly to text.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3250323129", "review_id": "3250323129", "date": "Oct 06, 2020", "rating": 4, "user_name": "Vicki Willis", "user_url": "/user/show/100527082-vicki-willis", "text": "A really funny, honest and frank collection of Billy Connelly's memories from his time playing in a folk group to starring in Hollywood blockbusters. Throughout the book, you can imagine him talking to you as if he is retelling the tales to you personally- the way is written is just how he talks! Incredibly gifted & funny chap.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3634977544", "review_id": "3634977544", "date": "Dec 11, 2020", "rating": 4, "user_name": "Jonny Brick", "user_url": "/user/show/114511516-jonny-brick", "text": "Prescribe this on the NHS. Even without the actions and the movement from live performance, on the page you can imagine Billy - the folkie turned comic - spitting out every venomous anti-Beige sentiment. Lots of silliness (he'll be in Monty Python's class when the Great Book of British Comedy is written) and plenty of memoir.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3634091036", "review_id": "3634091036", "date": "Dec 21, 2020", "rating": 5, "user_name": "April Melrose", "user_url": "/user/show/117042466-april-melrose", "text": "Billy Connolly is a legend. This book certainly made me laugh just when I needed it! If your a fan of Billy you’ve probably heard most of these stories through out his career, like me. I think his previous books would be best for anyone who doesn’t want to re-read those. However I loved this. What a man 💕", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3738876293", "review_id": "3738876293", "date": "Jan 02, 2021", "rating": 5, "user_name": "Booklovingscotsman RS Green", "user_url": "/user/show/19472817-booklovingscotsman-rs-green", "text": "Brilliant. I haven’t laughed reading a book this much since ‘The night shift before Christmas’. Story after story in quick succession like his stand-up, including some of his well known tales from stand up. It ends with an honest reflection about his illnesses and dying, while still making you laugh. Definitely recommend. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3732462459", "review_id": "3732462459", "date": "Jan 02, 2021", "rating": 4, "user_name": "audrey sutton", "user_url": "/user/show/60501295-audrey-sutton", "text": "I read this book and although I knew a lot of the wee stories already it still made me laugh.I had the pleasure of seeing him live a couple of years ago which was an absolute privilege he entertained us all for two hours straight through.The book itself I think is really a final goodbye from him an end to a brilliant career and I thoroughly enjoyed it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3699808560", "review_id": "3699808560", "date": "Jan 07, 2021", "rating": 3, "user_name": "Pauric_g", "user_url": "/user/show/83242148-pauric-g", "text": "The Tall Tales and Wee Stories is a compendium of some of Billy's best loved stand-up routines. You can hear his voice in every word on every page, however this may lead you to find the recordings of many of the pieces and listen to or watch the 'Big Yin' deliver them in his own unique fashion as the book doesn't quite capture the electricity or chaotic nature of the live performance.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3760043026", "review_id": "3760043026", "date": "Jan 09, 2021", "rating": 5, "user_name": "Julia Hughes", "user_url": "/user/show/6063469-julia-hughes", "text": "Brilliant man!I couldn't stop reading, or laughing! many of the stories I'd heard before from watching the Big Yin's shows so I could hear his familiar friendly voice in my head. A lovely read by a lovely man. Sad to finish, I'll definitely read again. Bless you, Billy, you're a star. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3760508904", "review_id": "3760508904", "date": "Jan 10, 2021", "rating": 4, "user_name": "Hayley", "user_url": "/user/show/87076842-hayley", "text": "I've loved Billy Connolly's comedy from a young age, and delighted his stories are now written down. There were a good few I hadn't heard before.This book is definitely better enjoyed when you read it in Billy's voice - it just doesnt \"sound\" right in anyone else's. I really hope it gets made into an audiobook, it would be absolute gold.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3728329593", "review_id": "3728329593", "date": "Jan 10, 2021", "rating": 5, "user_name": "Jackie", "user_url": "/user/show/59095833-jackie", "text": "Oh my goodness- such a laugh out loud type of book. Every word on every page is Billy. You can hear him as you read. Some of the stories you may have already heard, but that doesn’t matter because they are still as funny as f**k. (I couldn’t write a review of Billy’s book without using the f word could I?). A wonderful snapshot of Billy’s humour- fan-f**king-tastic! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3718999616", "review_id": "3718999616", "date": "Jan 14, 2021", "rating": 4, "user_name": "Andrew Hurst", "user_url": "/user/show/73136545-andrew-hurst", "text": "This was a joy to read. I have seen Billy Connolly numerous times in concert, including his days with the Humblebums, and these anecdotes are just as funny written down as when performed on stage. He is without doubt the funniest storyteller of his generation and I would recommend this book to anyone who requires a hilarious diversion from the norm of everyday life.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3711491858", "review_id": "3711491858", "date": "Jan 15, 2021", "rating": 4, "user_name": "Darren Marshall", "user_url": "/user/show/126721792-darren-marshall", "text": "Yes a seasoned Billy fan will have heard some of these \"wee stories\" before but it's great to revisit them especially given that the Big Yin will not be performing again. Given the joy he has brought to the world, it's been a pleasure and a privilege to view his anecdotes on the printed page. Lots of laugh out loud moments. Thanks for the memories and please keep on keeping on. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3782554894", "review_id": "3782554894", "date": "Jan 19, 2021", "rating": 5, "user_name": "Fon Ellard", "user_url": "/user/show/128745564-fon-ellard", "text": "Well what could I say about Billy Connolly's Tall Tales and Wee Stories except that it's like pulling up a chair next to him and becoming enthralled with his words. Loved every minute of it. He's a wonderful man, not just hilarious but also refreshingly irreverent and inspirational in his unwavering \"don't give a f*ck\" attitude.", "num_likes": 0, "sort_order": "default", "shelves": ["biography"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3415633688", "review_id": "3415633688", "date": "Feb 07, 2021", "rating": 4, "user_name": "Jim Mitchell", "user_url": "/user/show/42088096-jim-mitchell", "text": "This is brilliant though I just finished listening to it, I didn’t read the book. I’ve been a big fan of all of Billy’s work and this has got all the less well known routines as well as the famous ones and is a great listen. Made me roll round with laughter. Not sure I’d enjoy so much in reading them. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3803229436", "review_id": "3803229436", "date": "Feb 16, 2021", "rating": 3, "user_name": "Cherryonion", "user_url": "/user/show/5617388-cherryonion", "text": "This book made me chuckle and cringe sometimes, but sadly it can't capture Connolly's physical presence or energy on stage. Some of the magic is lost in translation here. Still, it's a fun read and broken up into short stories so it's perfect for reading on the go when you don't have a lot of time and need a quick fix.", "num_likes": 0, "sort_order": "default", "shelves": ["2021"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3851624301", "review_id": "3851624301", "date": "Feb 23, 2021", "rating": 3, "user_name": "Mancman", "user_url": "/user/show/40011711-mancman", "text": "It’s a collection of routines and stories, many of which you’ll have heard before, if you’re a fan.Undoubtedly a mixed fare, but some wonderful, memorable ones for sure.But, and it is a bit, the magic is in the delivery, they way that the patter flows. Written down they’re not as magical.Still, there are words of wisdom, humour and joy in here.", "num_likes": 0, "sort_order": "default", "shelves": ["non-fiction", "2021"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3857249885", "review_id": "3857249885", "date": "Feb 25, 2021", "rating": 5, "user_name": "Dawn", "user_url": "/user/show/118677045-dawn", "text": "I have loved Billy Connolly’s humour since I was younger. He genuinely makes me laugh out loud. I loved this book. It’s split into little stories so it’s very easy to read. I was familiar with some of them through watching his shows but some of them were new to me.It’s such a great read, very funny and entertaining. A must read for any fans of Billy Connolly and Scottish humour. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3666337812", "review_id": "3666337812", "date": "Mar 07, 2021", "rating": 2, "user_name": "Julie", "user_url": "/user/show/8236243-julie", "text": "I have abandoned reading this. I love Billy Connolly and he may well be my favourite comedian, but the material is very familiar from his shows and I didn't feel like I was getting anything additional from this. I preferred watching him perform with all of the energy that goes with it. The stories are interesting, but from what I've read so far I already know them.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3904603340", "review_id": "3904603340", "date": "Mar 26, 2021", "rating": 2, "user_name": "Tony Johnston", "user_url": "/user/show/115318891-tony-johnston", "text": "Did not finish.Having read just over half this book and only laughed a handful of times, I've decided to call a halt. Unfortunately Billy's unique on stage story telling and humour just doesn't transfer to the written word. In my opinion anyway. I tried reading it with my best Billy Connolly accent in mind, sadly to no avail.As Billy says many times in his book :\"Aaaaaaaaggggggghhhhhhhh\"!!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3727572456", "review_id": "3727572456", "date": "Apr 13, 2021", "rating": 4, "user_name": "Jennifer Wilson", "user_url": "/user/show/123954947-jennifer-wilson", "text": "If you’ve ever had the pleasure of seeing Billy Connelly live you’ll enjoy this book. It’s written exactly like his stand up: a lot of rambling nonsense with some proper laugh out loud moments thrown in. I love the way he does it because the punchline sneaks up on you unexpectedly. I read the whole book in his voice in my head.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3958894615", "review_id": "3958894615", "date": "May 10, 2021", "rating": 5, "user_name": "Jason Walker", "user_url": "/user/show/108257595-jason-walker", "text": "Absolutely brilliant! I haven’t laughed this hard for ages. If you’re a Big Yin fan and can bring his cadence and style to the forefront of your mind while reading this, you’ll cry laughing throughout.What a wonderful read, I’d recommend it to any fan even if they will have heard some of the jokes before. The world will certainly miss Billy Connolly.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3997866499", "review_id": "3997866499", "date": "May 17, 2021", "rating": 5, "user_name": "Ant Bailey", "user_url": "/user/show/24490959-ant-bailey", "text": "Superb!! A proper trip down memory lane for me .... I’ve seen every Billy Connolly tape, video, DVD etc so reading these stories brought them all back. It’s impossible to read this without doing a Scottish accent in your own head but that just adds to the fun. Billy Connolly ... a good laugh! Thank you for the memories and for entertaining me so much over the years! I love you.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3950578920", "review_id": "3950578920", "date": "May 29, 2021", "rating": 3, "user_name": "Mel C", "user_url": "/user/show/31862430-mel-c", "text": "\"Always look to laugh. Nothing else will ever keep you going like laughter.\"A collection of witty, short stories and jokes from the loveable Scottish comedian. A reasonably funny read, though I imagine an audio book would capture the humor better and a bit of a struggle to follow the Scottish dialect in written form!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4109900879", "review_id": "4109900879", "date": "Jul 25, 2021", "rating": 4, "user_name": "Holly Ogg", "user_url": "/user/show/137526607-holly-ogg", "text": "As a laid back choice of book to entertain myself casually over two days, it really hit the spot, so if you’re a quick reader, expect to finish this very quickly. It’s everything you’d expect from a Billy Connelly book; swearing, good old fashioned humour and genuinely interesting anecdotes about his life. As someone who loves Billy Connelly anyway, it was a breeze to read and wholeheartedly a highly recommended “quick read”. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4303437869", "review_id": "4303437869", "date": "Oct 24, 2021", "rating": 3, "user_name": "Linda", "user_url": "/user/show/25253052-linda", "text": "3.5 starsYou definitely need to have seen Billy on stage before reading this. I think you might struggle reading it cold, so to speak.There were funny moments in the book too, but the routines got a bit lost in translation - he defo needs to be up there striding about talking, acting, describing and doing all the noises! 😅", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4411239137", "review_id": "4411239137", "date": "Dec 26, 2021", "rating": 3, "user_name": "Ann", "user_url": "/user/show/72391655-ann", "text": "I've always found Billy Connolly funny even when I was a student in Glasgow in the 70s. Lots of the material in the book was familiar to me but in a good smiley remembering way. A lighthearted book good for a chuckle in the long dark Scottish evenings. :)). Thanks for all the laughs over the decades Billy. You followed your calling and we are all the better for it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4442677102", "review_id": "4442677102", "date": "Jan 13, 2022", "rating": 4, "user_name": "Steven McCallum", "user_url": "/user/show/33972405-steven-mccallum", "text": "Excellent to read some of the Big Yin's stand-up routines, and what makes it even more hilarious is you can't read the lines without hearing his voice. Rated \"4/5\" on Goodreads as some of his material is much better when listening to him actually perform them rather than in reading them in this book. Nonetheless, an enjoyable read. 4/5.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3116867379", "review_id": "3116867379", "date": "Jan 04, 2020", "rating": 5, "user_name": "Sam Rae", "user_url": "/user/show/31838336-sam-rae", "text": " Billy has been part of my life from an early age and love everything he says and does.Alot of the stories I laughed again at, after remembering him saying them in standup routines.Enjoyed the ones I hadn't heard before.A book to treasure and the last 'story'' is one we should follow.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3122599622", "review_id": "3122599622", "date": "Jan 04, 2020", "rating": 3, "user_name": "Fiona Howells", "user_url": "/user/show/12208018-fiona-howells", "text": "An easy reading Xmas present. I like Billy Connolly, he has always made me laugh. This was a collection of anecdotes and ponderings from the big man, some obviously funnier than others, all written exactly as he would say them, so it reads like one of his stand up routines. Very sweary.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3122863830", "review_id": "3122863830", "date": "Jan 07, 2020", "rating": 5, "user_name": "Alison", "user_url": "/user/show/64442052-alison", "text": "Billy is an absolute icon and national treasure! I’m prepared to fight anyone who says otherwise!This was such a wonderful collection of his tales and made me laugh out loud on multiple occasions. Definitely a 5 star read and would recommend to anyone who loves a giggle! ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3121891106", "review_id": "3121891106", "date": "Jan 07, 2020", "rating": 4, "user_name": "Emma Rosen", "user_url": "/user/show/79732669-emma-rosen", "text": "Great for fans as this is a transcription of a wide selection of his stand up. Does lose a little from bit being supplemented by Billy's voice and enthusiasm,although you can't help but read it in his accent.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3092561393", "review_id": "3092561393", "date": "Jan 08, 2020", "rating": 4, "user_name": "Malcolm Watson", "user_url": "/user/show/12171987-malcolm-watson", "text": "A very enjoyable read! It is a collection of stories from his stage act over the years peppered with anecdotes on life, delivered in Billy's inimitable style! If you like Billy you will know many of these stories but they lose nothing in the retelling!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3015619058", "review_id": "3015619058", "date": "Jan 14, 2020", "rating": 5, "user_name": "Shannon", "user_url": "/user/show/48160921-shannon", "text": "Although this was a bit of a slow read for me due to other commitments.I laughed at this book even during dark moments of the last few months, got lost and imagined myself there and laughing along as all these stories took place before me.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3116160421", "review_id": "3116160421", "date": "Jan 17, 2020", "rating": 3, "user_name": "Trevor Elliott", "user_url": "/user/show/89029805-trevor-elliott", "text": "If you’ve seen most of Billy’s shows, you won’t need to read this book. Hearing and seeing him tell the tales and anecdotes is a much more pleasurable experience than reading them. Having said that, one or two did make me laugh out loud, even though I’d heard them before. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3148086484", "review_id": "3148086484", "date": "Jan 20, 2020", "rating": 5, "user_name": "Pauline McFarlane", "user_url": "/user/show/43561496-pauline-mcfarlane", "text": "My God, what a book. I've always lived Billy Connolly, he's a national treasure of my homeland. I've seen all his shows on first VHS, then CD. What can I say about him that hasn't already been said. I laughed myself silly all the way through this book, and all I could hear was his voice in my head. I haven't enjoyed a book this much in ages. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3172814450", "review_id": "3172814450", "date": "Feb 02, 2020", "rating": 3, "user_name": "l Green", "user_url": "/user/show/84736354-l-green", "text": "Warm and affectionate (in spite of / because of the swearing!) there is no new ground here and some old wee stories, but they're told well and so you can't help smiling and thinking of the Big Yin, as he slowly grows older and quieter", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3149679567", "review_id": "3149679567", "date": "Feb 17, 2020", "rating": 3, "user_name": "Jan Laney", "user_url": "/user/show/53166638-jan-laney", "text": "I remember many of these tales and enjoyed hearing them again. However, I don't know how much the book adds, if anything. I think I would sooner revisit the videos of stageshows as the humour is so very visual. Just the sight of the man is enough to make you laugh!", "num_likes": 0, "sort_order": "default", "shelves": ["comic"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3240394077", "review_id": "3240394077", "date": "Mar 24, 2020", "rating": 4, "user_name": "Bob Hurley", "user_url": "/user/show/77270124-bob-hurley", "text": "Enjoyed this immensely, having been a fan for years some of the tales come from various stage shows but still very funny. The balaclava tale had me holding my sides. A must read for any Billy Connolly fan", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3202378071", "review_id": "3202378071", "date": "Apr 05, 2020", "rating": 3, "user_name": "Michelle Best", "user_url": "/user/show/28187015-michelle-best", "text": "I did laugh out loud in sone parts but overall I found it a bit lacking. Maybe more ‘autobiographical’ information may have made it feel more complete.I guess Billy Connolly is mostly about the performance & not just the stories.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3291053674", "review_id": "3291053674", "date": "Apr 26, 2020", "rating": 5, "user_name": "James Widdall", "user_url": "/user/show/90687270-james-widdall", "text": "Billy Connolly is, in my eyes, the greatest comedien to have to have been born and this compiles some of his best stories. Part biography and part getting his comical legacy on paper this is a must read. Expect stories that are not politically correct, a lot of swearing, sadness and laughs.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3318024902", "review_id": "3318024902", "date": "May 04, 2020", "rating": 3, "user_name": "Keith Barraclough", "user_url": "/user/show/51926772-keith-barraclough", "text": "Exceptionally funny in parts. But doesn’t always work because a lot of his stand up was about his delivery, body language and audience interaction. So as a book I was a little disappointed. But still enjoyed it. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3333970674", "review_id": "3333970674", "date": "May 13, 2020", "rating": 5, "user_name": "Michael Lund", "user_url": "/user/show/12782524-michael-lund", "text": "One of the funniest books I've ever read. So many laugh out loud moments. Have seen Billy several times and great to read some of those stories he tells. The only book I've ever read in a Scottish (Billy) accent. Go treat yourself, you won't regret it.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3341297540", "review_id": "3341297540", "date": "May 17, 2020", "rating": 4, "user_name": "Adam", "user_url": "/user/show/2784869-adam", "text": "A collection of the Big Yin's stories, anecdotes and jokes that you can't help but read in his voice. You've probably heard them all before, but they are worth listening to again. Pull up a chair and have a pint, whilst Billy entertains you. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3386273874", "review_id": "3386273874", "date": "Jun 11, 2020", "rating": 4, "user_name": "Bruce Spydar", "user_url": "/user/show/116191912-bruce-spydar", "text": "I was given this book as Christmas reading. As usual, I found Billy's wit and vulgarity shine through in his inimitable style. The book is a bit of a meander, just like his stand up shows. Worth a read.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3406461340", "review_id": "3406461340", "date": "Jul 05, 2020", "rating": 3, "user_name": "Norton Stone", "user_url": "/user/show/13052425-norton-stone", "text": "I always thought Connolly's delivery was 90% of his act and here you get to test that theory. The material is drawn from his years of stand up and apart from The Crucifiction which I got lost in, it stands up well. He is a hard man not to like. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3432722150", "review_id": "3432722150", "date": "Jul 10, 2020", "rating": 4, "user_name": "Steven Heywood", "user_url": "/user/show/12245767-steven-heywood", "text": "Stray stories, bits of stage business, reminiscences and bits of stream of consciousness including childhood, the evils of Toblerone, the mystery that is potatoes of the night and reasons to go to a clarinet tutor.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3455403223", "review_id": "3455403223", "date": "Jul 26, 2020", "rating": 4, "user_name": "Judith Lowe", "user_url": "/user/show/43105887-judith-lowe", "text": "For those familiar with Billy, this is what you'd expect; having seen him on stage twice, I enjoyed this collection of anecdotes and could imagine his voice relating them.Some of them fall a bit flat on the page, but there are some rip-snorters that had me laughing out loud.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3424466219", "review_id": "3424466219", "date": "Jul 28, 2020", "rating": 5, "user_name": "MR J E POOLE", "user_url": "/user/show/96280679-mr-j-e-poole", "text": "Brilliant as everThis book covers material from various shows over the years and Billy continues to create brilliant humour from normal everyday events. Brilliant as ever. A genius.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3222339047", "review_id": "3222339047", "date": "Aug 06, 2020", "rating": 4, "user_name": "Pedro Paes", "user_url": "/user/show/109544101-pedro-paes", "text": "There are some parts which simply cracked me up! So just for that it was worth the read. I guess its better if you can appreciate Billy charachter before you start to read this book. A nice message at the, that i'll remember till i die :)", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3484439877", "review_id": "3484439877", "date": "Aug 07, 2020", "rating": 4, "user_name": "Paige", "user_url": "/user/show/119558978-paige", "text": "I always love everything he writes or has been written about him.Such an easy read and lots of laugh out loud moments. Makes it easy knowing his voice in my head so it was like he was talking to me.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3492467993", "review_id": "3492467993", "date": "Aug 12, 2020", "rating": 2, "user_name": "Isabel", "user_url": "/user/show/4030526-isabel", "text": "I like Billy Connolly. He is fun and a funny guy, I think. Having said that, once more I made the mistake of reading stand up comedy. It's making me laugh out loud when watching it performed but written down...nah. Not nearly as funny as performed. ", "num_likes": 0, "sort_order": "default", "shelves": ["english", "comedy"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3527831497", "review_id": "3527831497", "date": "Sep 16, 2020", "rating": 2, "user_name": "Ian", "user_url": "/user/show/68821014-ian", "text": "Really disappointing. There are a few funny anecdotes early in the book that I remember from his tv shows, but after that it deteriorates into drivel. His material is much better performed live rather than written down.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3580063427", "review_id": "3580063427", "date": "Oct 04, 2020", "rating": 5, "user_name": "Bill Bourlet", "user_url": "/user/show/121575905-bill-bourlet", "text": "Too funny. I can just see him on stage and hear him saying the words. I love him and his way of telling stories. Wish I could tell stories like that. He's a master. His observations of life is amazing. No wonder Pamela married him. Such an interesting character.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3584556338", "review_id": "3584556338", "date": "Oct 17, 2020", "rating": 5, "user_name": "Carl Sagstad", "user_url": "/user/show/86784982-carl-sagstad", "text": "Turns out he writes well, is there anything he can’t do?Lots of hilarious anecdotes I wish I could remember but I laughed out loud several times while reading.If you’re a fan of his comedy style you’ll love this!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3586668127", "review_id": "3586668127", "date": "Oct 22, 2020", "rating": 5, "user_name": "Andy Cumming", "user_url": "/user/show/73316669-andy-cumming", "text": "My Dad had a similar upbringing to Billy and I remember him uncharacteristically crying with laughter at his records. This book is full of stories I have already heard and some I hadn’t. I liked the ones I had heard him tell the best as I could more easily imagine Billy’s voice telling them.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3619496138", "review_id": "3619496138", "date": "Dec 03, 2020", "rating": 5, "user_name": "Don", "user_url": "/user/show/20233485-don", "text": "Great RecordI so appreciate having this record of some very funny sessions. Bringing back great memories of a wonderful story teller. Strongly recommend if you like Billy style of humour.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3427428877", "review_id": "3427428877", "date": "Dec 13, 2020", "rating": 4, "user_name": "Mat Greener", "user_url": "/user/show/108552670-mat-greener", "text": "Virtually all stories make you smile. I have seen Billy Connolly a few times & to hear the stories told by him causes crying with laughter so I tried reading the stories in a Scottish accent still does not get close to the real thing. If you have seen many comedians you may notice some of his stories have been plagiarised by some. New wave copying the master", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3695417016", "review_id": "3695417016", "date": "Dec 14, 2020", "rating": 5, "user_name": "john temple", "user_url": "/user/show/54964173-john-temple", "text": "F%£&ing brilliantFabulous book, brilliant stories you can hear his voice telling them as you read it. If ever you invite him to a salad buffet beware and please invite me! I laughed out loud all the way through and fervently hope he writes another", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3702094097", "review_id": "3702094097", "date": "Dec 18, 2020", "rating": 5, "user_name": "Alison Cairns", "user_url": "/user/show/11316966-alison-cairns", "text": "I loved this book, short chapters that you can pick up and put down at will. You can't help but read them in the Big Yin's inimitable voice. I bought this for my husband at Christmas but I enjoyed reading it too. Pick it up and read a chapter if you need a pick me up.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3768017624", "review_id": "3768017624", "date": "Jan 12, 2021", "rating": 5, "user_name": "Ms Rita Crawford", "user_url": "/user/show/55806814-ms-rita-crawford", "text": "Billy ConnellyIf you like Billy you'll love this stories repeated from his shows just what you need during a pandemic good laugh out loud slugs Only Billy can make the c word funny ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3773787574", "review_id": "3773787574", "date": "Jan 17, 2021", "rating": 4, "user_name": "Brian Gilbert", "user_url": "/user/show/32846182-brian-gilbert", "text": "If you.need something to cheer you up during this dreadful time, then read this book. It’s not often I laugh out loud reading a book. Lots of anecdotes true or false it doesn’t really matter. Many you may have seen him perform if you seen him on TV or live, but he is still one of the funniest.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3731454361", "review_id": "3731454361", "date": "Jan 19, 2021", "rating": 5, "user_name": "Gloria McNeill", "user_url": "/user/show/88988255-gloria-mcneill", "text": "Excellent - like being at a showFamiliar stories old and new, can hear his voice reading the book and that's not on Audible, still find his stories funny after all these years. A true all round entertainer.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3784490740", "review_id": "3784490740", "date": "Jan 20, 2021", "rating": 5, "user_name": "Mrs A. J. Turbfield", "user_url": "/user/show/54632805-mrs-a-j-turbfield", "text": "O haven't laughed like that in years, very refreshing, its so nice to read of someone with a grasshopper mind ilke my own. I aways believed I was weird, now I know that is not a bad thing to be. Thanks", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3786597936", "review_id": "3786597936", "date": "Jan 24, 2021", "rating": 4, "user_name": "Rhys Causon", "user_url": "/user/show/43884373-rhys-causon", "text": "A fantastic story teller on stage and even though not every joke works as well written down like this they are still wonderful stories. And it is such a shame he won’t be performing them onstage again.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3785659078", "review_id": "3785659078", "date": "Jan 26, 2021", "rating": 4, "user_name": "David Thomson", "user_url": "/user/show/106274901-david-thomson", "text": "Billy's greatest hitsQuite simply, this is a collection of The Big Yin's best loved anecdotes and comedy routines. There's nothing here that a regular viewer or listener of his stuff won't have heard before, but I defy anyone to read it without laughing. Loudly. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3802162023", "review_id": "3802162023", "date": "Jan 31, 2021", "rating": 4, "user_name": "Elise Thompson", "user_url": "/user/show/83833684-elise-thompson", "text": "Not many books make me laugh out loud, but this one did. Once you get into the rhythm of Scottish phonetics, this book is an easy, funny weekend read. I found myself reading whole chapters to my husband to make him smile.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3737859636", "review_id": "3737859636", "date": "Feb 02, 2021", "rating": 4, "user_name": "Crawford", "user_url": "/user/show/127617897-crawford", "text": "Parts were really funny and I laughed out loud. Unfortunately I had heard him actually tell a number of the stories so they were not a surprise. Written in wee short sections so ideal reading on a train or bus or something. Recommended. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3804297018", "review_id": "3804297018", "date": "Feb 02, 2021", "rating": 2, "user_name": "CuteBadger", "user_url": "/user/show/4084869-cutebadger", "text": "This book is really just some of his routines written down word for word. So if you're a Billy Connolly fan you'll have heard all this already and don't need to spend your money on it. Slightly disappointing.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3819352243", "review_id": "3819352243", "date": "Feb 05, 2021", "rating": 5, "user_name": "Lorraine Cawdron", "user_url": "/user/show/57949678-lorraine-cawdron", "text": "God of the Comedy worldThis man is a genius. I loved this book. I have watched and listened over the years to Billy, and can honestly say I have never cried so much with laughter. Well done Billy for putting it on paper", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3812071205", "review_id": "3812071205", "date": "Feb 06, 2021", "rating": 5, "user_name": "Vanessa", "user_url": "/user/show/128075969-vanessa", "text": "This collection of observations by Billy Connolly is just what was needed in the seriousness going on right now. A great bit of humour and escapism. As the stories were generally quite short, I could dip in and out when I had time rather than have to remember what had gone before!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3582187529", "review_id": "3582187529", "date": "Feb 15, 2021", "rating": 5, "user_name": "Terrence  Whitter", "user_url": "/user/show/49046230-terrence-whitter", "text": "Honestly a must own book, the best of Billy's stand up all in one book.I laughed so much and I can see me re reading this in the future and if you have any interest in the comedian Billy then this is the book for you. I'm so glad this book was finally released.😊", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3833523625", "review_id": "3833523625", "date": "Mar 01, 2021", "rating": 3, "user_name": "Maria Lyle", "user_url": "/user/show/94996717-maria-lyle", "text": "The only reason I went for three stars rather than 4/5 is that I had heard most of the anecdotes before delivered in various stand up routines- perhaps, unfairly, I had hoped for more things that I hadn’t. I still enjoyed reading reading it, and you can very much hear Billy’s voice in every word. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3823339408", "review_id": "3823339408", "date": "Mar 04, 2021", "rating": 5, "user_name": "Robert Colvin", "user_url": "/user/show/119578851-robert-colvin", "text": "Great recap on some of best storiesSome of his greatest stories ever told on stage in here and made me laugh throughout. I could almost hear him telling them to me in his own inimitable style. Easy to read on the go as it’s broken down into wee stories. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3889494745", "review_id": "3889494745", "date": "Mar 14, 2021", "rating": 5, "user_name": "Blair", "user_url": "/user/show/113923902-blair", "text": "I loved this. I laughed so much I was in tears and pain, I’ve never laughed so much at a book. I could hear his voice as I revisited his stories. A real pick me up book at such a difficult time in our lives. Everyone should read this. Billy is a true legend of Scotland. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3821259738", "review_id": "3821259738", "date": "Mar 15, 2021", "rating": 2, "user_name": "Annabelle Guthrie", "user_url": "/user/show/112068219-annabelle-guthrie", "text": "I love Billy Connolly, I think he is a great comedian and I love his work in the film and music industry but this book did not do it for me. Some of it was funny, gathering a small chuckle from me, but when the book totals 320 pages, I was highly disappointed and I found myself skimming the book. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3932921100", "review_id": "3932921100", "date": "Apr 08, 2021", "rating": 5, "user_name": "sue dawson", "user_url": "/user/show/51629256-sue-dawson", "text": "FantasticI laughed so much at this book,and I needed it. I have just lost my husband and I don't mean I can't find him,he died,and this book made it easier for me, believe it or not. Billy has a knack and I hope he writes many more.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4010850498", "review_id": "4010850498", "date": "May 19, 2021", "rating": 3, "user_name": "Caitlin Donnelly", "user_url": "/user/show/22166395-caitlin-donnelly", "text": "A funny book that reads just like Billy talks which I enjoyed on surface level. It’s full of mini anecdotes some I recognised from previous stand up and it was funny. However some of the views and thoughts are outdated and don’t show billy in the best light. Nevertheless a good wee read ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4076460871", "review_id": "4076460871", "date": "Jun 24, 2021", "rating": 5, "user_name": "clanger3920", "user_url": "/user/show/48331968-clanger3920", "text": "A wee taleA very entertaining read as if Billy was on stage. A great account of his youth and early adult good but covering lots of topics we will all face with good grace and humour.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4150861305", "review_id": "4150861305", "date": "Aug 02, 2021", "rating": 1, "user_name": "George McKinnon", "user_url": "/user/show/52661106-george-mckinnon", "text": "Load of codswallop waste of time and money not funny in any way definitely not recommendedOnly read first few pages. Definitely don't recommend this book, a load of filth and codswallop, a waste of time and money", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4243031410", "review_id": "4243031410", "date": "Sep 17, 2021", "rating": "", "user_name": "Tim Starnes", "user_url": "/user/show/60610685-tim-starnes", "text": "Excellent bunch of storiesJust a great laugh of tales and memories from a hilarious story teller.Makes me want to go to Scotland during a pandemic!Thank you Billy for all the laughs and the last 50 years worth!Cheers, here's to many more laughs.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4162421757", "review_id": "4162421757", "date": "Sep 23, 2021", "rating": 3, "user_name": "R Davies", "user_url": "/user/show/13362245-r-davies", "text": "It's Billy Connolly. His voice, his jokes and tales. His voice echoes in your mind as you read each story. Some are fucking funny. Some are fucking not. Some are past their sell by date. If you like Billy, you'll like the book. Nothing more to be said.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4342065929", "review_id": "4342065929", "date": "Nov 16, 2021", "rating": 5, "user_name": "Mr M T Burns", "user_url": "/user/show/67144821-mr-m-t-burns", "text": "A good laughI loved this book, it was just like watching him on stage, what he says is really funny, but so true, I loved this book and am sure I’ll read it again, just be careful where you read it ad it’s a really laugh out loud read", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/4535928778", "review_id": "4535928778", "date": "Feb 11, 2022", "rating": 3, "user_name": "G", "user_url": "/user/show/145536539-g", "text": "A real laugh out loud collection of...Tall tales and wre stories funnily enough.Only reason I rate it a 3 is I was already familiar with alot of the material in it from his stand up, records, and TV Programmes.But honestly its the big yin an he just makes ye laugh", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3102783728", "review_id": "3102783728", "date": "Dec 27, 2019", "rating": 5, "user_name": "Phillipa", "user_url": "/user/show/107276388-phillipa", "text": "Laugh out loud as you read , as you would expect from the great BC", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3099279937", "review_id": "3099279937", "date": "Jan 02, 2020", "rating": 5, "user_name": "Laura", "user_url": "/user/show/5443195-laura", "text": "Absolutely fantastic! Billy is so raw, real and hilarious. I read most of this on my commute to and from work. I'm not gonna lie, I snorted so many times on the train! He's an icon.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3119070670", "review_id": "3119070670", "date": "Jan 02, 2020", "rating": 5, "user_name": "Johnboy Somerville", "user_url": "/user/show/49050302-johnboy-somerville", "text": "At last..... Billy finally has some insights to his funniest jokes - Billy has never written his material in the past so this is a welcome edition which coincided with a film release.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3100914198", "review_id": "3100914198", "date": "Jan 04, 2020", "rating": 3, "user_name": "Jim", "user_url": "/user/show/4786769-jim", "text": "Billy's stories are best listened to rather than read I think. However, Ibiza still had me in tears!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3109727052", "review_id": "3109727052", "date": "Jan 05, 2020", "rating": 5, "user_name": "Leo", "user_url": "/user/show/28295912-leo", "text": "Billy Connolly is an absolute genius. Hilarious from start to finish. I’ve been lucky enough to see him live too. 🏴󠁧󠁢󠁳󠁣󠁴󠁿 ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3110623759", "review_id": "3110623759", "date": "Jan 05, 2020", "rating": 5, "user_name": "Thelma MacDonald", "user_url": "/user/show/69359407-thelma-macdonald", "text": "Loved this have always enjoyed watching Billy Connelly on tv but this book made you feel he was in the room with you telling a story ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3077820966", "review_id": "3077820966", "date": "Jan 06, 2020", "rating": 4, "user_name": "Peter Anderson", "user_url": "/user/show/75822817-peter-anderson", "text": "As a fan of Billy Connolly I really enjoyed this book. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3129627361", "review_id": "3129627361", "date": "Jan 12, 2020", "rating": 5, "user_name": "Thomas Geldart", "user_url": "/user/show/43525265-thomas-geldart", "text": "If you want to read a stand up special with some heart then read this beauty.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3116239694", "review_id": "3116239694", "date": "Jan 13, 2020", "rating": 5, "user_name": "Ceej47", "user_url": "/user/show/17945640-ceej47", "text": "Loved tis book as it reminded me of all his routines that I have seen or heard over the years. Most of the material was stuff I had already heard, but it ws great to read it and laugh!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3119420348", "review_id": "3119420348", "date": "Jan 15, 2020", "rating": 5, "user_name": "Pauline Hall", "user_url": "/user/show/87397755-pauline-hall", "text": "Laughed out loud many times although I think you have to have seen Billy to fully appreciate it. Lots of happy memories wrapped up in this book. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3112790186", "review_id": "3112790186", "date": "Jan 16, 2020", "rating": 5, "user_name": "nicola lavender", "user_url": "/user/show/104359206-nicola-lavender", "text": "Amazingly funny and well written you can hear his voice as you read and i do love him... such a good read to cheer you up and remember his stand up days . ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3148072993", "review_id": "3148072993", "date": "Jan 18, 2020", "rating": 4, "user_name": "Andrew Macfarlane", "user_url": "/user/show/27264266-andrew-macfarlane", "text": "Absolutely hilarious. Had to.ration myself to.reading about.10 pages at a time as i couldnt go further for laughing. Anyone who tells you the live performance doesnt transfer to book islying.", "num_likes": 0, "sort_order": "default", "shelves": ["read-2020"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3148212439", "review_id": "3148212439", "date": "Jan 18, 2020", "rating": 5, "user_name": "John Righten", "user_url": "/user/show/14388521-john-righten", "text": "This book is worth reading for the finally paragraph alone. Not just a funny man, but a man of great integrity.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3106445290", "review_id": "3106445290", "date": "Jan 18, 2020", "rating": 5, "user_name": "Shani Irvine", "user_url": "/user/show/51656252-shani-irvine", "text": "\"My thoughts exactly!\" An excellent read! I read it in Billy's voice, was like re watching all his stand up gigs.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3147023552", "review_id": "3147023552", "date": "Jan 24, 2020", "rating": 5, "user_name": "Richard", "user_url": "/user/show/18385731-richard", "text": "Fantastic book and so funny", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3153510761", "review_id": "3153510761", "date": "Jan 25, 2020", "rating": 5, "user_name": "Iain Farmer", "user_url": "/user/show/91995048-iain-farmer", "text": "Can’t remember the last time I laughed so much!!! That poor little lady on the bus, with the bewildered look on her face😂", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3141495649", "review_id": "3141495649", "date": "Jan 31, 2020", "rating": 5, "user_name": "Edward Hart", "user_url": "/user/show/60719416-edward-hart", "text": "Extremely funny.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3171368050", "review_id": "3171368050", "date": "Feb 01, 2020", "rating": 5, "user_name": "glyn jones", "user_url": "/user/show/61185657-glyn-jones", "text": "all of billy,s famous stories,heard them all before but still a great read", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3144676842", "review_id": "3144676842", "date": "Feb 09, 2020", "rating": 4, "user_name": "Joshua", "user_url": "/user/show/95998796-joshua", "text": "Some incredibly funny stories and all told in that quintessential Connolly voice and method. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3192895098", "review_id": "3192895098", "date": "Feb 16, 2020", "rating": 3, "user_name": "Sally Taylor", "user_url": "/user/show/18543169-sally-taylor", "text": "No new material so was disappointed. I have watched him on telly over the years and love his personality ", "num_likes": 0, "sort_order": "default", "shelves": ["humor-and-comedy"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3121818958", "review_id": "3121818958", "date": "Feb 18, 2020", "rating": 5, "user_name": "Joanne Adcock", "user_url": "/user/show/19227106-joanne-adcock", "text": "Loved every bit of this book... got to the end and wanted more 🥰", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3192753545", "review_id": "3192753545", "date": "Feb 29, 2020", "rating": 4, "user_name": "Ewan Armstrong", "user_url": "/user/show/108337712-ewan-armstrong", "text": "Some classic routines and some lesser known stories made me chortle and often laugh out loud. Connolly at his best and glad there were some classics like the Last Supper included.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3206050287", "review_id": "3206050287", "date": "Mar 03, 2020", "rating": 3, "user_name": "Rosemary", "user_url": "/user/show/21153547-rosemary", "text": "I've always enjoyed Billy Connolly, but couldn't really get into this on Kindle. May have been better listening to it. Not sure if an option. Didn't complete on Kindle", "num_likes": 0, "sort_order": "default", "shelves": ["read-on-kindle", "didn-t-complete"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3226574728", "review_id": "3226574728", "date": "Mar 12, 2020", "rating": 4, "user_name": "Alex Whigham", "user_url": "/user/show/75676002-alex-whigham", "text": "Pretty funny, the second half was better than the first ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3196280045", "review_id": "3196280045", "date": "Mar 17, 2020", "rating": 5, "user_name": "Alison", "user_url": "/user/show/108005595-alison", "text": "So typically Billy, loved it", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3211527179", "review_id": "3211527179", "date": "Mar 17, 2020", "rating": 3, "user_name": " Kerry", "user_url": "/user/show/45983327-kerry", "text": "I just couldn’t get into this . I struggled with trying to read some of the sounds and couldn’t adjust to the voices as my reading . It is probably great as an audio if read by Billy. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3076206659", "review_id": "3076206659", "date": "Mar 18, 2020", "rating": 5, "user_name": "Karen Norman", "user_url": "/user/show/60530807-karen-norman", "text": "Loved it. I could hear his voice as I read some old and some new to me stories. Laughed till the tears ran down my cheeks whilst on a flight. The attendant thought I’d gone mad ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3117925487", "review_id": "3117925487", "date": "Mar 31, 2020", "rating": 2, "user_name": "Ryan Edwards", "user_url": "/user/show/63273083-ryan-edwards", "text": "Was expecting new content but it is just jokes from his gigs over the years.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3261713214", "review_id": "3261713214", "date": "Apr 03, 2020", "rating": 4, "user_name": "David", "user_url": "/user/show/12461958-david", "text": "Heard most of it before on stage but a truly excellent repository of great humour from the big yin!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3216125164", "review_id": "3216125164", "date": "Apr 12, 2020", "rating": "", "user_name": "Billy Forbes", "user_url": "/user/show/48877120-billy-forbes", "text": "great laugh", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3216427268", "review_id": "3216427268", "date": "Apr 15, 2020", "rating": 5, "user_name": "Debbie Lilley", "user_url": "/user/show/13446017-debbie-lilley", "text": "A very funny book With plenty of laugh out loud moments Especially about the Bus Journey xx", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3111270939", "review_id": "3111270939", "date": "Apr 22, 2020", "rating": 5, "user_name": "Lissa", "user_url": "/user/show/6127095-lissa", "text": "I love Billy Connolly his humour is just the best. I was never fortunate to have seen him live. But I watched all his touring shows and dvds. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3303439391", "review_id": "3303439391", "date": "Apr 26, 2020", "rating": 4, "user_name": "Sean Keefe", "user_url": "/user/show/28168035-sean-keefe", "text": "Heard most of this before, but it’s all classic Billy. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3309054563", "review_id": "3309054563", "date": "May 02, 2020", "rating": 5, "user_name": "Natalie natlikestoread", "user_url": "/user/show/101517609-natalie-natlikestoread", "text": "All of the Big Yin's stories compiled into one book. Fantastic. Not much else to say other than I laughed at every page!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3326502161", "review_id": "3326502161", "date": "May 09, 2020", "rating": "", "user_name": "Beccie", "user_url": "/user/show/58821636-beccie", "text": "loved this book, very funny and easy read", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3330661803", "review_id": "3330661803", "date": "May 12, 2020", "rating": 5, "user_name": "Steve Hunt", "user_url": "/user/show/114894511-steve-hunt", "text": "You will not be able to read this book, without the voice of Billy in your head, that alone is as good a reason to read this collection of stories, he's told to make us laugh across his career.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3202981985", "review_id": "3202981985", "date": "May 14, 2020", "rating": 2, "user_name": "David  McConachie", "user_url": "/user/show/58749904-david-mcconachie", "text": "This is a collection of his stories he has covered on stage, many I knew. The clue is in the title!! Wanted a bit more from him, he probably doesn't give a **** what I think anyway ;-) ", "num_likes": 0, "sort_order": "default", "shelves": ["biography-or-memoir", "comedy"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3336737784", "review_id": "3336737784", "date": "May 18, 2020", "rating": 5, "user_name": "Lesley", "user_url": "/user/show/61510550-lesley", "text": "I kept reading the stories in Billy's voice! And no, he didn't tell the one about the parking fairy.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3302259270", "review_id": "3302259270", "date": "May 19, 2020", "rating": 5, "user_name": "Miss H A J Black", "user_url": "/user/show/61397185-miss-h-a-j-black", "text": "So, so funny xx", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3357212087", "review_id": "3357212087", "date": "May 27, 2020", "rating": 5, "user_name": "Steve", "user_url": "/user/show/43023425-steve", "text": "It's Billy connolly. What more do you need to know? A book of his funny stories. Made me laugh throughout.... A pure genius ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3362548554", "review_id": "3362548554", "date": "May 28, 2020", "rating": 5, "user_name": "Jenny", "user_url": "/user/show/315700-jenny", "text": "Very funny. Couldn't help but read it with Billy's accent in my head!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3369191379", "review_id": "3369191379", "date": "Jun 01, 2020", "rating": 3, "user_name": "Duncan Cameron", "user_url": "/user/show/82822672-duncan-cameron", "text": "Definitely funny, but little more than a verbatim transcript of classic routines. Time would be better spent watching a Connolly YouTube playlist.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3281815122", "review_id": "3281815122", "date": "Jun 11, 2020", "rating": 1, "user_name": "Chris", "user_url": "/user/show/42179825-chris", "text": "Crude and puerile, and not even funny.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3414835266", "review_id": "3414835266", "date": "Jun 28, 2020", "rating": 1, "user_name": "Jon", "user_url": "/user/show/54547554-jon", "text": "I laughed onceHis material hasn't dated well. A lot of it comes across as unpleasant and aggressive. And there are some terrible old jokes.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3426503559", "review_id": "3426503559", "date": "Jul 05, 2020", "rating": 4, "user_name": "Bob Harrower", "user_url": "/user/show/26001246-bob-harrower", "text": "Often made me laugh.You can't ask for more than that!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3419349722", "review_id": "3419349722", "date": "Jul 07, 2020", "rating": 5, "user_name": "Phil Morris", "user_url": "/user/show/94713200-phil-morris", "text": "Very funny. Billy at his best.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3425483957", "review_id": "3425483957", "date": "Jul 08, 2020", "rating": 5, "user_name": "Matt Whitby", "user_url": "/user/show/51590029-matt-whitby", "text": "You see how much performance is part of these stories, because when I read them they sometimes just came across as angry.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3432546847", "review_id": "3432546847", "date": "Jul 08, 2020", "rating": 5, "user_name": "Ric", "user_url": "/user/show/117492228-ric", "text": "Laughed so much it hurt. This is basically his stage show stories written down, which sadly tells you he won't be touring again.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3451007516", "review_id": "3451007516", "date": "Jul 28, 2020", "rating": 2, "user_name": "Lynsey Lloyd", "user_url": "/user/show/26070387-lynsey-lloyd", "text": "I love billy Connelly and have see him live but I guess it’s in the way he says it. It just doesn’t transfer to print well at all.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3442528867", "review_id": "3442528867", "date": "Aug 04, 2020", "rating": 4, "user_name": "Tracy", "user_url": "/user/show/30569627-tracy", "text": "Read a free short extract .Have heard and seen Billy Connolly tell these exact stories on tv over the years. May buy the book at later date if it's in a sale", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3493646974", "review_id": "3493646974", "date": "Aug 13, 2020", "rating": 5, "user_name": "Kevinjwoods", "user_url": "/user/show/19951276-kevinjwoods", "text": "Caution: May contain The Crucifixion", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3505181601", "review_id": "3505181601", "date": "Aug 19, 2020", "rating": 5, "user_name": "M L Brooks ", "user_url": "/user/show/120157410-m-l-brooks", "text": "A really humorous and heartwarming telling of the life of one of Britain's best loved comedians", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3164497084", "review_id": "3164497084", "date": "Aug 23, 2020", "rating": 5, "user_name": "Donna", "user_url": "/user/show/97402244-donna", "text": "Absolutely brilliant if I could have given 10 🌟 I would have.", "num_likes": 0, "sort_order": "default", "shelves": ["favourites"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3519141030", "review_id": "3519141030", "date": "Aug 28, 2020", "rating": 4, "user_name": "Derek", "user_url": "/user/show/2611192-derek", "text": "Some laugh out loud segments, old and new, and some familiar sections that work best on stage, out of the great man's lips. I would like to see a second volume - I'm sure he has a lot more to say!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3499102530", "review_id": "3499102530", "date": "Aug 29, 2020", "rating": 4, "user_name": "Stacey Black", "user_url": "/user/show/91067049-stacey-black", "text": "Funny tales that you can't help but read in his accent. Would be so much funnier to see him tell them live but still raised a chuckle", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3564191584", "review_id": "3564191584", "date": "Sep 28, 2020", "rating": 5, "user_name": "Dean Haywood", "user_url": "/user/show/59232977-dean-haywood", "text": "Hilariously funny.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3574469882", "review_id": "3574469882", "date": "Sep 30, 2020", "rating": 5, "user_name": "Paula-Diane Lufflum", "user_url": "/user/show/78920228-paula-diane-lufflum", "text": "I laughed until I cried, I could just hear him as I read it. A book to read again and again, just open a page and you have a laugh for the day.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3041754042", "review_id": "3041754042", "date": "Oct 02, 2020", "rating": 5, "user_name": "debbie yuile", "user_url": "/user/show/69327062-debbie-yuile", "text": "Absolutely fantastic fantastic the big yin ❤", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3558485705", "review_id": "3558485705", "date": "Oct 05, 2020", "rating": 5, "user_name": "Peesa", "user_url": "/user/show/110331396-peesa", "text": "Laughed out loud whilst reading this book, Billy tells a brilliant story but also some very personal insight into his own life - well worth a read ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3596394038", "review_id": "3596394038", "date": "Oct 16, 2020", "rating": 5, "user_name": "Amy Wylie", "user_url": "/user/show/19631337-amy-wylie", "text": "My hero knows how to tell a story... Or two or three, all at the same time. I know most of his routines well but they never stop being hilarious.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3598870802", "review_id": "3598870802", "date": "Oct 16, 2020", "rating": 5, "user_name": "paul brown", "user_url": "/user/show/117800880-paul-brown", "text": "Love BillySuch a lovely and funny read! While reading it i heard every word in Billys accent! He is a fantastic story teller.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3613839942", "review_id": "3613839942", "date": "Oct 26, 2020", "rating": 5, "user_name": "James Shuttleworth", "user_url": "/user/show/123523973-james-shuttleworth", "text": "Essentially an anthology of the Big Yin's routines. Warmth, familiarity and - of course - bucket loads of humour. Long live Billy Connolly.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3636716521", "review_id": "3636716521", "date": "Nov 09, 2020", "rating": 2, "user_name": "Katie", "user_url": "/user/show/5031884-katie", "text": "I am sure this would be fantastic and very funny if I saw this live. But just reading the book with no performance leaves me finding it very flat", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3620523557", "review_id": "3620523557", "date": "Nov 19, 2020", "rating": 5, "user_name": "Graham Price", "user_url": "/user/show/105990033-graham-price", "text": "Tremendous - if you are a fan, you'll find all your favourite sketches and some you don't know, loosely grouped together into categories and sprinkled with his wisdom", "num_likes": 0, "sort_order": "default", "shelves": ["2020-books"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3666052360", "review_id": "3666052360", "date": "Dec 02, 2020", "rating": 4, "user_name": "Ralph", "user_url": "/user/show/16050840-ralph", "text": "At some points I laughed out loud which is a fine thing. Best read imagining Billy talking to you. Nice to have a Weegie who is as funny as he thinks he is", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3137481403", "review_id": "3137481403", "date": "Dec 07, 2020", "rating": "", "user_name": "Ohjaygee", "user_url": "/user/show/31681025-ohjaygee", "text": "Great!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3682267663", "review_id": "3682267663", "date": "Dec 07, 2020", "rating": 3, "user_name": "Avalon", "user_url": "/user/show/59502110-avalon", "text": "Billy Connolly tales of events in his life. Some of which are extremely funny, others are just bizarre. On this note I wouldn't recommend this particular novel", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3695310308", "review_id": "3695310308", "date": "Dec 14, 2020", "rating": 5, "user_name": "Patricia McGill", "user_url": "/user/show/96915588-patricia-mcgill", "text": "Brilliant as always !!So funny loved it ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3129076317", "review_id": "3129076317", "date": "Dec 26, 2020", "rating": 1, "user_name": "Redheadreader", "user_url": "/user/show/76733885-redheadreader", "text": "I’m sure other people would love this book, listening to Billy Connolly talk about his life, I thought I would too- unfortunately though, it just wasn’t for me. ", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3731223103", "review_id": "3731223103", "date": "Dec 31, 2020", "rating": 3, "user_name": "Anna", "user_url": "/user/show/27452802-anna", "text": "Interesting book but heard most of the stories from stand up shows.", "num_likes": 0, "sort_order": "default", "shelves": ["2020"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3270696124", "review_id": "3270696124", "date": "Jan 02, 2021", "rating": 4, "user_name": "James R.", "user_url": "/user/show/7042989-james-r", "text": "A nostalgic look back at some of Billy Connolly's classic stories. Not as good as watching him perform them but still entertaining.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3725608268", "review_id": "3725608268", "date": "Jan 02, 2021", "rating": 5, "user_name": "David Sloan", "user_url": "/user/show/15396800-david-sloan", "text": "Absolutely brilliant. Basically a transcript of all his greatest stories, all of which I knew, but still made me laugh out loud.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3742546518", "review_id": "3742546518", "date": "Jan 03, 2021", "rating": "", "user_name": "Jenny  Sinclair ", "user_url": "/user/show/98624542-jenny-sinclair", "text": "I love Billy but it repeated so many jokes i can picture the scenes in my head. But to be fair he says he doesn't give a fuck lol and thats why we love the guy", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3741245858", "review_id": "3741245858", "date": "Jan 08, 2021", "rating": "", "user_name": "Elaine", "user_url": "/user/show/2747428-elaine", "text": "Most of the book skits Ive seen on dvdFunnier live", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3754254838", "review_id": "3754254838", "date": "Jan 08, 2021", "rating": 5, "user_name": "Lynsey", "user_url": "/user/show/123070639-lynsey", "text": "Bloody brilliant! I choked in my cereal and nearly died laughing.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3733267611", "review_id": "3733267611", "date": "Jan 15, 2021", "rating": 5, "user_name": "Michelle Fletcher", "user_url": "/user/show/9954344-michelle-fletcher", "text": "What a great book to start the year with, laughter really is the best medicine. Love Billy Connelly, loved this book.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3705356702", "review_id": "3705356702", "date": "Jan 20, 2021", "rating": 4, "user_name": "Fee", "user_url": "/user/show/4619775-fee", "text": "Oh did he get stuck in at the end of the book?! Unleashed!Definitely not for everyone. Language warning-a-rama.I read the whole book with his voice in my head.", "num_likes": 0, "sort_order": "default", "shelves": ["lives-of-others"]}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3756553551", "review_id": "3756553551", "date": "Jan 21, 2021", "rating": 5, "user_name": "Wendy Leaver", "user_url": "/user/show/128074720-wendy-leaver", "text": "Too many laugh out loud moments! Wonderful, anecdotal read. FAB!", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3717637886", "review_id": "3717637886", "date": "Jan 24, 2021", "rating": 5, "user_name": "Jo Jackson", "user_url": "/user/show/66357901-jo-jackson", "text": "Thank you Billy Connolly for this book, your tales and wee stories. They have shaped your story telling to the people that have seen you on stage and that in itself is memorable.", "num_likes": 0, "sort_order": "default", "shelves": []}, {"book_id_title": "49628528-tall-tales-and-wee-stories", "book_id": "49628528-tall-tales-and-wee-stories", "book_title": "Tall Tales and Wee Stories: The Best of Billy Connolly", "review_url": "https://www.goodreads.com/review/show/3792977967", "review_id": "3792977967", "date": "Jan 28, 2021", "rating": 4, "user_name": "Steve Gargly", "user_url": "/user/show/100118902-steve-gargly", "text": "Great reading of some of Billys experiences, his voice narrates in your head and despite the interesting tales it'll never replicate the real experience of the man visually.", "num_likes": 0, "sort_order": "default", "shelves": []}]